-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:  12 Jan 2021, 19:58:16

. 
. clear

. import delimited ./output/input.csv
(80 vars, 100,000 obs)

. 
. global outcomes "tested positivetest hes onscoviddeath ons_noncoviddeath onsd
> eath"

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(21,278 observations deleted)

. safecount
  78,722

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(11 observations deleted)

. safecount
  78,711

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(40,134 missing values generated)

. replace male = 0 if sex == "F"
(40,134 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male
0

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     40,134       50.99       50.99
       Male |     38,577       49.01      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. safecount
  78,711

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(78,711 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 78711 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. safetab imd, m
4

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     55,026       69.91       69.91
               4 |     15,831       20.11       90.02
 5 most deprived |      7,854        9.98      100.00
-----------------+-----------------------------------
           Total |     78,711      100.00

. 
. drop if imd==.u
(0 observations deleted)

. safecount
  78,711

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(75,596 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(75,610 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(75,600 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(66,049 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         d `var_date'
  3.         safetab `var'_date
  4.         confirm string variable `var'_date
  5.         rename `var'_date `var'_dstr
  6.         gen `var'_date = date(`var'_dstr, "YMD")
  7.         drop `var'_dstr
  8.         format `var'_date %td 
  9. 
. }

Contains data
  obs:        78,711                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
tested_date     str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF tested_date REDACTED DUE TO SMALL N**

(62,941 missing values generated)

Contains data
  obs:        78,711                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF positivetest_date REDACTED DUE TO SMALL N**

(62,930 missing values generated)

Contains data
  obs:        78,711                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

   hes_date |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |        135        0.69        0.69
 2020-09-03 |        160        0.81        1.50
 2020-09-04 |        148        0.75        2.25
 2020-09-05 |        168        0.85        3.11
 2020-09-06 |        156        0.79        3.90
 2020-09-07 |        143        0.73        4.63
 2020-09-08 |        145        0.74        5.36
 2020-09-09 |        145        0.74        6.10
 2020-09-10 |        132        0.67        6.77
 2020-09-11 |        148        0.75        7.52
 2020-09-12 |        162        0.82        8.35
 2020-09-13 |        157        0.80        9.14
 2020-09-14 |        149        0.76        9.90
 2020-09-15 |        141        0.72       10.62
 2020-09-16 |        150        0.76       11.38
 2020-09-17 |        155        0.79       12.17
 2020-09-18 |        156        0.79       12.96
 2020-09-19 |        152        0.77       13.73
 2020-09-20 |        150        0.76       14.50
 2020-09-21 |        132        0.67       15.17
 2020-09-22 |        138        0.70       15.87
 2020-09-23 |        150        0.76       16.63
 2020-09-24 |        157        0.80       17.43
 2020-09-25 |        126        0.64       18.07
 2020-09-26 |        144        0.73       18.80
 2020-09-27 |        168        0.85       19.66
 2020-09-28 |        159        0.81       20.46
 2020-09-29 |        149        0.76       21.22
 2020-09-30 |        140        0.71       21.93
 2020-10-01 |        158        0.80       22.74
 2020-10-02 |        152        0.77       23.51
 2020-10-03 |        149        0.76       24.27
 2020-10-04 |        142        0.72       24.99
 2020-10-05 |        140        0.71       25.70
 2020-10-06 |        136        0.69       26.39
 2020-10-07 |        143        0.73       27.12
 2020-10-08 |        153        0.78       27.89
 2020-10-09 |        150        0.76       28.66
 2020-10-10 |        149        0.76       29.41
 2020-10-11 |        131        0.67       30.08
 2020-10-12 |        144        0.73       30.81
 2020-10-13 |        161        0.82       31.63
 2020-10-14 |        148        0.75       32.38
 2020-10-15 |        118        0.60       32.98
 2020-10-16 |        142        0.72       33.70
 2020-10-17 |        154        0.78       34.49
 2020-10-18 |        153        0.78       35.26
 2020-10-19 |        146        0.74       36.01
 2020-10-20 |        144        0.73       36.74
 2020-10-21 |        158        0.80       37.54
 2020-10-22 |        143        0.73       38.27
 2020-10-23 |        141        0.72       38.99
 2020-10-24 |        133        0.68       39.66
 2020-10-25 |        153        0.78       40.44
 2020-10-26 |        151        0.77       41.21
 2020-10-27 |        150        0.76       41.97
 2020-10-28 |        175        0.89       42.86
 2020-10-29 |        154        0.78       43.64
 2020-10-30 |        146        0.74       44.38
 2020-10-31 |        162        0.82       45.21
 2020-11-01 |        153        0.78       45.98
 2020-11-02 |        157        0.80       46.78
 2020-11-03 |        138        0.70       47.48
 2020-11-04 |        161        0.82       48.30
 2020-11-05 |        132        0.67       48.97
 2020-11-06 |        163        0.83       49.80
 2020-11-07 |        143        0.73       50.53
 2020-11-08 |        130        0.66       51.19
 2020-11-09 |        139        0.71       51.90
 2020-11-10 |        154        0.78       52.68
 2020-11-11 |        148        0.75       53.43
 2020-11-12 |        148        0.75       54.18
 2020-11-13 |        152        0.77       54.96
 2020-11-14 |        144        0.73       55.69
 2020-11-15 |        154        0.78       56.47
 2020-11-16 |        156        0.79       57.26
 2020-11-17 |        147        0.75       58.01
 2020-11-18 |        139        0.71       58.72
 2020-11-19 |        143        0.73       59.44
 2020-11-20 |        119        0.60       60.05
 2020-11-21 |        154        0.78       60.83
 2020-11-22 |        153        0.78       61.61
 2020-11-23 |        138        0.70       62.31
 2020-11-24 |        156        0.79       63.10
 2020-11-25 |        147        0.75       63.85
 2020-11-26 |        138        0.70       64.55
 2020-11-27 |        127        0.65       65.20
 2020-11-28 |        149        0.76       65.96
 2020-11-29 |        142        0.72       66.68
 2020-11-30 |        151        0.77       67.44
 2020-12-01 |        154        0.78       68.23
 2020-12-02 |        151        0.77       68.99
 2020-12-03 |        155        0.79       69.78
 2020-12-04 |        145        0.74       70.52
 2020-12-05 |        149        0.76       71.28
 2020-12-06 |        145        0.74       72.01
 2020-12-07 |        152        0.77       72.79
 2020-12-08 |        121        0.62       73.40
 2020-12-09 |        151        0.77       74.17
 2020-12-10 |        158        0.80       74.97
 2020-12-11 |        140        0.71       75.68
 2020-12-12 |        172        0.87       76.56
 2020-12-13 |        146        0.74       77.30
 2020-12-14 |        155        0.79       78.09
 2020-12-15 |        155        0.79       78.88
 2020-12-16 |        153        0.78       79.65
 2020-12-17 |        152        0.77       80.43
 2020-12-18 |        141        0.72       81.14
 2020-12-19 |        138        0.70       81.84
 2020-12-20 |        152        0.77       82.62
 2020-12-21 |        161        0.82       83.43
 2020-12-22 |        151        0.77       84.20
 2020-12-23 |        151        0.77       84.97
 2020-12-24 |        137        0.70       85.67
 2020-12-25 |        134        0.68       86.35
 2020-12-26 |        151        0.77       87.11
 2020-12-27 |        147        0.75       87.86
 2020-12-28 |        142        0.72       88.58
 2020-12-29 |        159        0.81       89.39
 2020-12-30 |        152        0.77       90.16
 2020-12-31 |        126        0.64       90.81
 2021-01-01 |        160        0.81       91.62
 2021-01-02 |        146        0.74       92.36
 2021-01-03 |        159        0.81       93.17
 2021-01-04 |        165        0.84       94.01
 2021-01-05 |        139        0.71       94.71
 2021-01-06 |        167        0.85       95.56
 2021-01-07 |        152        0.77       96.34
 2021-01-08 |        160        0.81       97.15
 2021-01-09 |        144        0.73       97.88
 2021-01-10 |        139        0.71       98.59
 2021-01-11 |        145        0.74       99.32
 2021-01-12 |        133        0.68      100.00
------------+-----------------------------------
      Total |     19,674      100.00
(59,037 missing values generated)

Contains data
  obs:        78,711                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF onscoviddeath_date REDACTED DUE TO SMALL N**

(75,596 missing values generated)

Contains data
  obs:        78,711                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF ons_noncoviddeath_date REDACTED DUE TO SMALL N**

(66,049 missing values generated)

Contains data
  obs:        78,711                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
ons_noncovidd~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF onsdeath_date REDACTED DUE TO SMALL N**

(62,934 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(78,711 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 safetab `i'
  5. }
(15,770 real changes made)
0

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,941       79.96       79.96
          1 |     15,770       20.04      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(15,781 real changes made)
0

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,930       79.95       79.95
          1 |     15,781       20.05      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(19,674 real changes made)
0

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,037       75.00       75.00
          1 |     19,674       25.00      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(3,115 real changes made)
0

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     75,596       96.04       96.04
          1 |      3,115        3.96      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(12,662 real changes made)
0

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     66,049       83.91       83.91
          1 |     12,662       16.09      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(15,777 real changes made)
0

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,934       79.96       79.96
          1 |     15,777       20.04      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("09/11/2020")

. gen positivetest_censor_date = d("09/11/2020")

. gen ae_censor_date = d("09/11/2020")

. gen hes_censor_date = d("09/11/2020")

. gen icu_censor_date = d("18/08/2020")

. gen cpnsdeath_censor_date  = d("09/11/2020")

. gen onsdeath_censor_date = d("09/11/2020")

. gen onscoviddeath_censor_date = d("09/11/2020")

. gen ons_noncoviddeath_censor_date = d("09/11/2020")

. gen onsconfirmeddeath_censor_date=d("09/11/2020")

. 
. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |     78,711   09nov2020           0  09nov2020  09nov2020
posit~r_date |     78,711   09nov2020           0  09nov2020  09nov2020
ae_censor_~e |     78,711   09nov2020           0  09nov2020  09nov2020
hes_censor~e |     78,711   09nov2020           0  09nov2020  09nov2020
icu_censor~e |     78,711   18aug2020           0  18aug2020  18aug2020
-------------+---------------------------------------------------------
cpnsd~r_date |     78,711   09nov2020           0  09nov2020  09nov2020
onsdeath_c~e |     78,711   09nov2020           0  09nov2020  09nov2020
onscovidde.. |     78,711   09nov2020           0  09nov2020  09nov2020
ons_n~r_date |     78,711   09nov2020           0  09nov2020  09nov2020
onsconfirm.. |     78,711   09nov2020           0  09nov2020  09nov2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. safetab ethnicity, m
10

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     11,645       14.79       14.79
                 Mixed |     11,759       14.94       29.73
Asian or Asian British |     11,915       15.14       44.87
                 Black |     11,749       14.93       59.80
                 Other |     11,885       15.10       74.90
                     . |     19,758       25.10      100.00
-----------------------+-----------------------------------
                 Total |     78,711      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(67,066 missing values generated)

.  replace eth5=2 if ethnicity==3
(11,915 real changes made)

.  replace eth5=3 if ethnicity==4
(11,749 real changes made)

.  replace eth5=4 if ethnicity==2
(11,759 real changes made)

.  replace eth5=5 if ethnicity==5
(11,885 real changes made)

.  replace eth5=6 if ethnicity==.
(19,758 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     11,645       14.79       14.79
South Asian |     11,915       15.14       29.93
      Black |     11,749       14.93       44.86
      Mixed |     11,759       14.94       59.80
      Other |     11,885       15.10       74.90
    Unknown |     19,758       25.10      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(19,745 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. safetab ethnicity_16,m
13

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |      3,789        4.81        4.81
            Irish |      3,713        4.72        9.53
      Other White |      3,649        4.64       14.17
White + Caribbean |      3,654        4.64       18.81
  White + African |      3,601        4.57       23.38
    White + Asian |      3,687        4.68       28.07
      Other mixed |      3,716        4.72       32.79
           Indian |      3,740        4.75       37.54
        Pakistani |      3,628        4.61       42.15
      Bangladeshi |      3,692        4.69       46.84
      Other Asian |      3,705        4.71       51.55
        Caribbean |      3,610        4.59       56.13
          African |      3,671        4.66       60.80
      Other Black |      3,656        4.64       65.44
          Chinese |      3,705        4.71       70.15
            Other |      3,750        4.76       74.91
          Unknown |     19,745       25.09      100.00
------------------+-----------------------------------
            Total |     78,711      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 14658 changes made)

. recode eth16 8 = 4
(eth16: 3740 changes made)

. recode eth16 9 = 5
(eth16: 3628 changes made)

. recode eth16 10 = 6
(eth16: 3692 changes made)

. recode eth16 11= 7
(eth16: 3705 changes made)

. recode eth16 12 = 8
(eth16: 3610 changes made)

. recode eth16 13 = 9
(eth16: 3671 changes made)

. recode eth16 14 = 10
(eth16: 3656 changes made)

. recode eth16 15 = 11
(eth16: 3705 changes made)

. recode eth16 99 = 12
(eth16: 14658 changes made)

. recode eth16 16 = 13
(eth16: 3750 changes made)

. recode eth16 17 = 14
(eth16: 19745 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. safetab eth16,m
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |      3,789        4.81        4.81
      Irish |      3,713        4.72        9.53
Other White |      3,649        4.64       14.17
     Indian |      3,740        4.75       18.92
  Pakistani |      3,628        4.61       23.53
Bangladeshi |      3,692        4.69       28.22
Other Asian |      3,705        4.71       32.93
  Caribbean |      3,610        4.59       37.51
    African |      3,671        4.66       42.18
Other Black |      3,656        4.64       46.82
    Chinese |      3,705        4.71       51.53
  All mixed |     14,658       18.62       70.15
      Other |      3,750        4.76       74.91
    Unknown |     19,745       25.09      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. safetab eth16 eth5, m
11

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |       534        602        531        568 |     3,789 
      Irish |       553        603        530        578 |     3,713 
Other White |       520        569        528        512 |     3,649 
     Indian |       552        570        525        523 |     3,740 
  Pakistani |       530        501        540        539 |     3,628 
Bangladeshi |       519        588        518        578 |     3,692 
Other Asian |       559        579        536        573 |     3,705 
  Caribbean |       558        557        547        531 |     3,610 
    African |       552        524        569        565 |     3,671 
Other Black |       530        563        579        566 |     3,656 
    Chinese |       539        558        566        552 |     3,705 
  All mixed |     2,248      2,172      2,215      2,187 |    14,658 
      Other |       535        553        552        582 |     3,750 
    Unknown |     2,916      2,976      3,013      2,905 |    19,745 
------------+--------------------------------------------+----------
      Total |    11,645     11,915     11,749     11,759 |    78,711 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |       574        980 |     3,789 
      Irish |       571        878 |     3,713 
Other White |       617        903 |     3,649 
     Indian |       594        976 |     3,740 
  Pakistani |       573        945 |     3,628 
Bangladeshi |       542        947 |     3,692 
Other Asian |       550        908 |     3,705 
  Caribbean |       533        884 |     3,610 
    African |       549        912 |     3,671 
Other Black |       522        896 |     3,656 
    Chinese |       554        936 |     3,705 
  All mixed |     2,162      3,674 |    14,658 
      Other |       570        958 |     3,750 
    Unknown |     2,974      4,961 |    19,745 
------------+----------------------+----------
      Total |    11,885     19,758 |    78,711 

. bysort eth5: safetab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        534        4.59        4.59
      Irish |        553        4.75        9.33
Other White |        520        4.47       13.80
     Indian |        552        4.74       18.54
  Pakistani |        530        4.55       23.09
Bangladeshi |        519        4.46       27.55
Other Asian |        559        4.80       32.35
  Caribbean |        558        4.79       37.14
    African |        552        4.74       41.88
Other Black |        530        4.55       46.43
    Chinese |        539        4.63       51.06
  All mixed |      2,248       19.30       70.36
      Other |        535        4.59       74.96
    Unknown |      2,916       25.04      100.00
------------+-----------------------------------
      Total |     11,645      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        602        5.05        5.05
      Irish |        603        5.06       10.11
Other White |        569        4.78       14.89
     Indian |        570        4.78       19.67
  Pakistani |        501        4.20       23.88
Bangladeshi |        588        4.93       28.81
Other Asian |        579        4.86       33.67
  Caribbean |        557        4.67       38.35
    African |        524        4.40       42.74
Other Black |        563        4.73       47.47
    Chinese |        558        4.68       52.15
  All mixed |      2,172       18.23       70.38
      Other |        553        4.64       75.02
    Unknown |      2,976       24.98      100.00
------------+-----------------------------------
      Total |     11,915      100.00

-------------------------------------------------------------------------------
-> eth5 = Black
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        531        4.52        4.52
      Irish |        530        4.51        9.03
Other White |        528        4.49       13.52
     Indian |        525        4.47       17.99
  Pakistani |        540        4.60       22.59
Bangladeshi |        518        4.41       27.00
Other Asian |        536        4.56       31.56
  Caribbean |        547        4.66       36.22
    African |        569        4.84       41.06
Other Black |        579        4.93       45.99
    Chinese |        566        4.82       50.80
  All mixed |      2,215       18.85       69.66
      Other |        552        4.70       74.36
    Unknown |      3,013       25.64      100.00
------------+-----------------------------------
      Total |     11,749      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        568        4.83        4.83
      Irish |        578        4.92        9.75
Other White |        512        4.35       14.10
     Indian |        523        4.45       18.55
  Pakistani |        539        4.58       23.13
Bangladeshi |        578        4.92       28.05
Other Asian |        573        4.87       32.92
  Caribbean |        531        4.52       37.44
    African |        565        4.80       42.24
Other Black |        566        4.81       47.05
    Chinese |        552        4.69       51.75
  All mixed |      2,187       18.60       70.35
      Other |        582        4.95       75.30
    Unknown |      2,905       24.70      100.00
------------+-----------------------------------
      Total |     11,759      100.00

-------------------------------------------------------------------------------
-> eth5 = Other
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        574        4.83        4.83
      Irish |        571        4.80        9.63
Other White |        617        5.19       14.83
     Indian |        594        5.00       19.82
  Pakistani |        573        4.82       24.64
Bangladeshi |        542        4.56       29.20
Other Asian |        550        4.63       33.83
  Caribbean |        533        4.48       38.32
    African |        549        4.62       42.94
Other Black |        522        4.39       47.33
    Chinese |        554        4.66       51.99
  All mixed |      2,162       18.19       70.18
      Other |        570        4.80       74.98
    Unknown |      2,974       25.02      100.00
------------+-----------------------------------
      Total |     11,885      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        980        4.96        4.96
      Irish |        878        4.44        9.40
Other White |        903        4.57       13.97
     Indian |        976        4.94       18.91
  Pakistani |        945        4.78       23.70
Bangladeshi |        947        4.79       28.49
Other Asian |        908        4.60       33.09
  Caribbean |        884        4.47       37.56
    African |        912        4.62       42.18
Other Black |        896        4.53       46.71
    Chinese |        936        4.74       51.45
  All mixed |      3,674       18.59       70.04
      Other |        958        4.85       74.89
    Unknown |      4,961       25.11      100.00
------------+-----------------------------------
      Total |     19,758      100.00

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(78,701 missing values generated)

. replace stp = sum(stp)
(78,710 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(78711 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(11,798 real changes made)

. safetab  carehometype carehome, m
22

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0      3,943 |     3,943 
        PN |         0      4,043 |     4,043 
        PS |         0      3,812 |     3,812 
         U |    66,913          0 |    66,913 
-----------+----------------------+----------
     Total |    66,913     11,798 |    78,711 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [3,12]                       units:  1
         unique values:  10                       missing .:  0/78,711

                  mean:   7.49866
              std. dev:   1.04295

           percentiles:        10%       25%       50%       75%       90%
                                 6         7         7         8         9

. 
. *gen categories of household size.
. gen hh_total_cat=.
(78,711 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(1,835 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(76,766 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(110 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(11,798 real changes made)

. 
. 
. *who are people with missing household size
. safecount if hh_total_cat==.
  0

. safecount if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,554    4.940154    .2452831          3          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     65,265    7.556117    .9682436          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |         94    11.06383    .2457602         11         12

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     11,798    7.489405    1.039533          3         11


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. safetab hh_total_cat,m
13

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        3-5 |      1,554        1.97        1.97
       6-10 |     65,265       82.92       84.89
        11+ |         94        0.12       85.01
   carehome |     11,798       14.99      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. safetab hh_total_cat carehome,m 
22

hh_total_c |       carehome
        at |         0          1 |     Total
-----------+----------------------+----------
       3-5 |     1,554          0 |     1,554 
      6-10 |    65,265          0 |    65,265 
       11+ |        94          0 |        94 
  carehome |         0     11,798 |    11,798 
-----------+----------------------+----------
     Total |    66,913     11,798 |    78,711 

. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(94 real changes made, 94 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(6 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |     78,711    2.004742    .1427246   1.098612   2.397895
   hh_linear |     78,711    7.498583    1.042653          3         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(78,218 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(3,041 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(311 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(78,711 real changes made)
(62,930 real changes made)
(62,930 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(78,711 real changes made)
(63,033 real changes made)
(63,033 missing values generated)
variable cancer was str7 now str10
(78,711 real changes made)
(63,002 real changes made)
(63,002 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(78,711 real changes made)
(63,140 real changes made)
(63,140 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(78,711 real changes made)
(63,051 real changes made)
(63,051 missing values generated)
variable chronic_liver_disease was str7 now str10
(78,711 real changes made)
(63,010 real changes made)
(63,010 missing values generated)
variable other_neuro was str7 now str10
(78,711 real changes made)
(62,937 real changes made)
(62,937 missing values generated)
variable stroke was str7 now str10
(78,711 real changes made)
(62,954 real changes made)
(62,954 missing values generated)
variable dementia was str7 now str10
(78,711 real changes made)
(62,980 real changes made)
(62,980 missing values generated)
variable esrf was str7 now str10
(78,711 real changes made)
(63,049 real changes made)
(63,049 missing values generated)
variable hypertension was str7 now str10
(78,711 real changes made)
(62,917 real changes made)
(62,917 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(78,711 real changes made)
(62,977 real changes made)
(62,977 missing values generated)
variable diabetes was str7 now str10
(78,711 real changes made)
(74,866 real changes made)
(74,866 missing values generated)
variable bmi_date_measured was str7 now str10
(78,711 real changes made)
(3,961 real changes made)
(3,961 missing values generated)
variable bp_sys_date_measured was str7 now str10
(78,711 real changes made)
(3,960 real changes made)
(3,960 missing values generated)
variable bp_dias_date_measured was str7 now str10
(78,711 real changes made)
(3,956 real changes made)
(3,956 missing values generated)
variable creatinine_date was str7 now str10
(78,711 real changes made)
(3,953 real changes made)
(3,953 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(78,711 real changes made)
(3,903 real changes made)
(3,903 missing values generated)
variable hba1c_percentage_date was str7 now str10
(78,711 real changes made)
(3,918 real changes made)
(3,918 missing values generated)
variable smoking_status_date was str7 now str10
(78,711 real changes made)
(63,147 real changes made)
(63,147 missing values generated)
variable insulin was str7 now str10
(78,711 real changes made)
(62,966 real changes made)
(62,966 missing values generated)
variable statin was str7 now str10
(78,711 real changes made)
(62,900 real changes made)
(62,900 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         safetab `newvar', m
  6.         
. }
28

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,930       79.95       79.95
          1 |     15,781       20.05      100.00
------------+-----------------------------------
      Total |     78,711      100.00
24

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,033       80.08       80.08
          1 |     15,678       19.92      100.00
------------+-----------------------------------
      Total |     78,711      100.00
7

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,002       80.04       80.04
          1 |     15,709       19.96      100.00
------------+-----------------------------------
      Total |     78,711      100.00
15

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,140       80.22       80.22
          1 |     15,571       19.78      100.00
------------+-----------------------------------
      Total |     78,711      100.00
15

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,051       80.10       80.10
          1 |     15,660       19.90      100.00
------------+-----------------------------------
      Total |     78,711      100.00
22

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,010       80.05       80.05
          1 |     15,701       19.95      100.00
------------+-----------------------------------
      Total |     78,711      100.00
12

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,937       79.96       79.96
          1 |     15,774       20.04      100.00
------------+-----------------------------------
      Total |     78,711      100.00
7

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,954       79.98       79.98
          1 |     15,757       20.02      100.00
------------+-----------------------------------
      Total |     78,711      100.00
9

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,980       80.01       80.01
          1 |     15,731       19.99      100.00
------------+-----------------------------------
      Total |     78,711      100.00
5

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,049       80.10       80.10
          1 |     15,662       19.90      100.00
------------+-----------------------------------
      Total |     78,711      100.00
13

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,917       79.93       79.93
          1 |     15,794       20.07      100.00
------------+-----------------------------------
      Total |     78,711      100.00
17

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,977       80.01       80.01
          1 |     15,734       19.99      100.00
------------+-----------------------------------
      Total |     78,711      100.00
13

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,961        5.03        5.03
          1 |     74,750       94.97      100.00
------------+-----------------------------------
      Total |     78,711      100.00
21

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,960        5.03        5.03
          1 |     74,751       94.97      100.00
------------+-----------------------------------
      Total |     78,711      100.00
22

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,956        5.03        5.03
          1 |     74,755       94.97      100.00
------------+-----------------------------------
      Total |     78,711      100.00
16

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,953        5.02        5.02
          1 |     74,758       94.98      100.00
------------+-----------------------------------
      Total |     78,711      100.00
24

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,903        4.96        4.96
          1 |     74,808       95.04      100.00
------------+-----------------------------------
      Total |     78,711      100.00
22

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,918        4.98        4.98
          1 |     74,793       95.02      100.00
------------+-----------------------------------
      Total |     78,711      100.00
20

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,147       80.23       80.23
          1 |     15,564       19.77      100.00
------------+-----------------------------------
      Total |     78,711      100.00
8

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,966       80.00       80.00
          1 |     15,745       20.00      100.00
------------+-----------------------------------
      Total |     78,711      100.00
7

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,900       79.91       79.91
          1 |     15,811       20.09      100.00
------------+-----------------------------------
      Total |     78,711      100.00
15

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,102       70.01       70.01
          1 |     23,609       29.99      100.00
------------+-----------------------------------
      Total |     78,711      100.00
5

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,085       69.98       69.98
          1 |     23,626       30.02      100.00
------------+-----------------------------------
      Total |     78,711      100.00
15

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,120       70.03       70.03
          1 |     23,591       29.97      100.00
------------+-----------------------------------
      Total |     78,711      100.00
13

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,052       69.94       69.94
          1 |     23,659       30.06      100.00
------------+-----------------------------------
      Total |     78,711      100.00
25

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,169       70.09       70.09
          1 |     23,542       29.91      100.00
------------+-----------------------------------
      Total |     78,711      100.00
15

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,102       70.01       70.01
          1 |     23,609       29.99      100.00
------------+-----------------------------------
      Total |     78,711      100.00
19

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,005       69.88       69.88
          1 |     23,706       30.12      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(6,561 real changes made, 6,561 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(3,961 missing values generated)

. gen bmi_age = age - bmi_time
(3,961 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(3,249 real changes made, 3,249 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(9,810 real changes made, 9,810 to missing)

. replace bmi_measured = . if bmi == . 
(13,771 real changes made, 13,771 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(78,711 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 1893 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 7684 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 10679 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 13804 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 13598 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 17282 changes made)

. replace bmicat = .u if bmi>=.
(13,771 real changes made, 13,771 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(76818 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(13,771 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(460 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(882 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(1,130 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(1,015 real changes made)

. replace bmicat_sa = 7 if bmi==.
(13,771 real changes made)

. 
. safetab bmicat_sa
0

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,893        2.41        2.41
          2 |      7,224        9.18       11.58
          3 |     10,257       13.03       24.61
          4 |     13,556       17.22       41.84
          5 |     13,713       17.42       59.26
          6 |     18,297       23.25       82.50
          7 |     13,771       17.50      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(63047 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(75,491 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(1,592 real changes made)

. replace smoke = 3  if smoking_status == "S"
(9,411 real changes made)

. replace smoke = .u if smoking_status == "M"
(1,594 real changes made, 1,594 to missing)

. replace smoke = .u if smoking_status == "" 
(62,894 real changes made, 62,894 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(64488 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(64,774 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(1,230 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(329 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 63215 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(63,140 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(28,078 real changes made)

. safetab immunosuppressed
0

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,633       64.33       64.33
          1 |     28,078       35.67      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50300 (30250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(85 real changes made, 85 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(78,708 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(102 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(74,650 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(7,785 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(7785 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1582 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(7,785 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(280 real changes made, 280 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(4,233 missing values generated)

. 
. gen min=.
(78,711 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(37,964 real changes made)

. replace min = SCr_adj/0.9 if male==1
(36,514 real changes made)

. replace min = min^-0.329  if male==0
(37,964 real changes made)

. replace min = min^-0.411  if male==1
(36,514 real changes made)

. replace min = 1 if min<1
(20,769 real changes made)

. 
. gen max=.
(78,711 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(37,964 real changes made)

. replace max=SCr_adj/0.9 if male==1
(36,514 real changes made)

. replace max=max^-1.209
(74,478 real changes made)

. replace max=1 if max>1
(57,942 real changes made)

. 
. gen egfr=min*max*141
(4,233 missing values generated)

. replace egfr=egfr*(0.993^age)
(74,478 real changes made)

. replace egfr=egfr*1.018 if male==0
(37,964 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(4233 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. safetab egfr_cat
0

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |        921        1.24        1.24
Stage 3 egfr 30-6 |     73,557       98.76      100.00
------------------+-----------------------------------
            Total |     74,478      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(921 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |     77,790       98.83       98.83
   eGFR <60 |        921        1.17      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(483 real changes made, 483 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,697 real changes made, 1,697 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     74,310    5.041701    1.957845   .0008987    12.8622
hba1c_mmol~l |     73,111    41.11531    18.89758   .0033364   122.2114

. gen     hba1c_pct = hba1c_percentage 
(4,401 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(73,111 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(78,380 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(76,368 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(15,644 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(1,636 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(59,088 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    59,088          0          0          0 |    59,088 
         1 |         0      2,343          0          0 |     2,343 
         2 |         0          0     15,644          0 |    15,644 
         3 |         0          0          0      1,636 |     1,636 
-----------+--------------------------------------------+----------
     Total |    59,088      2,343     15,644      1,636 |    78,711 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(76,404 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(15,831 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(60,573 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(28,708 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(13,960 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(4,938 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(5,998 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(3,482 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(330 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     50,003       63.53       63.53
  >=6.5-7.4 |     13,960       17.74       81.26
  >=7.5-7.9 |      4,938        6.27       87.54
    >=8-8.9 |      5,998        7.62       95.16
        >=9 |      3,482        4.42       99.58
    Unknown |        330        0.42      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(14,748 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(14,418 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,963       81.26       81.26
          1 |     14,418       18.32       99.58
          . |        330        0.42      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(19,623 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(1,874 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(464 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(12,666 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(2,921 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(62 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     59,088       75.07       75.07
  T1DM, controlled |      1,874        2.38       77.45
T1DM, uncontrolled |        464        0.59       78.04
  T2DM, controlled |     12,666       16.09       94.13
T2DM, uncontrolled |      2,921        3.71       97.84
Diabetes, no HbA1c |         62        0.08       97.92
                 . |      1,636        2.08      100.00
-------------------+-----------------------------------
             Total |     78,711      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,617       80.05       80.05
          1 |      1,553        9.85       89.90
          2 |      1,592       10.10      100.00
------------+-----------------------------------
      Total |     15,762      100.00

. replace asthma=0 if asthma==.
(62,949 real changes made)

. replace asthma=1 if asthma==2
(1,592 real changes made)

. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     75,566       96.00       96.00
          1 |      3,145        4.00      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(15,781 real changes made)
(15,678 real changes made)
(15,709 real changes made)
(15,571 real changes made)
(15,660 real changes made)
(15,701 real changes made)
(15,774 real changes made)
(15,757 real changes made)
(15,731 real changes made)
(15,662 real changes made)
(15,794 real changes made)
(3,145 real changes made)
(15,734 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |     78,711    2.435454    1.399865          0          9

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(6,119 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      5,360           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     15,553           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     22,312           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     18,631           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     16,855    4.486918    .7427856          4          9


. safetab comorbidity_cat,m
16

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,360        6.81        6.81
          1 |     15,553       19.76       26.57
          2 |     22,312       28.35       54.92
          3 |     18,631       23.67       78.59
          4 |     16,855       21.41      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. safetab combination_bp_meds
0

**TABLE OF combination_bp_meds REDACTED DUE TO SMALL N**


. replace combination_bp_meds=0 if combination_bp_meds<0 
(502 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(16,355 real changes made)

. safetab combination_bp_meds
0

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,777       15.98       15.98
          1 |     19,856       84.02      100.00
------------+-----------------------------------
      Total |     23,633      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(23,886 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |     78,711    2.472907     2.30728          0         12

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(15,645 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,586       99.84       99.84
          1 |        125        0.16      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(15,650 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,580       99.83       99.83
          1 |        131        0.17      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(9,468 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,505       87.03       87.03
          1 |     10,206       12.97      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(3,086 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,682       99.96       99.96
          1 |         29        0.04      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(12,564 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,613       99.88       99.88
          1 |         98        0.12      100.00
------------+-----------------------------------
      Total |     78,711      100.00
(15,650 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,584       99.84       99.84
          1 |        127        0.16      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         safetab `i'
  4. }
0

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,586       99.84       99.84
          1 |        125        0.16      100.00
------------+-----------------------------------
      Total |     78,711      100.00
0

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,580       99.83       99.83
          1 |        131        0.17      100.00
------------+-----------------------------------
      Total |     78,711      100.00
0

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,505       87.03       87.03
          1 |     10,206       12.97      100.00
------------+-----------------------------------
      Total |     78,711      100.00
0

    outcome |
onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,682       99.96       99.96
          1 |         29        0.04      100.00
------------+-----------------------------------
      Total |     78,711      100.00
0

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,613       99.88       99.88
          1 |         98        0.12      100.00
------------+-----------------------------------
      Total |     78,711      100.00
0

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,584       99.84       99.84
          1 |        127        0.16      100.00
------------+-----------------------------------
      Total |     78,711      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_sys_dat~d  perm_immun~f  diabetes_t~e  carehometype
primary_c~se  bp_dias_da~e  temp_immun~e  diabetes_e~s  bmi_time
primary_c~re  bp_dias_da~d  temp_immun~f  diabetes_e~r  bmi_age
suspected_~e  ~l_date_date  died_ons_c..  index         cancer_cat
ae_date       hba1c~l_date  d~nfirmedc~y  onsconfirm..  temp1
icu_date      hba1c_perc..  died_ons_s~y  onssuspect~e  temp2
cpnsd~h_date  crea~te_date  died_ons_c~g  dereg_date    SCr_adj
ethni~6_date  crea~ne_date  ethnicity     ae_censor_~e  min
ethni~y_date  smoki~e_date  has_consul~y  icu_censor~e  max
bmi_measured  smoki~s_date  hba1c_per~ge  cpnsd~r_date  diabcat
bp_sys_dat~e  perm_immun~e  creatinine    onsconfirm..

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. safecount
  78,711

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. safecount
  78,711

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. safecount 
  78,711

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. /****************************************************************
> *  Create outcome specific datasets for the whole population  *
> *****************************************************************
> 
> 
> foreach i of global outcomes {
>         use ./output/analysis_dataset.dta, clear
>         drop if `i'_date <= indexdate 
>         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
>         save ./output/analysis_dataset_STSET_`i'.dta, replace
> }       
> 
> 
>         
> * Close log file 
> log close
> */
. 
end of do-file
