-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:  12 Jan 2021, 20:13:19

. 
. clear

. import delimited ./output/input.csv
(80 vars, 100,000 obs)

. 
. global outcomes "tested positivetest hes onscoviddeath ons_noncoviddeath onsd
> eath"

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(21,047 observations deleted)

. safecount
  78,953

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(14 observations deleted)

. safecount
  78,939

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(40,087 missing values generated)

. replace male = 0 if sex == "F"
(40,087 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male
0

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     40,087       50.78       50.78
       Male |     38,852       49.22      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. safecount
  78,939

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(78,939 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 78939 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. safetab imd, m
4

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     55,253       69.99       69.99
               4 |     15,713       19.91       89.90
 5 most deprived |      7,973       10.10      100.00
-----------------+-----------------------------------
           Total |     78,939      100.00

. 
. drop if imd==.u
(0 observations deleted)

. safecount
  78,939

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(75,831 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(75,836 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(75,862 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(66,327 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         d `var_date'
  3.         safetab `var'_date
  4.         confirm string variable `var'_date
  5.         rename `var'_date `var'_dstr
  6.         gen `var'_date = date(`var'_dstr, "YMD")
  7.         drop `var'_dstr
  8.         format `var'_date %td 
  9. 
. }

Contains data
  obs:        78,939                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
tested_date     str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF tested_date REDACTED DUE TO SMALL N**

(63,131 missing values generated)

Contains data
  obs:        78,939                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF positivetest_date REDACTED DUE TO SMALL N**

(63,231 missing values generated)

Contains data
  obs:        78,939                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

   hes_date |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |        139        0.70        0.70
 2020-09-03 |        156        0.79        1.50
 2020-09-04 |        139        0.70        2.20
 2020-09-05 |        153        0.78        2.98
 2020-09-06 |        155        0.79        3.76
 2020-09-07 |        129        0.65        4.42
 2020-09-08 |        171        0.87        5.28
 2020-09-09 |        155        0.79        6.07
 2020-09-10 |        136        0.69        6.76
 2020-09-11 |        155        0.79        7.55
 2020-09-12 |        146        0.74        8.29
 2020-09-13 |        151        0.77        9.05
 2020-09-14 |        148        0.75        9.80
 2020-09-15 |        133        0.67       10.48
 2020-09-16 |        115        0.58       11.06
 2020-09-17 |        143        0.73       11.78
 2020-09-18 |        136        0.69       12.47
 2020-09-19 |        161        0.82       13.29
 2020-09-20 |        139        0.70       14.00
 2020-09-21 |        133        0.67       14.67
 2020-09-22 |        140        0.71       15.38
 2020-09-23 |        172        0.87       16.25
 2020-09-24 |        147        0.75       17.00
 2020-09-25 |        150        0.76       17.76
 2020-09-26 |        159        0.81       18.56
 2020-09-27 |        151        0.77       19.33
 2020-09-28 |        136        0.69       20.02
 2020-09-29 |        155        0.79       20.81
 2020-09-30 |        157        0.80       21.60
 2020-10-01 |        162        0.82       22.42
 2020-10-02 |        153        0.78       23.20
 2020-10-03 |        146        0.74       23.94
 2020-10-04 |        145        0.74       24.68
 2020-10-05 |        148        0.75       25.43
 2020-10-06 |        144        0.73       26.16
 2020-10-07 |        134        0.68       26.84
 2020-10-08 |        143        0.73       27.56
 2020-10-09 |        137        0.69       28.26
 2020-10-10 |        160        0.81       29.07
 2020-10-11 |        157        0.80       29.86
 2020-10-12 |        156        0.79       30.65
 2020-10-13 |        140        0.71       31.36
 2020-10-14 |        135        0.68       32.05
 2020-10-15 |        164        0.83       32.88
 2020-10-16 |        162        0.82       33.70
 2020-10-17 |        123        0.62       34.33
 2020-10-18 |        143        0.73       35.05
 2020-10-19 |        141        0.72       35.77
 2020-10-20 |        171        0.87       36.63
 2020-10-21 |        168        0.85       37.48
 2020-10-22 |        143        0.73       38.21
 2020-10-23 |        136        0.69       38.90
 2020-10-24 |        149        0.76       39.66
 2020-10-25 |        133        0.67       40.33
 2020-10-26 |        144        0.73       41.06
 2020-10-27 |        165        0.84       41.90
 2020-10-28 |        156        0.79       42.69
 2020-10-29 |        144        0.73       43.42
 2020-10-30 |        126        0.64       44.06
 2020-10-31 |        140        0.71       44.77
 2020-11-01 |        140        0.71       45.48
 2020-11-02 |        142        0.72       46.20
 2020-11-03 |        147        0.75       46.94
 2020-11-04 |        134        0.68       47.62
 2020-11-05 |        130        0.66       48.28
 2020-11-06 |        143        0.73       49.01
 2020-11-07 |        167        0.85       49.85
 2020-11-08 |        164        0.83       50.68
 2020-11-09 |        166        0.84       51.53
 2020-11-10 |        144        0.73       52.26
 2020-11-11 |        146        0.74       53.00
 2020-11-12 |        136        0.69       53.69
 2020-11-13 |        131        0.66       54.35
 2020-11-14 |        150        0.76       55.11
 2020-11-15 |        134        0.68       55.79
 2020-11-16 |        153        0.78       56.57
 2020-11-17 |        160        0.81       57.38
 2020-11-18 |        134        0.68       58.06
 2020-11-19 |        164        0.83       58.89
 2020-11-20 |        163        0.83       59.72
 2020-11-21 |        153        0.78       60.49
 2020-11-22 |        145        0.74       61.23
 2020-11-23 |        162        0.82       62.05
 2020-11-24 |        174        0.88       62.93
 2020-11-25 |        141        0.72       63.65
 2020-11-26 |        161        0.82       64.46
 2020-11-27 |        154        0.78       65.24
 2020-11-28 |        148        0.75       65.99
 2020-11-29 |        139        0.70       66.70
 2020-11-30 |        165        0.84       67.54
 2020-12-01 |        151        0.77       68.30
 2020-12-02 |        147        0.75       69.05
 2020-12-03 |        153        0.78       69.82
 2020-12-04 |        161        0.82       70.64
 2020-12-05 |        158        0.80       71.44
 2020-12-06 |        143        0.73       72.17
 2020-12-07 |        152        0.77       72.94
 2020-12-08 |        160        0.81       73.75
 2020-12-09 |        134        0.68       74.43
 2020-12-10 |        156        0.79       75.22
 2020-12-11 |        148        0.75       75.97
 2020-12-12 |        166        0.84       76.81
 2020-12-13 |        146        0.74       77.55
 2020-12-14 |        158        0.80       78.35
 2020-12-15 |        151        0.77       79.12
 2020-12-16 |        131        0.66       79.78
 2020-12-17 |        167        0.85       80.63
 2020-12-18 |        156        0.79       81.42
 2020-12-19 |        161        0.82       82.24
 2020-12-20 |        148        0.75       82.99
 2020-12-21 |        148        0.75       83.74
 2020-12-22 |        144        0.73       84.47
 2020-12-23 |        139        0.70       85.17
 2020-12-24 |        135        0.68       85.86
 2020-12-25 |        133        0.67       86.53
 2020-12-26 |        144        0.73       87.26
 2020-12-27 |        167        0.85       88.11
 2020-12-28 |        146        0.74       88.85
 2020-12-29 |        136        0.69       89.54
 2020-12-30 |        141        0.72       90.25
 2020-12-31 |        151        0.77       91.02
 2021-01-01 |        127        0.64       91.66
 2021-01-02 |        142        0.72       92.38
 2021-01-03 |        155        0.79       93.17
 2021-01-04 |        153        0.78       93.95
 2021-01-05 |        158        0.80       94.75
 2021-01-06 |        151        0.77       95.51
 2021-01-07 |        149        0.76       96.27
 2021-01-08 |        142        0.72       96.99
 2021-01-09 |        139        0.70       97.69
 2021-01-10 |        149        0.76       98.45
 2021-01-11 |        145        0.74       99.18
 2021-01-12 |        161        0.82      100.00
------------+-----------------------------------
      Total |     19,720      100.00
(59,219 missing values generated)

Contains data
  obs:        78,939                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF onscoviddeath_date REDACTED DUE TO SMALL N**

(75,831 missing values generated)

Contains data
  obs:        78,939                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF ons_noncoviddeath_date REDACTED DUE TO SMALL N**

(66,327 missing values generated)

Contains data
  obs:        78,939                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
ons_noncovidd~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF onsdeath_date REDACTED DUE TO SMALL N**

(63,219 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(78,939 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 safetab `i'
  5. }
(15,808 real changes made)
0

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,131       79.97       79.97
          1 |     15,808       20.03      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(15,708 real changes made)
0

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,231       80.10       80.10
          1 |     15,708       19.90      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(19,720 real changes made)
0

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,219       75.02       75.02
          1 |     19,720       24.98      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(3,108 real changes made)
0

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     75,831       96.06       96.06
          1 |      3,108        3.94      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(12,612 real changes made)
0

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     66,327       84.02       84.02
          1 |     12,612       15.98      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(15,720 real changes made)
0

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,219       80.09       80.09
          1 |     15,720       19.91      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("09/11/2020")

. gen positivetest_censor_date = d("09/11/2020")

. gen ae_censor_date = d("09/11/2020")

. gen hes_censor_date = d("09/11/2020")

. gen icu_censor_date = d("18/08/2020")

. gen cpnsdeath_censor_date  = d("09/11/2020")

. gen onsdeath_censor_date = d("09/11/2020")

. gen onscoviddeath_censor_date = d("09/11/2020")

. gen ons_noncoviddeath_censor_date = d("09/11/2020")

. gen onsconfirmeddeath_censor_date=d("09/11/2020")

. 
. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |     78,939   09nov2020           0  09nov2020  09nov2020
posit~r_date |     78,939   09nov2020           0  09nov2020  09nov2020
ae_censor_~e |     78,939   09nov2020           0  09nov2020  09nov2020
hes_censor~e |     78,939   09nov2020           0  09nov2020  09nov2020
icu_censor~e |     78,939   18aug2020           0  18aug2020  18aug2020
-------------+---------------------------------------------------------
cpnsd~r_date |     78,939   09nov2020           0  09nov2020  09nov2020
onsdeath_c~e |     78,939   09nov2020           0  09nov2020  09nov2020
onscovidde.. |     78,939   09nov2020           0  09nov2020  09nov2020
ons_n~r_date |     78,939   09nov2020           0  09nov2020  09nov2020
onsconfirm.. |     78,939   09nov2020           0  09nov2020  09nov2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. safetab ethnicity, m
10

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     11,834       14.99       14.99
                 Mixed |     11,940       15.13       30.12
Asian or Asian British |     11,867       15.03       45.15
                 Black |     11,903       15.08       60.23
                 Other |     11,742       14.87       75.10
                     . |     19,653       24.90      100.00
-----------------------+-----------------------------------
                 Total |     78,939      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(67,105 missing values generated)

.  replace eth5=2 if ethnicity==3
(11,867 real changes made)

.  replace eth5=3 if ethnicity==4
(11,903 real changes made)

.  replace eth5=4 if ethnicity==2
(11,940 real changes made)

.  replace eth5=5 if ethnicity==5
(11,742 real changes made)

.  replace eth5=6 if ethnicity==.
(19,653 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     11,834       14.99       14.99
South Asian |     11,867       15.03       30.02
      Black |     11,903       15.08       45.10
      Mixed |     11,940       15.13       60.23
      Other |     11,742       14.87       75.10
    Unknown |     19,653       24.90      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(19,698 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. safetab ethnicity_16,m
13

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |      3,605        4.57        4.57
            Irish |      3,673        4.65        9.22
      Other White |      3,604        4.57       13.79
White + Caribbean |      3,742        4.74       18.53
  White + African |      3,736        4.73       23.26
    White + Asian |      3,779        4.79       28.05
      Other mixed |      3,635        4.60       32.65
           Indian |      3,662        4.64       37.29
        Pakistani |      3,722        4.72       42.00
      Bangladeshi |      3,790        4.80       46.81
      Other Asian |      3,716        4.71       51.51
        Caribbean |      3,727        4.72       56.23
          African |      3,757        4.76       60.99
      Other Black |      3,590        4.55       65.54
          Chinese |      3,806        4.82       70.36
            Other |      3,697        4.68       75.05
          Unknown |     19,698       24.95      100.00
------------------+-----------------------------------
            Total |     78,939      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 14892 changes made)

. recode eth16 8 = 4
(eth16: 3662 changes made)

. recode eth16 9 = 5
(eth16: 3722 changes made)

. recode eth16 10 = 6
(eth16: 3790 changes made)

. recode eth16 11= 7
(eth16: 3716 changes made)

. recode eth16 12 = 8
(eth16: 3727 changes made)

. recode eth16 13 = 9
(eth16: 3757 changes made)

. recode eth16 14 = 10
(eth16: 3590 changes made)

. recode eth16 15 = 11
(eth16: 3806 changes made)

. recode eth16 99 = 12
(eth16: 14892 changes made)

. recode eth16 16 = 13
(eth16: 3697 changes made)

. recode eth16 17 = 14
(eth16: 19698 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. safetab eth16,m
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |      3,605        4.57        4.57
      Irish |      3,673        4.65        9.22
Other White |      3,604        4.57       13.79
     Indian |      3,662        4.64       18.42
  Pakistani |      3,722        4.72       23.14
Bangladeshi |      3,790        4.80       27.94
Other Asian |      3,716        4.71       32.65
  Caribbean |      3,727        4.72       37.37
    African |      3,757        4.76       42.13
Other Black |      3,590        4.55       46.68
    Chinese |      3,806        4.82       51.50
  All mixed |     14,892       18.87       70.36
      Other |      3,697        4.68       75.05
    Unknown |     19,698       24.95      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. safetab eth16 eth5, m
11

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |       580        590        496        537 |     3,605 
      Irish |       575        556        558        542 |     3,673 
Other White |       542        554        561        536 |     3,604 
     Indian |       567        526        575        519 |     3,662 
  Pakistani |       541        547        546        591 |     3,722 
Bangladeshi |       579        574        544        578 |     3,790 
Other Asian |       561        506        551        614 |     3,716 
  Caribbean |       565        541        555        556 |     3,727 
    African |       529        554        620        591 |     3,757 
Other Black |       520        552        531        543 |     3,590 
    Chinese |       549        585        560        570 |     3,806 
  All mixed |     2,261      2,244      2,282      2,220 |    14,892 
      Other |       559        562        589        547 |     3,697 
    Unknown |     2,906      2,976      2,935      2,996 |    19,698 
------------+--------------------------------------------+----------
      Total |    11,834     11,867     11,903     11,940 |    78,939 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |       541        861 |     3,605 
      Irish |       541        901 |     3,673 
Other White |       511        900 |     3,604 
     Indian |       534        941 |     3,662 
  Pakistani |       580        917 |     3,722 
Bangladeshi |       568        947 |     3,790 
Other Asian |       583        901 |     3,716 
  Caribbean |       564        946 |     3,727 
    African |       554        909 |     3,757 
Other Black |       538        906 |     3,590 
    Chinese |       590        952 |     3,806 
  All mixed |     2,126      3,759 |    14,892 
      Other |       527        913 |     3,697 
    Unknown |     2,985      4,900 |    19,698 
------------+----------------------+----------
      Total |    11,742     19,653 |    78,939 

. bysort eth5: safetab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        580        4.90        4.90
      Irish |        575        4.86        9.76
Other White |        542        4.58       14.34
     Indian |        567        4.79       19.13
  Pakistani |        541        4.57       23.70
Bangladeshi |        579        4.89       28.60
Other Asian |        561        4.74       33.34
  Caribbean |        565        4.77       38.11
    African |        529        4.47       42.58
Other Black |        520        4.39       46.97
    Chinese |        549        4.64       51.61
  All mixed |      2,261       19.11       70.72
      Other |        559        4.72       75.44
    Unknown |      2,906       24.56      100.00
------------+-----------------------------------
      Total |     11,834      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        590        4.97        4.97
      Irish |        556        4.69        9.66
Other White |        554        4.67       14.33
     Indian |        526        4.43       18.76
  Pakistani |        547        4.61       23.37
Bangladeshi |        574        4.84       28.20
Other Asian |        506        4.26       32.47
  Caribbean |        541        4.56       37.03
    African |        554        4.67       41.70
Other Black |        552        4.65       46.35
    Chinese |        585        4.93       51.28
  All mixed |      2,244       18.91       70.19
      Other |        562        4.74       74.92
    Unknown |      2,976       25.08      100.00
------------+-----------------------------------
      Total |     11,867      100.00

-------------------------------------------------------------------------------
-> eth5 = Black
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        496        4.17        4.17
      Irish |        558        4.69        8.85
Other White |        561        4.71       13.57
     Indian |        575        4.83       18.40
  Pakistani |        546        4.59       22.99
Bangladeshi |        544        4.57       27.56
Other Asian |        551        4.63       32.19
  Caribbean |        555        4.66       36.85
    African |        620        5.21       42.06
Other Black |        531        4.46       46.52
    Chinese |        560        4.70       51.22
  All mixed |      2,282       19.17       70.39
      Other |        589        4.95       75.34
    Unknown |      2,935       24.66      100.00
------------+-----------------------------------
      Total |     11,903      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        537        4.50        4.50
      Irish |        542        4.54        9.04
Other White |        536        4.49       13.53
     Indian |        519        4.35       17.87
  Pakistani |        591        4.95       22.82
Bangladeshi |        578        4.84       27.66
Other Asian |        614        5.14       32.81
  Caribbean |        556        4.66       37.46
    African |        591        4.95       42.41
Other Black |        543        4.55       46.96
    Chinese |        570        4.77       51.73
  All mixed |      2,220       18.59       70.33
      Other |        547        4.58       74.91
    Unknown |      2,996       25.09      100.00
------------+-----------------------------------
      Total |     11,940      100.00

-------------------------------------------------------------------------------
-> eth5 = Other
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        541        4.61        4.61
      Irish |        541        4.61        9.21
Other White |        511        4.35       13.57
     Indian |        534        4.55       18.11
  Pakistani |        580        4.94       23.05
Bangladeshi |        568        4.84       27.89
Other Asian |        583        4.97       32.86
  Caribbean |        564        4.80       37.66
    African |        554        4.72       42.38
Other Black |        538        4.58       46.96
    Chinese |        590        5.02       51.98
  All mixed |      2,126       18.11       70.09
      Other |        527        4.49       74.58
    Unknown |      2,985       25.42      100.00
------------+-----------------------------------
      Total |     11,742      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        861        4.38        4.38
      Irish |        901        4.58        8.97
Other White |        900        4.58       13.55
     Indian |        941        4.79       18.33
  Pakistani |        917        4.67       23.00
Bangladeshi |        947        4.82       27.82
Other Asian |        901        4.58       32.40
  Caribbean |        946        4.81       37.22
    African |        909        4.63       41.84
Other Black |        906        4.61       46.45
    Chinese |        952        4.84       51.29
  All mixed |      3,759       19.13       70.42
      Other |        913        4.65       75.07
    Unknown |      4,900       24.93      100.00
------------+-----------------------------------
      Total |     19,653      100.00

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(78,929 missing values generated)

. replace stp = sum(stp)
(78,938 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(78939 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(11,859 real changes made)

. safetab  carehometype carehome, m
22

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0      3,951 |     3,951 
        PN |         0      3,888 |     3,888 
        PS |         0      4,020 |     4,020 
         U |    67,080          0 |    67,080 
-----------+----------------------+----------
     Total |    67,080     11,859 |    78,939 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [3,12]                       units:  1
         unique values:  10                       missing .:  0/78,939

                  mean:   7.49899
              std. dev:   1.04079

           percentiles:        10%       25%       50%       75%       90%
                                 6         7         7         8         9

. 
. *gen categories of household size.
. gen hh_total_cat=.
(78,939 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(1,739 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(77,094 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(106 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(11,859 real changes made)

. 
. 
. *who are people with missing household size
. safecount if hh_total_cat==.
  0

. safecount if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,475    4.932203    .2620506          3          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     65,519    7.551764    .9684592          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |         86    11.02326    .1515989         11         12

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     11,859    7.501138    1.046512          4         11


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. safetab hh_total_cat,m
13

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        3-5 |      1,475        1.87        1.87
       6-10 |     65,519       83.00       84.87
        11+ |         86        0.11       84.98
   carehome |     11,859       15.02      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. safetab hh_total_cat carehome,m 
22

hh_total_c |       carehome
        at |         0          1 |     Total
-----------+----------------------+----------
       3-5 |     1,475          0 |     1,475 
      6-10 |    65,519          0 |    65,519 
       11+ |        86          0 |        86 
  carehome |         0     11,859 |    11,859 
-----------+----------------------+----------
     Total |    67,080     11,859 |    78,939 

. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(86 real changes made, 86 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(2 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |     78,939    2.004846    .1422906   1.098612   2.397895
   hh_linear |     78,939    7.498968     1.04069          3         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(78,501 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(3,110 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(322 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(78,939 real changes made)
(63,102 real changes made)
(63,102 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(78,939 real changes made)
(63,131 real changes made)
(63,131 missing values generated)
variable cancer was str7 now str10
(78,939 real changes made)
(63,218 real changes made)
(63,218 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(78,939 real changes made)
(63,402 real changes made)
(63,402 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(78,939 real changes made)
(63,197 real changes made)
(63,197 missing values generated)
variable chronic_liver_disease was str7 now str10
(78,939 real changes made)
(63,142 real changes made)
(63,142 missing values generated)
variable other_neuro was str7 now str10
(78,939 real changes made)
(63,125 real changes made)
(63,125 missing values generated)
variable stroke was str7 now str10
(78,939 real changes made)
(63,264 real changes made)
(63,264 missing values generated)
variable dementia was str7 now str10
(78,939 real changes made)
(63,073 real changes made)
(63,073 missing values generated)
variable esrf was str7 now str10
(78,939 real changes made)
(63,181 real changes made)
(63,181 missing values generated)
variable hypertension was str7 now str10
(78,939 real changes made)
(63,210 real changes made)
(63,210 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(78,939 real changes made)
(63,183 real changes made)
(63,183 missing values generated)
variable diabetes was str7 now str10
(78,939 real changes made)
(75,069 real changes made)
(75,069 missing values generated)
variable bmi_date_measured was str7 now str10
(78,939 real changes made)
(3,917 real changes made)
(3,917 missing values generated)
variable bp_sys_date_measured was str7 now str10
(78,939 real changes made)
(3,980 real changes made)
(3,980 missing values generated)
variable bp_dias_date_measured was str7 now str10
(78,939 real changes made)
(3,932 real changes made)
(3,932 missing values generated)
variable creatinine_date was str7 now str10
(78,939 real changes made)
(3,923 real changes made)
(3,923 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(78,939 real changes made)
(3,965 real changes made)
(3,965 missing values generated)
variable hba1c_percentage_date was str7 now str10
(78,939 real changes made)
(3,933 real changes made)
(3,933 missing values generated)
variable smoking_status_date was str7 now str10
(78,939 real changes made)
(63,176 real changes made)
(63,176 missing values generated)
variable insulin was str7 now str10
(78,939 real changes made)
(63,177 real changes made)
(63,177 missing values generated)
variable statin was str7 now str10
(78,939 real changes made)
(63,131 real changes made)
(63,131 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         safetab `newvar', m
  6.         
. }
28

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,102       79.94       79.94
          1 |     15,837       20.06      100.00
------------+-----------------------------------
      Total |     78,939      100.00
24

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,131       79.97       79.97
          1 |     15,808       20.03      100.00
------------+-----------------------------------
      Total |     78,939      100.00
7

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,218       80.08       80.08
          1 |     15,721       19.92      100.00
------------+-----------------------------------
      Total |     78,939      100.00
15

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,402       80.32       80.32
          1 |     15,537       19.68      100.00
------------+-----------------------------------
      Total |     78,939      100.00
15

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,197       80.06       80.06
          1 |     15,742       19.94      100.00
------------+-----------------------------------
      Total |     78,939      100.00
22

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,142       79.99       79.99
          1 |     15,797       20.01      100.00
------------+-----------------------------------
      Total |     78,939      100.00
12

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,125       79.97       79.97
          1 |     15,814       20.03      100.00
------------+-----------------------------------
      Total |     78,939      100.00
7

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,264       80.14       80.14
          1 |     15,675       19.86      100.00
------------+-----------------------------------
      Total |     78,939      100.00
9

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,073       79.90       79.90
          1 |     15,866       20.10      100.00
------------+-----------------------------------
      Total |     78,939      100.00
5

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,181       80.04       80.04
          1 |     15,758       19.96      100.00
------------+-----------------------------------
      Total |     78,939      100.00
13

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,210       80.07       80.07
          1 |     15,729       19.93      100.00
------------+-----------------------------------
      Total |     78,939      100.00
17

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,183       80.04       80.04
          1 |     15,756       19.96      100.00
------------+-----------------------------------
      Total |     78,939      100.00
13

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,917        4.96        4.96
          1 |     75,022       95.04      100.00
------------+-----------------------------------
      Total |     78,939      100.00
21

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,980        5.04        5.04
          1 |     74,959       94.96      100.00
------------+-----------------------------------
      Total |     78,939      100.00
22

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,932        4.98        4.98
          1 |     75,007       95.02      100.00
------------+-----------------------------------
      Total |     78,939      100.00
16

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,923        4.97        4.97
          1 |     75,016       95.03      100.00
------------+-----------------------------------
      Total |     78,939      100.00
24

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,965        5.02        5.02
          1 |     74,974       94.98      100.00
------------+-----------------------------------
      Total |     78,939      100.00
22

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,933        4.98        4.98
          1 |     75,006       95.02      100.00
------------+-----------------------------------
      Total |     78,939      100.00
20

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,176       80.03       80.03
          1 |     15,763       19.97      100.00
------------+-----------------------------------
      Total |     78,939      100.00
8

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,177       80.03       80.03
          1 |     15,762       19.97      100.00
------------+-----------------------------------
      Total |     78,939      100.00
7

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,131       79.97       79.97
          1 |     15,808       20.03      100.00
------------+-----------------------------------
      Total |     78,939      100.00
15

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,168       69.89       69.89
          1 |     23,771       30.11      100.00
------------+-----------------------------------
      Total |     78,939      100.00
5

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,332       70.09       70.09
          1 |     23,607       29.91      100.00
------------+-----------------------------------
      Total |     78,939      100.00
15

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,206       69.94       69.94
          1 |     23,733       30.06      100.00
------------+-----------------------------------
      Total |     78,939      100.00
13

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,261       70.00       70.00
          1 |     23,678       30.00      100.00
------------+-----------------------------------
      Total |     78,939      100.00
25

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,185       69.91       69.91
          1 |     23,754       30.09      100.00
------------+-----------------------------------
      Total |     78,939      100.00
15

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,357       70.13       70.13
          1 |     23,582       29.87      100.00
------------+-----------------------------------
      Total |     78,939      100.00
19

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,333       70.10       70.10
          1 |     23,606       29.90      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(6,698 real changes made, 6,698 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(3,917 missing values generated)

. gen bmi_age = age - bmi_time
(3,917 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(3,252 real changes made, 3,252 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(9,950 real changes made, 9,950 to missing)

. replace bmi_measured = . if bmi == . 
(13,867 real changes made, 13,867 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(78,939 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 2009 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 7802 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 10702 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 13699 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 13627 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 17233 changes made)

. replace bmicat = .u if bmi>=.
(13,867 real changes made, 13,867 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(76930 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(13,867 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(448 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(848 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(1,095 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(997 real changes made)

. replace bmicat_sa = 7 if bmi==.
(13,867 real changes made)

. 
. safetab bmicat_sa
0

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,009        2.55        2.55
          2 |      7,354        9.32       11.86
          3 |     10,302       13.05       24.91
          4 |     13,452       17.04       41.95
          5 |     13,725       17.39       59.34
          6 |     18,230       23.09       82.43
          7 |     13,867       17.57      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(63063 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(75,739 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(1,535 real changes made)

. replace smoke = 3  if smoking_status == "S"
(9,468 real changes made)

. replace smoke = .u if smoking_status == "M"
(1,556 real changes made, 1,556 to missing)

. replace smoke = .u if smoking_status == "" 
(63,180 real changes made, 63,180 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(64736 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(64,990 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(1,283 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(314 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 63393 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(63,402 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(28,248 real changes made)

. safetab immunosuppressed
0

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,691       64.22       64.22
          1 |     28,248       35.78      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50300 (30250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(95 real changes made, 95 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(78,938 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(115 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(74,891 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(7,787 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(7787 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1584 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(7,787 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(263 real changes made, 263 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(4,186 missing values generated)

. 
. gen min=.
(78,939 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(37,931 real changes made)

. replace min = SCr_adj/0.9 if male==1
(36,822 real changes made)

. replace min = min^-0.329  if male==0
(37,931 real changes made)

. replace min = min^-0.411  if male==1
(36,822 real changes made)

. replace min = 1 if min<1
(20,371 real changes made)

. 
. gen max=.
(78,939 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(37,931 real changes made)

. replace max=SCr_adj/0.9 if male==1
(36,822 real changes made)

. replace max=max^-1.209
(74,753 real changes made)

. replace max=1 if max>1
(58,568 real changes made)

. 
. gen egfr=min*max*141
(4,186 missing values generated)

. replace egfr=egfr*(0.993^age)
(74,753 real changes made)

. replace egfr=egfr*1.018 if male==0
(37,931 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(4186 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. safetab egfr_cat
0

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |        867        1.16        1.16
Stage 3 egfr 30-6 |     73,886       98.84      100.00
------------------+-----------------------------------
            Total |     74,753      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(867 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |     78,072       98.90       98.90
   eGFR <60 |        867        1.10      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(453 real changes made, 453 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,675 real changes made, 1,675 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     74,553    5.029919    1.957745   .0020465   13.60874
hba1c_mmol~l |     73,299    41.10774    18.86391   .0016108   124.2804

. gen     hba1c_pct = hba1c_percentage 
(4,386 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(73,299 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(78,619 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(76,672 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(15,897 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(1,648 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(59,127 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    59,127          0          0          0 |    59,127 
         1 |         0      2,267          0          0 |     2,267 
         2 |         0          0     15,897          0 |    15,897 
         3 |         0          0          0      1,648 |     1,648 
-----------+--------------------------------------------+----------
     Total |    59,127      2,267     15,897      1,648 |    78,939 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(76,584 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(15,712 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(60,872 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(28,879 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(14,068 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(4,973 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(6,063 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(3,456 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(319 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     50,060       63.42       63.42
  >=6.5-7.4 |     14,068       17.82       81.24
  >=7.5-7.9 |      4,973        6.30       87.54
    >=8-8.9 |      6,063        7.68       95.22
        >=9 |      3,456        4.38       99.60
    Unknown |        319        0.40      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(14,811 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(14,492 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     64,128       81.24       81.24
          1 |     14,492       18.36       99.60
          . |        319        0.40      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(19,812 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(1,864 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(398 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(12,931 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(2,883 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(88 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     59,127       74.90       74.90
  T1DM, controlled |      1,864        2.36       77.26
T1DM, uncontrolled |        398        0.50       77.77
  T2DM, controlled |     12,931       16.38       94.15
T2DM, uncontrolled |      2,883        3.65       97.80
Diabetes, no HbA1c |         88        0.11       97.91
                 . |      1,648        2.09      100.00
-------------------+-----------------------------------
             Total |     78,939      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,605       79.68       79.68
          1 |      1,628       10.29       89.97
          2 |      1,586       10.03      100.00
------------+-----------------------------------
      Total |     15,819      100.00

. replace asthma=0 if asthma==.
(63,120 real changes made)

. replace asthma=1 if asthma==2
(1,586 real changes made)

. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     75,725       95.93       95.93
          1 |      3,214        4.07      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(15,837 real changes made)
(15,808 real changes made)
(15,721 real changes made)
(15,537 real changes made)
(15,742 real changes made)
(15,797 real changes made)
(15,814 real changes made)
(15,675 real changes made)
(15,866 real changes made)
(15,758 real changes made)
(15,729 real changes made)
(3,214 real changes made)
(15,756 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |     78,939    2.435475    1.394322          0         10

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(6,026 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      5,275           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     15,713           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     22,225           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     18,886           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     16,840    4.479394    .7397517          4         10


. safetab comorbidity_cat,m
16

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,275        6.68        6.68
          1 |     15,713       19.91       26.59
          2 |     22,225       28.15       54.74
          3 |     18,886       23.92       78.67
          4 |     16,840       21.33      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. safetab combination_bp_meds
0

**TABLE OF combination_bp_meds REDACTED DUE TO SMALL N**


. replace combination_bp_meds=0 if combination_bp_meds<0 
(528 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(16,473 real changes made)

. safetab combination_bp_meds
0

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,708       15.71       15.71
          1 |     19,894       84.29      100.00
------------+-----------------------------------
      Total |     23,602      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(23,979 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |     78,939    2.475088     2.30104          0         13

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(15,675 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,806       99.83       99.83
          1 |        133        0.17      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(15,578 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,809       99.84       99.84
          1 |        130        0.16      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(9,561 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,780       87.13       87.13
          1 |     10,159       12.87      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(3,091 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,922       99.98       99.98
          1 |         17        0.02      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(12,510 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,837       99.87       99.87
          1 |        102        0.13      100.00
------------+-----------------------------------
      Total |     78,939      100.00
(15,601 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,820       99.85       99.85
          1 |        119        0.15      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         safetab `i'
  4. }
0

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,806       99.83       99.83
          1 |        133        0.17      100.00
------------+-----------------------------------
      Total |     78,939      100.00
0

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,809       99.84       99.84
          1 |        130        0.16      100.00
------------+-----------------------------------
      Total |     78,939      100.00
0

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,780       87.13       87.13
          1 |     10,159       12.87      100.00
------------+-----------------------------------
      Total |     78,939      100.00
0

    outcome |
onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,922       99.98       99.98
          1 |         17        0.02      100.00
------------+-----------------------------------
      Total |     78,939      100.00
0

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,837       99.87       99.87
          1 |        102        0.13      100.00
------------+-----------------------------------
      Total |     78,939      100.00
0

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,820       99.85       99.85
          1 |        119        0.15      100.00
------------+-----------------------------------
      Total |     78,939      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_sys_dat~d  perm_immun~f  diabetes_t~e  carehometype
primary_c~se  bp_dias_da~e  temp_immun~e  diabetes_e~s  bmi_time
primary_c~re  bp_dias_da~d  temp_immun~f  diabetes_e~r  bmi_age
suspected_~e  ~l_date_date  died_ons_c..  index         cancer_cat
ae_date       hba1c~l_date  d~nfirmedc~y  onsconfirm..  temp1
icu_date      hba1c_perc..  died_ons_s~y  onssuspect~e  temp2
cpnsd~h_date  crea~te_date  died_ons_c~g  dereg_date    SCr_adj
ethni~6_date  crea~ne_date  ethnicity     ae_censor_~e  min
ethni~y_date  smoki~e_date  has_consul~y  icu_censor~e  max
bmi_measured  smoki~s_date  hba1c_per~ge  cpnsd~r_date  diabcat
bp_sys_dat~e  perm_immun~e  creatinine    onsconfirm..

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. safecount
  78,939

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. safecount
  78,939

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. safecount 
  78,939

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. /****************************************************************
> *  Create outcome specific datasets for the whole population  *
> *****************************************************************
> 
> 
> foreach i of global outcomes {
>         use ./output/analysis_dataset.dta, clear
>         drop if `i'_date <= indexdate 
>         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
>         save ./output/analysis_dataset_STSET_`i'.dta, replace
> }       
> 
> 
>         
> * Close log file 
> log close
> */
. 
end of do-file
