-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:  12 Jan 2021, 14:14:46

. 
. clear

. import delimited ./output/input.csv
(80 vars, 10,000 obs)

. 
. global outcomes "tested positivetest hes onscoviddeath ons_noncoviddeath onsd
> eath"

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(2,122 observations deleted)

. safecount
  7,878

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(0 observations deleted)

. safecount
  7,878

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(3,948 missing values generated)

. replace male = 0 if sex == "F"
(3,948 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male
0

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      3,948       50.11       50.11
       Male |      3,930       49.89      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. safecount
  7,878

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(7,878 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 7878 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. safetab imd, m
4

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      5,499       69.80       69.80
               4 |      1,572       19.95       89.76
 5 most deprived |        807       10.24      100.00
-----------------+-----------------------------------
           Total |      7,878      100.00

. 
. drop if imd==.u
(0 observations deleted)

. safecount
  7,878

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(7,585 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(7,568 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(7,547 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(6,608 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         d `var_date'
  3.         safetab `var'_date
  4.         confirm string variable `var'_date
  5.         rename `var'_date `var'_dstr
  6.         gen `var'_date = date(`var'_dstr, "YMD")
  7.         drop `var'_dstr
  8.         format `var'_date %td 
  9. 
. }

Contains data
  obs:         7,878                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
tested_date     str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF tested_date REDACTED DUE TO SMALL N**

(6,283 missing values generated)

Contains data
  obs:         7,878                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF positivetest_date REDACTED DUE TO SMALL N**

(6,327 missing values generated)

Contains data
  obs:         7,878                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

   hes_date |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |         18        0.91        0.91
 2020-09-03 |         14        0.71        1.62
 2020-09-04 |         20        1.02        2.64
 2020-09-05 |         17        0.86        3.50
 2020-09-06 |         15        0.76        4.26
 2020-09-07 |         14        0.71        4.97
 2020-09-08 |          9        0.46        5.43
 2020-09-09 |         11        0.56        5.99
 2020-09-10 |         14        0.71        6.70
 2020-09-11 |         11        0.56        7.26
 2020-09-12 |         12        0.61        7.87
 2020-09-13 |         14        0.71        8.58
 2020-09-14 |         15        0.76        9.34
 2020-09-15 |         13        0.66       10.00
 2020-09-16 |         21        1.07       11.07
 2020-09-17 |         12        0.61       11.68
 2020-09-18 |         22        1.12       12.79
 2020-09-19 |         19        0.96       13.76
 2020-09-20 |         10        0.51       14.26
 2020-09-21 |         13        0.66       14.92
 2020-09-22 |         16        0.81       15.74
 2020-09-23 |         12        0.61       16.35
 2020-09-24 |         21        1.07       17.41
 2020-09-25 |         15        0.76       18.17
 2020-09-26 |         19        0.96       19.14
 2020-09-27 |         15        0.76       19.90
 2020-09-28 |         14        0.71       20.61
 2020-09-29 |         11        0.56       21.17
 2020-09-30 |         14        0.71       21.88
 2020-10-01 |         19        0.96       22.84
 2020-10-02 |          8        0.41       23.25
 2020-10-03 |         15        0.76       24.01
 2020-10-04 |         16        0.81       24.82
 2020-10-05 |         11        0.56       25.38
 2020-10-06 |         12        0.61       25.99
 2020-10-07 |         18        0.91       26.90
 2020-10-08 |         14        0.71       27.61
 2020-10-09 |         25        1.27       28.88
 2020-10-10 |         18        0.91       29.80
 2020-10-11 |         13        0.66       30.46
 2020-10-12 |         15        0.76       31.22
 2020-10-13 |         14        0.71       31.93
 2020-10-14 |         11        0.56       32.49
 2020-10-15 |         16        0.81       33.30
 2020-10-16 |         13        0.66       33.96
 2020-10-17 |         17        0.86       34.82
 2020-10-18 |         12        0.61       35.43
 2020-10-19 |         18        0.91       36.35
 2020-10-20 |         18        0.91       37.26
 2020-10-21 |         14        0.71       37.97
 2020-10-22 |         10        0.51       38.48
 2020-10-23 |         17        0.86       39.34
 2020-10-24 |          9        0.46       39.80
 2020-10-25 |         13        0.66       40.46
 2020-10-26 |         13        0.66       41.12
 2020-10-27 |         18        0.91       42.03
 2020-10-28 |         18        0.91       42.94
 2020-10-29 |         12        0.61       43.55
 2020-10-30 |         22        1.12       44.67
 2020-10-31 |         15        0.76       45.43
 2020-11-01 |         12        0.61       46.04
 2020-11-02 |         19        0.96       47.01
 2020-11-03 |         14        0.71       47.72
 2020-11-04 |         23        1.17       48.88
 2020-11-05 |         17        0.86       49.75
 2020-11-06 |         11        0.56       50.30
 2020-11-07 |         12        0.61       50.91
 2020-11-08 |         17        0.86       51.78
 2020-11-09 |         13        0.66       52.44
 2020-11-10 |         12        0.61       53.05
 2020-11-11 |         15        0.76       53.81
 2020-11-12 |         13        0.66       54.47
 2020-11-13 |         17        0.86       55.33
 2020-11-14 |         15        0.76       56.09
 2020-11-15 |         18        0.91       57.01
 2020-11-16 |         18        0.91       57.92
 2020-11-17 |         17        0.86       58.78
 2020-11-18 |         10        0.51       59.29
 2020-11-19 |         11        0.56       59.85
 2020-11-20 |         11        0.56       60.41
 2020-11-21 |          8        0.41       60.81
 2020-11-22 |          9        0.46       61.27
 2020-11-23 |         18        0.91       62.18
 2020-11-24 |          9        0.46       62.64
 2020-11-25 |         13        0.66       63.30
 2020-11-26 |         14        0.71       64.01
 2020-11-27 |         22        1.12       65.13
 2020-11-28 |         17        0.86       65.99
 2020-11-29 |         13        0.66       66.65
 2020-11-30 |         11        0.56       67.21
 2020-12-01 |         19        0.96       68.17
 2020-12-02 |         17        0.86       69.04
 2020-12-03 |         19        0.96       70.00
 2020-12-04 |         21        1.07       71.07
 2020-12-05 |         17        0.86       71.93
 2020-12-06 |         20        1.02       72.94
 2020-12-07 |         13        0.66       73.60
 2020-12-08 |         19        0.96       74.57
 2020-12-09 |          8        0.41       74.97
 2020-12-10 |         13        0.66       75.63
 2020-12-11 |         10        0.51       76.14
 2020-12-12 |         14        0.71       76.85
 2020-12-13 |         12        0.61       77.46
 2020-12-14 |         18        0.91       78.38
 2020-12-15 |         15        0.76       79.14
 2020-12-16 |         11        0.56       79.70
 2020-12-17 |         13        0.66       80.36
 2020-12-18 |         17        0.86       81.22
 2020-12-19 |         23        1.17       82.39
 2020-12-20 |         15        0.76       83.15
 2020-12-21 |         19        0.96       84.11
 2020-12-22 |         18        0.91       85.03
 2020-12-23 |         18        0.91       85.94
 2020-12-24 |         13        0.66       86.60
 2020-12-25 |         13        0.66       87.26
 2020-12-26 |         11        0.56       87.82
 2020-12-27 |         17        0.86       88.68
 2020-12-28 |         14        0.71       89.39
 2020-12-29 |         14        0.71       90.10
 2020-12-30 |         14        0.71       90.81
 2020-12-31 |         19        0.96       91.78
 2021-01-01 |         10        0.51       92.28
 2021-01-02 |         13        0.66       92.94
 2021-01-03 |         17        0.86       93.81
 2021-01-04 |         16        0.81       94.62
 2021-01-05 |         19        0.96       95.58
 2021-01-06 |         16        0.81       96.40
 2021-01-07 |         10        0.51       96.90
 2021-01-08 |          8        0.41       97.31
 2021-01-09 |         13        0.66       97.97
 2021-01-10 |         16        0.81       98.78
 2021-01-11 |         12        0.61       99.39
 2021-01-12 |         12        0.61      100.00
------------+-----------------------------------
      Total |      1,970      100.00
(5,908 missing values generated)

Contains data
  obs:         7,878                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF onscoviddeath_date REDACTED DUE TO SMALL N**

(7,585 missing values generated)

Contains data
  obs:         7,878                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF ons_noncoviddeath_date REDACTED DUE TO SMALL N**

(6,608 missing values generated)

Contains data
  obs:         7,878                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
ons_noncovidd~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF onsdeath_date REDACTED DUE TO SMALL N**

(6,315 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(7,878 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 safetab `i'
  5. }
(1,595 real changes made)
0

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,283       79.75       79.75
          1 |      1,595       20.25      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(1,551 real changes made)
0

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,327       80.31       80.31
          1 |      1,551       19.69      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(1,970 real changes made)
0

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,908       74.99       74.99
          1 |      1,970       25.01      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(293 real changes made)
0

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,585       96.28       96.28
          1 |        293        3.72      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(1,270 real changes made)
0

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,608       83.88       83.88
          1 |      1,270       16.12      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(1,563 real changes made)
0

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,315       80.16       80.16
          1 |      1,563       19.84      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("09/11/2020")

. gen positivetest_censor_date = d("09/11/2020")

. gen ae_censor_date = d("09/11/2020")

. gen hes_censor_date = d("09/11/2020")

. gen icu_censor_date = d("18/08/2020")

. gen cpnsdeath_censor_date  = d("09/11/2020")

. gen onsdeath_censor_date = d("09/11/2020")

. gen onscoviddeath_censor_date = d("09/11/2020")

. gen ons_noncoviddeath_censor_date = d("09/11/2020")

. gen onsconfirmeddeath_censor_date=d("09/11/2020")

. 
. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |      7,878   09nov2020           0  09nov2020  09nov2020
posit~r_date |      7,878   09nov2020           0  09nov2020  09nov2020
ae_censor_~e |      7,878   09nov2020           0  09nov2020  09nov2020
hes_censor~e |      7,878   09nov2020           0  09nov2020  09nov2020
icu_censor~e |      7,878   18aug2020           0  18aug2020  18aug2020
-------------+---------------------------------------------------------
cpnsd~r_date |      7,878   09nov2020           0  09nov2020  09nov2020
onsdeath_c~e |      7,878   09nov2020           0  09nov2020  09nov2020
onscovidde.. |      7,878   09nov2020           0  09nov2020  09nov2020
ons_n~r_date |      7,878   09nov2020           0  09nov2020  09nov2020
onsconfirm.. |      7,878   09nov2020           0  09nov2020  09nov2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. safetab ethnicity, m
10

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      1,221       15.50       15.50
                 Mixed |      1,138       14.45       29.94
Asian or Asian British |      1,218       15.46       45.40
                 Black |      1,157       14.69       60.09
                 Other |      1,175       14.91       75.01
                     . |      1,969       24.99      100.00
-----------------------+-----------------------------------
                 Total |      7,878      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(6,657 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,218 real changes made)

.  replace eth5=3 if ethnicity==4
(1,157 real changes made)

.  replace eth5=4 if ethnicity==2
(1,138 real changes made)

.  replace eth5=5 if ethnicity==5
(1,175 real changes made)

.  replace eth5=6 if ethnicity==.
(1,969 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,221       15.50       15.50
South Asian |      1,218       15.46       30.96
      Black |      1,157       14.69       45.65
      Mixed |      1,138       14.45       60.09
      Other |      1,175       14.91       75.01
    Unknown |      1,969       24.99      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(1,952 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. safetab ethnicity_16,m
13

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |        346        4.39        4.39
            Irish |        372        4.72        9.11
      Other White |        363        4.61       13.72
White + Caribbean |        353        4.48       18.20
  White + African |        361        4.58       22.78
    White + Asian |        390        4.95       27.74
      Other mixed |        402        5.10       32.84
           Indian |        349        4.43       37.27
        Pakistani |        382        4.85       42.12
      Bangladeshi |        379        4.81       46.93
      Other Asian |        384        4.87       51.80
        Caribbean |        375        4.76       56.56
          African |        386        4.90       61.46
      Other Black |        331        4.20       65.66
          Chinese |        388        4.93       70.59
            Other |        365        4.63       75.22
          Unknown |      1,952       24.78      100.00
------------------+-----------------------------------
            Total |      7,878      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 1506 changes made)

. recode eth16 8 = 4
(eth16: 349 changes made)

. recode eth16 9 = 5
(eth16: 382 changes made)

. recode eth16 10 = 6
(eth16: 379 changes made)

. recode eth16 11= 7
(eth16: 384 changes made)

. recode eth16 12 = 8
(eth16: 375 changes made)

. recode eth16 13 = 9
(eth16: 386 changes made)

. recode eth16 14 = 10
(eth16: 331 changes made)

. recode eth16 15 = 11
(eth16: 388 changes made)

. recode eth16 99 = 12
(eth16: 1506 changes made)

. recode eth16 16 = 13
(eth16: 365 changes made)

. recode eth16 17 = 14
(eth16: 1952 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. safetab eth16,m
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        346        4.39        4.39
      Irish |        372        4.72        9.11
Other White |        363        4.61       13.72
     Indian |        349        4.43       18.15
  Pakistani |        382        4.85       23.00
Bangladeshi |        379        4.81       27.81
Other Asian |        384        4.87       32.69
  Caribbean |        375        4.76       37.45
    African |        386        4.90       42.35
Other Black |        331        4.20       46.55
    Chinese |        388        4.93       51.47
  All mixed |      1,506       19.12       70.59
      Other |        365        4.63       75.22
    Unknown |      1,952       24.78      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. safetab eth16 eth5, m
11

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |        59         51         52         52 |       346 
      Irish |        72         68         56         51 |       372 
Other White |        50         61         45         55 |       363 
     Indian |        55         48         56         42 |       349 
  Pakistani |        69         50         57         60 |       382 
Bangladeshi |        57         64         62         57 |       379 
Other Asian |        64         63         50         59 |       384 
  Caribbean |        56         64         53         56 |       375 
    African |        62         66         56         54 |       386 
Other Black |        43         59         42         46 |       331 
    Chinese |        57         51         54         62 |       388 
  All mixed |       228        223        227        211 |     1,506 
      Other |        59         58         47         64 |       365 
    Unknown |       290        292        300        269 |     1,952 
------------+--------------------------------------------+----------
      Total |     1,221      1,218      1,157      1,138 |     7,878 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |        52         80 |       346 
      Irish |        48         77 |       372 
Other White |        54         98 |       363 
     Indian |        56         92 |       349 
  Pakistani |        63         83 |       382 
Bangladeshi |        49         90 |       379 
Other Asian |        40        108 |       384 
  Caribbean |        49         97 |       375 
    African |        48        100 |       386 
Other Black |        53         88 |       331 
    Chinese |        79         85 |       388 
  All mixed |       249        368 |     1,506 
      Other |        49         88 |       365 
    Unknown |       286        515 |     1,952 
------------+----------------------+----------
      Total |     1,175      1,969 |     7,878 

. bysort eth5: safetab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         59        4.83        4.83
      Irish |         72        5.90       10.73
Other White |         50        4.10       14.82
     Indian |         55        4.50       19.33
  Pakistani |         69        5.65       24.98
Bangladeshi |         57        4.67       29.65
Other Asian |         64        5.24       34.89
  Caribbean |         56        4.59       39.48
    African |         62        5.08       44.55
Other Black |         43        3.52       48.08
    Chinese |         57        4.67       52.74
  All mixed |        228       18.67       71.42
      Other |         59        4.83       76.25
    Unknown |        290       23.75      100.00
------------+-----------------------------------
      Total |      1,221      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         51        4.19        4.19
      Irish |         68        5.58        9.77
Other White |         61        5.01       14.78
     Indian |         48        3.94       18.72
  Pakistani |         50        4.11       22.82
Bangladeshi |         64        5.25       28.08
Other Asian |         63        5.17       33.25
  Caribbean |         64        5.25       38.51
    African |         66        5.42       43.92
Other Black |         59        4.84       48.77
    Chinese |         51        4.19       52.96
  All mixed |        223       18.31       71.26
      Other |         58        4.76       76.03
    Unknown |        292       23.97      100.00
------------+-----------------------------------
      Total |      1,218      100.00

-------------------------------------------------------------------------------
-> eth5 = Black
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         52        4.49        4.49
      Irish |         56        4.84        9.33
Other White |         45        3.89       13.22
     Indian |         56        4.84       18.06
  Pakistani |         57        4.93       22.99
Bangladeshi |         62        5.36       28.35
Other Asian |         50        4.32       32.67
  Caribbean |         53        4.58       37.25
    African |         56        4.84       42.09
Other Black |         42        3.63       45.72
    Chinese |         54        4.67       50.39
  All mixed |        227       19.62       70.01
      Other |         47        4.06       74.07
    Unknown |        300       25.93      100.00
------------+-----------------------------------
      Total |      1,157      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         52        4.57        4.57
      Irish |         51        4.48        9.05
Other White |         55        4.83       13.88
     Indian |         42        3.69       17.57
  Pakistani |         60        5.27       22.85
Bangladeshi |         57        5.01       27.86
Other Asian |         59        5.18       33.04
  Caribbean |         56        4.92       37.96
    African |         54        4.75       42.71
Other Black |         46        4.04       46.75
    Chinese |         62        5.45       52.20
  All mixed |        211       18.54       70.74
      Other |         64        5.62       76.36
    Unknown |        269       23.64      100.00
------------+-----------------------------------
      Total |      1,138      100.00

-------------------------------------------------------------------------------
-> eth5 = Other
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         52        4.43        4.43
      Irish |         48        4.09        8.51
Other White |         54        4.60       13.11
     Indian |         56        4.77       17.87
  Pakistani |         63        5.36       23.23
Bangladeshi |         49        4.17       27.40
Other Asian |         40        3.40       30.81
  Caribbean |         49        4.17       34.98
    African |         48        4.09       39.06
Other Black |         53        4.51       43.57
    Chinese |         79        6.72       50.30
  All mixed |        249       21.19       71.49
      Other |         49        4.17       75.66
    Unknown |        286       24.34      100.00
------------+-----------------------------------
      Total |      1,175      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         80        4.06        4.06
      Irish |         77        3.91        7.97
Other White |         98        4.98       12.95
     Indian |         92        4.67       17.62
  Pakistani |         83        4.22       21.84
Bangladeshi |         90        4.57       26.41
Other Asian |        108        5.49       31.89
  Caribbean |         97        4.93       36.82
    African |        100        5.08       41.90
Other Black |         88        4.47       46.37
    Chinese |         85        4.32       50.69
  All mixed |        368       18.69       69.38
      Other |         88        4.47       73.84
    Unknown |        515       26.16      100.00
------------+-----------------------------------
      Total |      1,969      100.00

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(7,868 missing values generated)

. replace stp = sum(stp)
(7,877 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(7878 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(1,145 real changes made)

. safetab  carehometype carehome, m
22

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0        402 |       402 
        PN |         0        380 |       380 
        PS |         0        363 |       363 
         U |     6,733          0 |     6,733 
-----------+----------------------+----------
     Total |     6,733      1,145 |     7,878 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [4,11]                       units:  1
         unique values:  8                        missing .:  0/7,878

            tabulation:  Freq.  Value
                            13  4
                           170  5
                         1,129  6
                         2,717  7
                         2,644  8
                         1,065  9
                           129  10
                            11  11

. 
. *gen categories of household size.
. gen hh_total_cat=.
(7,878 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(183 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(7,684 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(11 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(1,145 real changes made)

. 
. 
. *who are people with missing household size
. safecount if hh_total_cat==.
  0

. safecount if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |        164    4.939024    .2400185          4          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      6,559    7.536362    .9612084          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |         10          11           0         11         11

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,145    7.416594    1.005355          4         11


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. safetab hh_total_cat,m
13

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        3-5 |        164        2.08        2.08
       6-10 |      6,559       83.26       85.34
        11+ |         10        0.13       85.47
   carehome |      1,145       14.53      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. safetab hh_total_cat carehome,m 
22

hh_total_c |       carehome
        at |         0          1 |     Total
-----------+----------------------+----------
       3-5 |       164          0 |       164 
      6-10 |     6,559          0 |     6,559 
       11+ |        10          0 |        10 
  carehome |         0      1,145 |     1,145 
-----------+----------------------+----------
     Total |     6,733      1,145 |     7,878 

. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(10 real changes made, 10 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(0 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |      7,878    2.000896    .1422508   1.386294   2.397895
   hh_linear |      7,878    7.469282    1.034634          4         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(7,826 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(299 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(30 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(7,878 real changes made)
(6,307 real changes made)
(6,307 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(7,878 real changes made)
(6,309 real changes made)
(6,309 missing values generated)
variable cancer was str7 now str10
(7,878 real changes made)
(6,273 real changes made)
(6,273 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(7,878 real changes made)
(6,298 real changes made)
(6,298 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(7,878 real changes made)
(6,325 real changes made)
(6,325 missing values generated)
variable chronic_liver_disease was str7 now str10
(7,878 real changes made)
(6,296 real changes made)
(6,296 missing values generated)
variable other_neuro was str7 now str10
(7,878 real changes made)
(6,306 real changes made)
(6,306 missing values generated)
variable stroke was str7 now str10
(7,878 real changes made)
(6,317 real changes made)
(6,317 missing values generated)
variable dementia was str7 now str10
(7,878 real changes made)
(6,303 real changes made)
(6,303 missing values generated)
variable esrf was str7 now str10
(7,878 real changes made)
(6,301 real changes made)
(6,301 missing values generated)
variable hypertension was str7 now str10
(7,878 real changes made)
(6,299 real changes made)
(6,299 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(7,878 real changes made)
(6,311 real changes made)
(6,311 missing values generated)
variable diabetes was str7 now str10
(7,878 real changes made)
(7,497 real changes made)
(7,497 missing values generated)
variable bmi_date_measured was str7 now str10
(7,878 real changes made)
(381 real changes made)
(381 missing values generated)
variable bp_sys_date_measured was str7 now str10
(7,878 real changes made)
(394 real changes made)
(394 missing values generated)
variable bp_dias_date_measured was str7 now str10
(7,878 real changes made)
(390 real changes made)
(390 missing values generated)
variable creatinine_date was str7 now str10
(7,878 real changes made)
(390 real changes made)
(390 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(7,878 real changes made)
(385 real changes made)
(385 missing values generated)
variable hba1c_percentage_date was str7 now str10
(7,878 real changes made)
(399 real changes made)
(399 missing values generated)
variable smoking_status_date was str7 now str10
(7,878 real changes made)
(6,339 real changes made)
(6,339 missing values generated)
variable insulin was str7 now str10
(7,878 real changes made)
(6,321 real changes made)
(6,321 missing values generated)
variable statin was str7 now str10
(7,878 real changes made)
(6,294 real changes made)
(6,294 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         safetab `newvar', m
  6.         
. }
28

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,307       80.06       80.06
          1 |      1,571       19.94      100.00
------------+-----------------------------------
      Total |      7,878      100.00
24

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,309       80.08       80.08
          1 |      1,569       19.92      100.00
------------+-----------------------------------
      Total |      7,878      100.00
7

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,273       79.63       79.63
          1 |      1,605       20.37      100.00
------------+-----------------------------------
      Total |      7,878      100.00
15

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,298       79.94       79.94
          1 |      1,580       20.06      100.00
------------+-----------------------------------
      Total |      7,878      100.00
15

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,325       80.29       80.29
          1 |      1,553       19.71      100.00
------------+-----------------------------------
      Total |      7,878      100.00
22

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,296       79.92       79.92
          1 |      1,582       20.08      100.00
------------+-----------------------------------
      Total |      7,878      100.00
12

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,306       80.05       80.05
          1 |      1,572       19.95      100.00
------------+-----------------------------------
      Total |      7,878      100.00
7

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,317       80.19       80.19
          1 |      1,561       19.81      100.00
------------+-----------------------------------
      Total |      7,878      100.00
9

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,303       80.01       80.01
          1 |      1,575       19.99      100.00
------------+-----------------------------------
      Total |      7,878      100.00
5

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,301       79.98       79.98
          1 |      1,577       20.02      100.00
------------+-----------------------------------
      Total |      7,878      100.00
13

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,299       79.96       79.96
          1 |      1,579       20.04      100.00
------------+-----------------------------------
      Total |      7,878      100.00
17

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,311       80.11       80.11
          1 |      1,567       19.89      100.00
------------+-----------------------------------
      Total |      7,878      100.00
13

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        381        4.84        4.84
          1 |      7,497       95.16      100.00
------------+-----------------------------------
      Total |      7,878      100.00
21

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        394        5.00        5.00
          1 |      7,484       95.00      100.00
------------+-----------------------------------
      Total |      7,878      100.00
22

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        390        4.95        4.95
          1 |      7,488       95.05      100.00
------------+-----------------------------------
      Total |      7,878      100.00
16

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        390        4.95        4.95
          1 |      7,488       95.05      100.00
------------+-----------------------------------
      Total |      7,878      100.00
24

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        385        4.89        4.89
          1 |      7,493       95.11      100.00
------------+-----------------------------------
      Total |      7,878      100.00
22

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        399        5.06        5.06
          1 |      7,479       94.94      100.00
------------+-----------------------------------
      Total |      7,878      100.00
20

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,339       80.46       80.46
          1 |      1,539       19.54      100.00
------------+-----------------------------------
      Total |      7,878      100.00
8

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,321       80.24       80.24
          1 |      1,557       19.76      100.00
------------+-----------------------------------
      Total |      7,878      100.00
7

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,294       79.89       79.89
          1 |      1,584       20.11      100.00
------------+-----------------------------------
      Total |      7,878      100.00
15

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,514       69.99       69.99
          1 |      2,364       30.01      100.00
------------+-----------------------------------
      Total |      7,878      100.00
5

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,532       70.22       70.22
          1 |      2,346       29.78      100.00
------------+-----------------------------------
      Total |      7,878      100.00
15

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,514       69.99       69.99
          1 |      2,364       30.01      100.00
------------+-----------------------------------
      Total |      7,878      100.00
13

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,517       70.03       70.03
          1 |      2,361       29.97      100.00
------------+-----------------------------------
      Total |      7,878      100.00
25

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,500       69.81       69.81
          1 |      2,378       30.19      100.00
------------+-----------------------------------
      Total |      7,878      100.00
15

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,519       70.06       70.06
          1 |      2,359       29.94      100.00
------------+-----------------------------------
      Total |      7,878      100.00
19

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,487       69.65       69.65
          1 |      2,391       30.35      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(656 real changes made, 656 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(381 missing values generated)

. gen bmi_age = age - bmi_time
(381 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(301 real changes made, 301 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(957 real changes made, 957 to missing)

. replace bmi_measured = . if bmi == . 
(1,338 real changes made, 1,338 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(7,878 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 169 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 756 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 1139 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 1379 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 1395 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 1702 changes made)

. replace bmicat = .u if bmi>=.
(1,338 real changes made, 1,338 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(7709 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(1,338 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(50 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(100 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(100 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(111 real changes made)

. replace bmicat_sa = 7 if bmi==.
(1,338 real changes made)

. 
. safetab bmicat_sa
0

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        169        2.15        2.15
          2 |        706        8.96       11.11
          3 |      1,089       13.82       24.93
          4 |      1,379       17.50       42.43
          5 |      1,384       17.57       60.00
          6 |      1,813       23.01       83.02
          7 |      1,338       16.98      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(6371 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(7,558 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(149 real changes made)

. replace smoke = 3  if smoking_status == "S"
(956 real changes made)

. replace smoke = .u if smoking_status == "M"
(157 real changes made, 157 to missing)

. replace smoke = .u if smoking_status == "" 
(6,296 real changes made, 6,296 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(6453 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(6,463 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(136 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(36 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 6291 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(6,298 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(2,804 real changes made)

. safetab immunosuppressed
0

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,074       64.41       64.41
          1 |      2,804       35.59      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50–300 (30–250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(11 real changes made, 11 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(7,878 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(13 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(7,475 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(772 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(772 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 165 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(772 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(24 real changes made, 24 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(414 missing values generated)

. 
. gen min=.
(7,878 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(3,733 real changes made)

. replace min = SCr_adj/0.9 if male==1
(3,731 real changes made)

. replace min = min^-0.329  if male==0
(3,733 real changes made)

. replace min = min^-0.411  if male==1
(3,731 real changes made)

. replace min = 1 if min<1
(2,051 real changes made)

. 
. gen max=.
(7,878 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(3,733 real changes made)

. replace max=SCr_adj/0.9 if male==1
(3,731 real changes made)

. replace max=max^-1.209
(7,464 real changes made)

. replace max=1 if max>1
(5,827 real changes made)

. 
. gen egfr=min*max*141
(414 missing values generated)

. replace egfr=egfr*(0.993^age)
(7,464 real changes made)

. replace egfr=egfr*1.018 if male==0
(3,733 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(414 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. safetab egfr_cat
0

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |         93        1.25        1.25
Stage 3 egfr 30-6 |      7,371       98.75      100.00
------------------+-----------------------------------
            Total |      7,464      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(93 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |      7,785       98.82       98.82
   eGFR <60 |         93        1.18      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(50 real changes made, 50 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(173 real changes made, 173 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      7,429    5.044688    1.948687   .0091193    12.2153
hba1c_mmol~l |      7,320    40.46568    18.62218   .0305022   107.9909

. gen     hba1c_pct = hba1c_percentage 
(449 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(7,320 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(7,838 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(7,648 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,533 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(163 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(5,952 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |     5,952          0          0          0 |     5,952 
         1 |         0        230          0          0 |       230 
         2 |         0          0      1,533          0 |     1,533 
         3 |         0          0          0        163 |       163 
-----------+--------------------------------------------+----------
     Total |     5,952        230      1,533        163 |     7,878 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(7,629 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,563 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(6,066 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(2,799 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(1,360 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(513 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(594 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(292 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(40 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      5,079       64.47       64.47
  >=6.5-7.4 |      1,360       17.26       81.73
  >=7.5-7.9 |        513        6.51       88.25
    >=8-8.9 |        594        7.54       95.79
        >=9 |        292        3.71       99.49
    Unknown |         40        0.51      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(1,439 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(1,399 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,439       81.73       81.73
          1 |      1,399       17.76       99.49
          . |         40        0.51      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(1,926 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(188 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(41 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(1,252 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(274 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(8 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |      5,952       75.55       75.55
  T1DM, controlled |        188        2.39       77.94
T1DM, uncontrolled |         41        0.52       78.46
  T2DM, controlled |      1,252       15.89       94.35
T2DM, uncontrolled |        274        3.48       97.83
Diabetes, no HbA1c |          8        0.10       97.93
                 . |        163        2.07      100.00
-------------------+-----------------------------------
             Total |      7,878      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,242       79.46       79.46
          1 |        146        9.34       88.80
          2 |        175       11.20      100.00
------------+-----------------------------------
      Total |      1,563      100.00

. replace asthma=0 if asthma==.
(6,315 real changes made)

. replace asthma=1 if asthma==2
(175 real changes made)

. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,557       95.93       95.93
          1 |        321        4.07      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(1,571 real changes made)
(1,569 real changes made)
(1,605 real changes made)
(1,580 real changes made)
(1,553 real changes made)
(1,582 real changes made)
(1,572 real changes made)
(1,561 real changes made)
(1,575 real changes made)
(1,577 real changes made)
(1,579 real changes made)
(321 real changes made)
(1,567 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |      7,878     2.43869    1.387657          0          9

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(603 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |        500           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,589           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      2,219           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,897           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,673    4.479378    .7391717          4          9


. safetab comorbidity_cat,m
16

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        500        6.35        6.35
          1 |      1,589       20.17       26.52
          2 |      2,219       28.17       54.68
          3 |      1,897       24.08       78.76
          4 |      1,673       21.24      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. safetab combination_bp_meds
0

**TABLE OF combination_bp_meds REDACTED DUE TO SMALL N**


. replace combination_bp_meds=0 if combination_bp_meds<0 
(70 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(1,626 real changes made)

. safetab combination_bp_meds
0

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        384       16.18       16.18
          1 |      1,990       83.82      100.00
------------+-----------------------------------
      Total |      2,374      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(2,381 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |      7,878    2.484768    2.297193          0         10

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(1,581 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,864       99.82       99.82
          1 |         14        0.18      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(1,541 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,868       99.87       99.87
          1 |         10        0.13      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(938 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,846       86.90       86.90
          1 |      1,032       13.10      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(289 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,874       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(1,259 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,867       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,878      100.00
(1,548 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,863       99.81       99.81
          1 |         15        0.19      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         safetab `i'
  4. }
0

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,864       99.82       99.82
          1 |         14        0.18      100.00
------------+-----------------------------------
      Total |      7,878      100.00
0

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,868       99.87       99.87
          1 |         10        0.13      100.00
------------+-----------------------------------
      Total |      7,878      100.00
0

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,846       86.90       86.90
          1 |      1,032       13.10      100.00
------------+-----------------------------------
      Total |      7,878      100.00
0

**TABLE OF onscoviddeath REDACTED DUE TO SMALL N**

0

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,867       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,878      100.00
0

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,863       99.81       99.81
          1 |         15        0.19      100.00
------------+-----------------------------------
      Total |      7,878      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_sys_dat~d  perm_immun~f  diabetes_t~e  carehometype
primary_c~se  bp_dias_da~e  temp_immun~e  diabetes_e~s  bmi_time
primary_c~re  bp_dias_da~d  temp_immun~f  diabetes_e~r  bmi_age
suspected_~e  ~l_date_date  died_ons_c..  index         cancer_cat
ae_date       hba1c~l_date  d~nfirmedc~y  onsconfirm..  temp1
icu_date      hba1c_perc..  died_ons_s~y  onssuspect~e  temp2
cpnsd~h_date  crea~te_date  died_ons_c~g  dereg_date    SCr_adj
ethni~6_date  crea~ne_date  ethnicity     ae_censor_~e  min
ethni~y_date  smoki~e_date  has_consul~y  icu_censor~e  max
bmi_measured  smoki~s_date  hba1c_per~ge  cpnsd~r_date  diabcat
bp_sys_dat~e  perm_immun~e  creatinine    onsconfirm..

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. safecount
  7,878

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. safecount
  7,878

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. safecount 
  7,878

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. /****************************************************************
> *  Create outcome specific datasets for the whole population  *
> *****************************************************************
> 
> 
> foreach i of global outcomes {
>         use ./output/analysis_dataset.dta, clear
>         drop if `i'_date <= indexdate 
>         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
>         save ./output/analysis_dataset_STSET_`i'.dta, replace
> }       
> 
> 
>         
> * Close log file 
> log close
> */
. 
end of do-file
