-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:   6 Jan 2021, 13:25:53

. 
. clear

. import delimited ./output/input.csv
(80 vars, 10,000 obs)

. 
. global outcomes "tested positivetest icu hes onscoviddeath ons_noncoviddeath 
> onsdeath"

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(2,158 observations deleted)

. safecount
  7,842

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(1 observation deleted)

. safecount
  7,841

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(3,994 missing values generated)

. replace male = 0 if sex == "F"
(3,994 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male
0

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      3,994       50.94       50.94
       Male |      3,847       49.06      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. safecount
  7,841

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(7,841 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 7841 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. safetab imd, m
4

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      5,494       70.07       70.07
               4 |      1,612       20.56       90.63
 5 most deprived |        735        9.37      100.00
-----------------+-----------------------------------
           Total |      7,841      100.00

. 
. drop if imd==.u
(0 observations deleted)

. safecount
  7,841

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
.         
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(7,530 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(7,520 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(7,522 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(6,570 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         confirm string variable `var'_date
  3.         rename `var'_date `var'_dstr
  4.         gen `var'_date = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var'_date %td 
  7. 
. }
(6,260 missing values generated)
(6,277 missing values generated)
(6,276 missing values generated)
(5,870 missing values generated)
(7,530 missing values generated)
(6,570 missing values generated)
(6,259 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
icu
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(7,841 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 safetab `i'
  5. }
(1,581 real changes made)
0

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,260       79.84       79.84
          1 |      1,581       20.16      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(1,564 real changes made)
0

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,277       80.05       80.05
          1 |      1,564       19.95      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(1,565 real changes made)
0

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,276       80.04       80.04
          1 |      1,565       19.96      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(1,971 real changes made)
0

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,870       74.86       74.86
          1 |      1,971       25.14      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(311 real changes made)
0

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,530       96.03       96.03
          1 |        311        3.97      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(1,271 real changes made)
0

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,570       83.79       83.79
          1 |      1,271       16.21      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(1,582 real changes made)
0

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,259       79.82       79.82
          1 |      1,582       20.18      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("09/11/2020")

. gen positivetest_censor_date = d("09/11/2020")

. gen ae_censor_date = d("09/11/2020")

. gen hes_censor_date = d("09/11/2020")

. gen icu_censor_date = d("30/07/2020")

. gen cpnsdeath_censor_date  = d("09/11/2020")

. gen onsdeath_censor_date = d("09/11/2020")

. gen onscoviddeath_censor_date = d("09/11/2020")

. gen ons_noncoviddeath_censor_date = d("09/11/2020")

. gen onsconfirmeddeath_censor_date=d("09/11/2020")

. 
. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |      7,841   09nov2020           0  09nov2020  09nov2020
posit~r_date |      7,841   09nov2020           0  09nov2020  09nov2020
ae_censor_~e |      7,841   09nov2020           0  09nov2020  09nov2020
hes_censor~e |      7,841   09nov2020           0  09nov2020  09nov2020
icu_censor~e |      7,841   30jul2020           0  30jul2020  30jul2020
-------------+---------------------------------------------------------
cpnsd~r_date |      7,841   09nov2020           0  09nov2020  09nov2020
onsdeath_c~e |      7,841   09nov2020           0  09nov2020  09nov2020
onscovidde.. |      7,841   09nov2020           0  09nov2020  09nov2020
ons_n~r_date |      7,841   09nov2020           0  09nov2020  09nov2020
onsconfirm.. |      7,841   09nov2020           0  09nov2020  09nov2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. safetab ethnicity, m
10

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      1,196       15.25       15.25
                 Mixed |      1,150       14.67       29.92
Asian or Asian British |      1,183       15.09       45.01
                 Black |      1,209       15.42       60.43
                 Other |      1,168       14.90       75.32
                     . |      1,935       24.68      100.00
-----------------------+-----------------------------------
                 Total |      7,841      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(6,645 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,183 real changes made)

.  replace eth5=3 if ethnicity==4
(1,209 real changes made)

.  replace eth5=4 if ethnicity==2
(1,150 real changes made)

.  replace eth5=5 if ethnicity==5
(1,168 real changes made)

.  replace eth5=6 if ethnicity==.
(1,935 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,196       15.25       15.25
South Asian |      1,183       15.09       30.34
      Black |      1,209       15.42       45.76
      Mixed |      1,150       14.67       60.43
      Other |      1,168       14.90       75.32
    Unknown |      1,935       24.68      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(1,926 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. safetab ethnicity_16,m
13

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |        378        4.82        4.82
            Irish |        342        4.36        9.18
      Other White |        382        4.87       14.05
White + Caribbean |        384        4.90       18.95
  White + African |        364        4.64       23.59
    White + Asian |        397        5.06       28.66
      Other mixed |        350        4.46       33.12
           Indian |        365        4.66       37.78
        Pakistani |        356        4.54       42.32
      Bangladeshi |        379        4.83       47.15
      Other Asian |        392        5.00       52.15
        Caribbean |        359        4.58       56.73
          African |        350        4.46       61.19
      Other Black |        352        4.49       65.68
          Chinese |        371        4.73       70.41
            Other |        394        5.02       75.44
          Unknown |      1,926       24.56      100.00
------------------+-----------------------------------
            Total |      7,841      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 1495 changes made)

. recode eth16 8 = 4
(eth16: 365 changes made)

. recode eth16 9 = 5
(eth16: 356 changes made)

. recode eth16 10 = 6
(eth16: 379 changes made)

. recode eth16 11= 7
(eth16: 392 changes made)

. recode eth16 12 = 8
(eth16: 359 changes made)

. recode eth16 13 = 9
(eth16: 350 changes made)

. recode eth16 14 = 10
(eth16: 352 changes made)

. recode eth16 15 = 11
(eth16: 371 changes made)

. recode eth16 99 = 12
(eth16: 1495 changes made)

. recode eth16 16 = 13
(eth16: 394 changes made)

. recode eth16 17 = 14
(eth16: 1926 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. safetab eth16,m
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        378        4.82        4.82
      Irish |        342        4.36        9.18
Other White |        382        4.87       14.05
     Indian |        365        4.66       18.71
  Pakistani |        356        4.54       23.25
Bangladeshi |        379        4.83       28.08
Other Asian |        392        5.00       33.08
  Caribbean |        359        4.58       37.66
    African |        350        4.46       42.12
Other Black |        352        4.49       46.61
    Chinese |        371        4.73       51.35
  All mixed |      1,495       19.07       70.41
      Other |        394        5.02       75.44
    Unknown |      1,926       24.56      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. safetab eth16 eth5, m
11

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |        57         53         55         53 |       378 
      Irish |        48         44         64         43 |       342 
Other White |        53         61         63         46 |       382 
     Indian |        52         55         60         49 |       365 
  Pakistani |        50         61         58         52 |       356 
Bangladeshi |        61         59         54         50 |       379 
Other Asian |        54         54         61         66 |       392 
  Caribbean |        56         41         43         57 |       359 
    African |        48         43         60         56 |       350 
Other Black |        55         60         56         41 |       352 
    Chinese |        55         62         47         53 |       371 
  All mixed |       227        210        225        239 |     1,495 
      Other |        69         70         51         60 |       394 
    Unknown |       311        310        312        285 |     1,926 
------------+--------------------------------------------+----------
      Total |     1,196      1,183      1,209      1,150 |     7,841 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |        54        106 |       378 
      Irish |        55         88 |       342 
Other White |        59        100 |       382 
     Indian |        46        103 |       365 
  Pakistani |        49         86 |       356 
Bangladeshi |        72         83 |       379 
Other Asian |        61         96 |       392 
  Caribbean |        64         98 |       359 
    African |        42        101 |       350 
Other Black |        58         82 |       352 
    Chinese |        56         98 |       371 
  All mixed |       225        369 |     1,495 
      Other |        50         94 |       394 
    Unknown |       277        431 |     1,926 
------------+----------------------+----------
      Total |     1,168      1,935 |     7,841 

. bysort eth5: safetab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         57        4.77        4.77
      Irish |         48        4.01        8.78
Other White |         53        4.43       13.21
     Indian |         52        4.35       17.56
  Pakistani |         50        4.18       21.74
Bangladeshi |         61        5.10       26.84
Other Asian |         54        4.52       31.35
  Caribbean |         56        4.68       36.04
    African |         48        4.01       40.05
Other Black |         55        4.60       44.65
    Chinese |         55        4.60       49.25
  All mixed |        227       18.98       68.23
      Other |         69        5.77       74.00
    Unknown |        311       26.00      100.00
------------+-----------------------------------
      Total |      1,196      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         53        4.48        4.48
      Irish |         44        3.72        8.20
Other White |         61        5.16       13.36
     Indian |         55        4.65       18.01
  Pakistani |         61        5.16       23.16
Bangladeshi |         59        4.99       28.15
Other Asian |         54        4.56       32.71
  Caribbean |         41        3.47       36.18
    African |         43        3.63       39.81
Other Black |         60        5.07       44.89
    Chinese |         62        5.24       50.13
  All mixed |        210       17.75       67.88
      Other |         70        5.92       73.80
    Unknown |        310       26.20      100.00
------------+-----------------------------------
      Total |      1,183      100.00

-------------------------------------------------------------------------------
-> eth5 = Black
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         55        4.55        4.55
      Irish |         64        5.29        9.84
Other White |         63        5.21       15.05
     Indian |         60        4.96       20.02
  Pakistani |         58        4.80       24.81
Bangladeshi |         54        4.47       29.28
Other Asian |         61        5.05       34.33
  Caribbean |         43        3.56       37.88
    African |         60        4.96       42.85
Other Black |         56        4.63       47.48
    Chinese |         47        3.89       51.36
  All mixed |        225       18.61       69.98
      Other |         51        4.22       74.19
    Unknown |        312       25.81      100.00
------------+-----------------------------------
      Total |      1,209      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         53        4.61        4.61
      Irish |         43        3.74        8.35
Other White |         46        4.00       12.35
     Indian |         49        4.26       16.61
  Pakistani |         52        4.52       21.13
Bangladeshi |         50        4.35       25.48
Other Asian |         66        5.74       31.22
  Caribbean |         57        4.96       36.17
    African |         56        4.87       41.04
Other Black |         41        3.57       44.61
    Chinese |         53        4.61       49.22
  All mixed |        239       20.78       70.00
      Other |         60        5.22       75.22
    Unknown |        285       24.78      100.00
------------+-----------------------------------
      Total |      1,150      100.00

-------------------------------------------------------------------------------
-> eth5 = Other
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         54        4.62        4.62
      Irish |         55        4.71        9.33
Other White |         59        5.05       14.38
     Indian |         46        3.94       18.32
  Pakistani |         49        4.20       22.52
Bangladeshi |         72        6.16       28.68
Other Asian |         61        5.22       33.90
  Caribbean |         64        5.48       39.38
    African |         42        3.60       42.98
Other Black |         58        4.97       47.95
    Chinese |         56        4.79       52.74
  All mixed |        225       19.26       72.00
      Other |         50        4.28       76.28
    Unknown |        277       23.72      100.00
------------+-----------------------------------
      Total |      1,168      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        106        5.48        5.48
      Irish |         88        4.55       10.03
Other White |        100        5.17       15.19
     Indian |        103        5.32       20.52
  Pakistani |         86        4.44       24.96
Bangladeshi |         83        4.29       29.25
Other Asian |         96        4.96       34.21
  Caribbean |         98        5.06       39.28
    African |        101        5.22       44.50
Other Black |         82        4.24       48.73
    Chinese |         98        5.06       53.80
  All mixed |        369       19.07       72.87
      Other |         94        4.86       77.73
    Unknown |        431       22.27      100.00
------------+-----------------------------------
      Total |      1,935      100.00

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(7,831 missing values generated)

. replace stp = sum(stp)
(7,840 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(7841 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(1,191 real changes made)

. safetab  carehometype carehome, m
22

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0        408 |       408 
        PN |         0        391 |       391 
        PS |         0        392 |       392 
         U |     6,650          0 |     6,650 
-----------+----------------------+----------
     Total |     6,650      1,191 |     7,841 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [4,11]                       units:  1
         unique values:  8                        missing .:  0/7,841

            tabulation:  Freq.  Value
                             7  4
                           160  5
                         1,016  6
                         2,687  7
                         2,693  8
                         1,106  9
                           158  10
                            14  11

. 
. *gen categories of household size.
. gen hh_total_cat=.
(7,841 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(167 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(7,660 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(14 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(1,191 real changes made)

. 
. 
. *who are people with missing household size
. safecount if hh_total_cat==.
  0

. safecount if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |        142    4.957746    .2018791          4          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      6,497    7.574727    .9633022          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |         11          11           0         11         11

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,191    7.495382    1.021502          4         11


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. safetab hh_total_cat,m
13

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        3-5 |        142        1.81        1.81
       6-10 |      6,497       82.86       84.67
        11+ |         11        0.14       84.81
   carehome |      1,191       15.19      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. safetab hh_total_cat carehome,m 
22

hh_total_c |       carehome
        at |         0          1 |     Total
-----------+----------------------+----------
       3-5 |       142          0 |       142 
      6-10 |     6,497          0 |     6,497 
       11+ |        11          0 |        11 
  carehome |         0      1,191 |     1,191 
-----------+----------------------+----------
     Total |     6,650      1,191 |     7,841 

. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(11 real changes made, 11 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(0 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |      7,841    2.007875    .1406864   1.386294   2.397895
   hh_linear |      7,841    7.520087    1.032698          4         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(7,793 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(315 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(29 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(7,841 real changes made)
(6,249 real changes made)
(6,249 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(7,841 real changes made)
(6,286 real changes made)
(6,286 missing values generated)
variable cancer was str7 now str10
(7,841 real changes made)
(6,275 real changes made)
(6,275 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(7,841 real changes made)
(6,293 real changes made)
(6,293 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(7,841 real changes made)
(6,248 real changes made)
(6,248 missing values generated)
variable chronic_liver_disease was str7 now str10
(7,841 real changes made)
(6,287 real changes made)
(6,287 missing values generated)
variable other_neuro was str7 now str10
(7,841 real changes made)
(6,287 real changes made)
(6,287 missing values generated)
variable stroke was str7 now str10
(7,841 real changes made)
(6,280 real changes made)
(6,280 missing values generated)
variable dementia was str7 now str10
(7,841 real changes made)
(6,263 real changes made)
(6,263 missing values generated)
variable esrf was str7 now str10
(7,841 real changes made)
(6,299 real changes made)
(6,299 missing values generated)
variable hypertension was str7 now str10
(7,841 real changes made)
(6,241 real changes made)
(6,241 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(7,841 real changes made)
(6,293 real changes made)
(6,293 missing values generated)
variable diabetes was str7 now str10
(7,841 real changes made)
(7,449 real changes made)
(7,449 missing values generated)
variable bmi_date_measured was str7 now str10
(7,841 real changes made)
(397 real changes made)
(397 missing values generated)
variable bp_sys_date_measured was str7 now str10
(7,841 real changes made)
(382 real changes made)
(382 missing values generated)
variable bp_dias_date_measured was str7 now str10
(7,841 real changes made)
(376 real changes made)
(376 missing values generated)
variable creatinine_date was str7 now str10
(7,841 real changes made)
(398 real changes made)
(398 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(7,841 real changes made)
(391 real changes made)
(391 missing values generated)
variable hba1c_percentage_date was str7 now str10
(7,841 real changes made)
(389 real changes made)
(389 missing values generated)
variable smoking_status_date was str7 now str10
(7,841 real changes made)
(6,295 real changes made)
(6,295 missing values generated)
variable insulin was str7 now str10
(7,841 real changes made)
(6,299 real changes made)
(6,299 missing values generated)
variable statin was str7 now str10
(7,841 real changes made)
(6,298 real changes made)
(6,298 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         safetab `newvar', m
  6.         
. }
28

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,249       79.70       79.70
          1 |      1,592       20.30      100.00
------------+-----------------------------------
      Total |      7,841      100.00
24

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,286       80.17       80.17
          1 |      1,555       19.83      100.00
------------+-----------------------------------
      Total |      7,841      100.00
7

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,275       80.03       80.03
          1 |      1,566       19.97      100.00
------------+-----------------------------------
      Total |      7,841      100.00
15

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,293       80.26       80.26
          1 |      1,548       19.74      100.00
------------+-----------------------------------
      Total |      7,841      100.00
15

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,248       79.68       79.68
          1 |      1,593       20.32      100.00
------------+-----------------------------------
      Total |      7,841      100.00
22

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,287       80.18       80.18
          1 |      1,554       19.82      100.00
------------+-----------------------------------
      Total |      7,841      100.00
12

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,287       80.18       80.18
          1 |      1,554       19.82      100.00
------------+-----------------------------------
      Total |      7,841      100.00
7

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,280       80.09       80.09
          1 |      1,561       19.91      100.00
------------+-----------------------------------
      Total |      7,841      100.00
9

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,263       79.88       79.88
          1 |      1,578       20.12      100.00
------------+-----------------------------------
      Total |      7,841      100.00
5

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,299       80.33       80.33
          1 |      1,542       19.67      100.00
------------+-----------------------------------
      Total |      7,841      100.00
13

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,241       79.59       79.59
          1 |      1,600       20.41      100.00
------------+-----------------------------------
      Total |      7,841      100.00
17

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,293       80.26       80.26
          1 |      1,548       19.74      100.00
------------+-----------------------------------
      Total |      7,841      100.00
13

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        397        5.06        5.06
          1 |      7,444       94.94      100.00
------------+-----------------------------------
      Total |      7,841      100.00
21

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        382        4.87        4.87
          1 |      7,459       95.13      100.00
------------+-----------------------------------
      Total |      7,841      100.00
22

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        376        4.80        4.80
          1 |      7,465       95.20      100.00
------------+-----------------------------------
      Total |      7,841      100.00
16

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        398        5.08        5.08
          1 |      7,443       94.92      100.00
------------+-----------------------------------
      Total |      7,841      100.00
24

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        391        4.99        4.99
          1 |      7,450       95.01      100.00
------------+-----------------------------------
      Total |      7,841      100.00
22

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        389        4.96        4.96
          1 |      7,452       95.04      100.00
------------+-----------------------------------
      Total |      7,841      100.00
20

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,295       80.28       80.28
          1 |      1,546       19.72      100.00
------------+-----------------------------------
      Total |      7,841      100.00
8

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,299       80.33       80.33
          1 |      1,542       19.67      100.00
------------+-----------------------------------
      Total |      7,841      100.00
7

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,298       80.32       80.32
          1 |      1,543       19.68      100.00
------------+-----------------------------------
      Total |      7,841      100.00
15

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,512       70.30       70.30
          1 |      2,329       29.70      100.00
------------+-----------------------------------
      Total |      7,841      100.00
5

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,501       70.16       70.16
          1 |      2,340       29.84      100.00
------------+-----------------------------------
      Total |      7,841      100.00
15

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,490       70.02       70.02
          1 |      2,351       29.98      100.00
------------+-----------------------------------
      Total |      7,841      100.00
13

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,519       70.39       70.39
          1 |      2,322       29.61      100.00
------------+-----------------------------------
      Total |      7,841      100.00
25

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,493       70.05       70.05
          1 |      2,348       29.95      100.00
------------+-----------------------------------
      Total |      7,841      100.00
15

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,507       70.23       70.23
          1 |      2,334       29.77      100.00
------------+-----------------------------------
      Total |      7,841      100.00
19

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,508       70.25       70.25
          1 |      2,333       29.75      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(708 real changes made, 708 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(397 missing values generated)

. gen bmi_age = age - bmi_time
(397 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(343 real changes made, 343 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(1,051 real changes made, 1,051 to missing)

. replace bmi_measured = . if bmi == . 
(1,448 real changes made, 1,448 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(7,841 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 171 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 755 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 1056 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 1367 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 1369 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 1675 changes made)

. replace bmicat = .u if bmi>=.
(1,448 real changes made, 1,448 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(7670 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(1,448 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(35 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(100 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(95 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(83 real changes made)

. replace bmicat_sa = 7 if bmi==.
(1,448 real changes made)

. 
. safetab bmicat_sa
0

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        171        2.18        2.18
          2 |        720        9.18       11.36
          3 |        991       12.64       24.00
          4 |      1,372       17.50       41.50
          5 |      1,381       17.61       59.11
          6 |      1,758       22.42       81.53
          7 |      1,448       18.47      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(6222 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(7,535 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(146 real changes made)

. replace smoke = 3  if smoking_status == "S"
(957 real changes made)

. replace smoke = .u if smoking_status == "M"
(158 real changes made, 158 to missing)

. replace smoke = .u if smoking_status == "" 
(6,274 real changes made, 6,274 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(6432 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(6,437 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(120 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(25 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 6292 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(6,293 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(2,813 real changes made)

. safetab immunosuppressed
0

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,028       64.12       64.12
          1 |      2,813       35.88      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50–300 (30–250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(11 real changes made, 11 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(7,840 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(11 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(7,453 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(754 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(754 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 175 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(754 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(31 real changes made, 31 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(429 missing values generated)

. 
. gen min=.
(7,841 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(3,779 real changes made)

. replace min = SCr_adj/0.9 if male==1
(3,633 real changes made)

. replace min = min^-0.329  if male==0
(3,779 real changes made)

. replace min = min^-0.411  if male==1
(3,633 real changes made)

. replace min = 1 if min<1
(2,027 real changes made)

. 
. gen max=.
(7,841 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(3,779 real changes made)

. replace max=SCr_adj/0.9 if male==1
(3,633 real changes made)

. replace max=max^-1.209
(7,412 real changes made)

. replace max=1 if max>1
(5,814 real changes made)

. 
. gen egfr=min*max*141
(429 missing values generated)

. replace egfr=egfr*(0.993^age)
(7,412 real changes made)

. replace egfr=egfr*1.018 if male==0
(3,779 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(429 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. safetab egfr_cat
0

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |         86        1.16        1.16
Stage 3 egfr 30-6 |      7,326       98.84      100.00
------------------+-----------------------------------
            Total |      7,412      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(86 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |      7,755       98.90       98.90
   eGFR <60 |         86        1.10      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(40 real changes made, 40 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(171 real changes made, 171 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      7,412    5.016312    1.946197   .0041397   12.66689
hba1c_mmol~l |      7,279    40.97167    18.77302   .0305401   124.9311

. gen     hba1c_pct = hba1c_percentage 
(429 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(7,279 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(7,810 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(7,615 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,562 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(152 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(5,901 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |     5,901          0          0          0 |     5,901 
         1 |         0        226          0          0 |       226 
         2 |         0          0      1,562          0 |     1,562 
         3 |         0          0          0        152 |       152 
-----------+--------------------------------------------+----------
     Total |     5,901        226      1,562        152 |     7,841 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(7,625 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,573 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(6,052 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(2,825 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(1,366 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(491 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(621 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(316 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(31 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      5,016       63.97       63.97
  >=6.5-7.4 |      1,366       17.42       81.39
  >=7.5-7.9 |        491        6.26       87.65
    >=8-8.9 |        621        7.92       95.57
        >=9 |        316        4.03       99.60
    Unknown |         31        0.40      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(1,459 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(1,428 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,382       81.39       81.39
          1 |      1,428       18.21       99.60
          . |         31        0.40      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(1,940 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(181 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(45 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(1,249 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(300 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(13 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |      5,901       75.26       75.26
  T1DM, controlled |        181        2.31       77.57
T1DM, uncontrolled |         45        0.57       78.14
  T2DM, controlled |      1,249       15.93       94.07
T2DM, uncontrolled |        300        3.83       97.90
Diabetes, no HbA1c |         13        0.17       98.06
                 . |        152        1.94      100.00
-------------------+-----------------------------------
             Total |      7,841      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,273       79.61       79.61
          1 |        159        9.94       89.56
          2 |        167       10.44      100.00
------------+-----------------------------------
      Total |      1,599      100.00

. replace asthma=0 if asthma==.
(6,242 real changes made)

. replace asthma=1 if asthma==2
(167 real changes made)

. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,515       95.84       95.84
          1 |        326        4.16      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(1,592 real changes made)
(1,555 real changes made)
(1,566 real changes made)
(1,548 real changes made)
(1,593 real changes made)
(1,554 real changes made)
(1,554 real changes made)
(1,561 real changes made)
(1,578 real changes made)
(1,542 real changes made)
(1,600 real changes made)
(326 real changes made)
(1,548 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |      7,841    2.438082    1.393873          0          8

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(598 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |        508           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,588           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      2,193           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,874           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,678    4.482122    .7345968          4          8


. safetab comorbidity_cat,m
16

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        508        6.48        6.48
          1 |      1,588       20.25       26.73
          2 |      2,193       27.97       54.70
          3 |      1,874       23.90       78.60
          4 |      1,678       21.40      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. safetab combination_bp_meds
0

**TABLE OF combination_bp_meds REDACTED DUE TO SMALL N**


. replace combination_bp_meds=0 if combination_bp_meds<0 
(48 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(1,608 real changes made)

. safetab combination_bp_meds
0

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        374       15.89       15.89
          1 |      1,980       84.11      100.00
------------+-----------------------------------
      Total |      2,354      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(2,387 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |      7,841    2.472261    2.307049          0         11

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(1,563 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,823       99.77       99.77
          1 |         18        0.23      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(1,548 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,825       99.80       99.80
          1 |         16        0.20      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(1,565 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,841      100.00      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(931 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,801       86.74       86.74
          1 |      1,040       13.26      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(304 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,834       99.91       99.91
          1 |          7        0.09      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(1,260 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,830       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,841      100.00
(1,564 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,823       99.77       99.77
          1 |         18        0.23      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
icu_date        float   %td                   Failure date:  icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_icu       float   %td                   Survivatime (date): icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         safetab `i'
  4. }
0

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,823       99.77       99.77
          1 |         18        0.23      100.00
------------+-----------------------------------
      Total |      7,841      100.00
0

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,825       99.80       99.80
          1 |         16        0.20      100.00
------------+-----------------------------------
      Total |      7,841      100.00
0

outcome icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,841      100.00      100.00
------------+-----------------------------------
      Total |      7,841      100.00
0

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,801       86.74       86.74
          1 |      1,040       13.26      100.00
------------+-----------------------------------
      Total |      7,841      100.00
0

    outcome |
onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,834       99.91       99.91
          1 |          7        0.09      100.00
------------+-----------------------------------
      Total |      7,841      100.00
0

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,830       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,841      100.00
0

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,823       99.77       99.77
          1 |         18        0.23      100.00
------------+-----------------------------------
      Total |      7,841      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_dias_da~e  temp_immun~e  diabetes_e~s  bmi_age
primary_c~se  bp_dias_da~d  temp_immun~f  diabetes_e~r  cancer_cat
primary_c~re  ~l_date_date  died_ons_c..  index         temp1
suspected_~e  hba1c~l_date  d~nfirmedc~y  onsconfirm..  temp2
ae_date       hba1c_perc..  died_ons_s~y  onssuspect~e  SCr_adj
cpnsd~h_date  crea~te_date  died_ons_c~g  dereg_date    min
ethni~6_date  crea~ne_date  ethnicity     ae_censor_~e  max
ethni~y_date  smoki~e_date  has_consul~y  cpnsd~r_date  diabcat
bmi_measured  smoki~s_date  hba1c_per~ge  onsconfirm..
bp_sys_dat~e  perm_immun~e  creatinine    carehometype
bp_sys_dat~d  perm_immun~f  diabetes_t~e  bmi_time

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. safecount
  7,841

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. safecount
  7,841

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. safecount 
  7,841

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. ****************************************************************
. *  Create outcome specific datasets for the whole population  *
. *****************************************************************
. 
. 
. foreach i of global outcomes {
  2.         use ./output/analysis_dataset.dta, clear
  3.         drop if `i'_date <= indexdate 
  4.         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
  5.         save ./output/analysis_dataset_STSET_`i'.dta, replace
  6. }       
(0 observations deleted)

                id:  patient_id
     failure event:  tested != 0 & tested < .
obs. time interval:  (stime_tested[_n-1], stime_tested]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time indexdate

------------------------------------------------------------------------------
      7,841  total observations
          0  exclusions
------------------------------------------------------------------------------
      7,841  observations remaining, representing
      7,841  subjects
         18  failures in single-failure-per-subject data
  2,210,767  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       282
(note: file ./output/analysis_dataset_STSET_tested.dta not found)
file ./output/analysis_dataset_STSET_tested.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  positivetest != 0 & positivetest < .
obs. time interval:  (stime_positivetest[_n-1], stime_positivetest]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time indexdate

------------------------------------------------------------------------------
      7,841  total observations
          0  exclusions
------------------------------------------------------------------------------
      7,841  observations remaining, representing
      7,841  subjects
         16  failures in single-failure-per-subject data
  2,210,842  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       282
(note: file ./output/analysis_dataset_STSET_positivetest.dta not found)
file ./output/analysis_dataset_STSET_positivetest.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  icu != 0 & icu < .
obs. time interval:  (stime_icu[_n-1], stime_icu]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time indexdate

------------------------------------------------------------------------------
      7,841  total observations
          0  exclusions
------------------------------------------------------------------------------
      7,841  observations remaining, representing
      7,841  subjects
          0  failures in single-failure-per-subject data
  1,411,380  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       180
(note: file ./output/analysis_dataset_STSET_icu.dta not found)
file ./output/analysis_dataset_STSET_icu.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  hes != 0 & hes < .
obs. time interval:  (stime_hes[_n-1], stime_hes]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time indexdate

------------------------------------------------------------------------------
      7,841  total observations
          0  exclusions
------------------------------------------------------------------------------
      7,841  observations remaining, representing
      7,841  subjects
      1,040  failures in single-failure-per-subject data
  2,175,859  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       282
(note: file ./output/analysis_dataset_STSET_hes.dta not found)
file ./output/analysis_dataset_STSET_hes.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time indexdate

------------------------------------------------------------------------------
      7,841  total observations
          0  exclusions
------------------------------------------------------------------------------
      7,841  observations remaining, representing
      7,841  subjects
          7  failures in single-failure-per-subject data
  2,210,954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       282
(note: file ./output/analysis_dataset_STSET_onscoviddeath.dta not found)
file ./output/analysis_dataset_STSET_onscoviddeath.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  ons_noncoviddeath != 0 & ons_noncoviddeath < .
obs. time interval:  (stime_ons_noncoviddeath[_n-1], stime_ons_noncoviddeath]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time indexdate

------------------------------------------------------------------------------
      7,841  total observations
          0  exclusions
------------------------------------------------------------------------------
      7,841  observations remaining, representing
      7,841  subjects
         11  failures in single-failure-per-subject data
  2,210,954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       282
(note: file ./output/analysis_dataset_STSET_ons_noncoviddeath.dta not found)
file ./output/analysis_dataset_STSET_ons_noncoviddeath.dta saved
(0 observations deleted)

                id:  patient_id
     failure event:  onsdeath != 0 & onsdeath < .
obs. time interval:  (stime_onsdeath[_n-1], stime_onsdeath]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time indexdate

------------------------------------------------------------------------------
      7,841  total observations
          0  exclusions
------------------------------------------------------------------------------
      7,841  observations remaining, representing
      7,841  subjects
         18  failures in single-failure-per-subject data
  2,210,954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       282
(note: file ./output/analysis_dataset_STSET_onsdeath.dta not found)
file ./output/analysis_dataset_STSET_onsdeath.dta saved

. 
. 
.         
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 closed on:   6 Jan 2021, 13:25:56
-------------------------------------------------------------------------------
