-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:  15 Jan 2021, 13:50:40

. 
. clear

. import delimited ./output/input.csv
(80 vars, 100,000 obs)

. 
. global outcomes "tested positivetest hes onscoviddeath ons_noncoviddeath onsd
> eath"

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(21,218 observations deleted)

. safecount
  78,782

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(23 observations deleted)

. safecount
  78,759

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(40,281 missing values generated)

. replace male = 0 if sex == "F"
(40,281 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male
0

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     40,281       51.14       51.14
       Male |     38,478       48.86      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. safecount
  78,759

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(78,759 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 78759 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. safetab imd, m
4

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     55,107       69.97       69.97
               4 |     15,661       19.88       89.85
 5 most deprived |      7,991       10.15      100.00
-----------------+-----------------------------------
           Total |     78,759      100.00

. 
. drop if imd==.u
(0 observations deleted)

. safecount
  78,759

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(73,837 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(73,833 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(73,747 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(63,936 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         d `var_date'
  3.         safetab `var'_date
  4.         confirm string variable `var'_date
  5.         rename `var'_date `var'_dstr
  6.         gen `var'_date = date(`var'_dstr, "YMD")
  7.         drop `var'_dstr
  8.         format `var'_date %td 
  9. 
. }

Contains data
  obs:        78,759                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
tested_date     str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

tested_date |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |        158        0.81        0.81
 2020-09-03 |        151        0.77        1.57
 2020-09-04 |        146        0.74        2.32
 2020-09-05 |        136        0.69        3.01
 2020-09-06 |        132        0.67        3.69
 2020-09-07 |        126        0.64        4.33
 2020-09-08 |        145        0.74        5.07
 2020-09-09 |        138        0.70        5.77
 2020-09-10 |        143        0.73        6.50
 2020-09-11 |        136        0.69        7.19
 2020-09-12 |        148        0.75        7.95
 2020-09-13 |        148        0.75        8.70
 2020-09-14 |        166        0.85        9.55
 2020-09-15 |        147        0.75       10.30
 2020-09-16 |        136        0.69       10.99
 2020-09-17 |        160        0.82       11.80
 2020-09-18 |        143        0.73       12.53
 2020-09-19 |        159        0.81       13.34
 2020-09-20 |        148        0.75       14.10
 2020-09-21 |        145        0.74       14.84
 2020-09-22 |        145        0.74       15.58
 2020-09-23 |        134        0.68       16.26
 2020-09-24 |        155        0.79       17.05
 2020-09-25 |        115        0.59       17.64
 2020-09-26 |        179        0.91       18.55
 2020-09-27 |        129        0.66       19.20
 2020-09-28 |        144        0.73       19.94
 2020-09-29 |        131        0.67       20.61
 2020-09-30 |        144        0.73       21.34
 2020-10-01 |        150        0.76       22.10
 2020-10-02 |        144        0.73       22.84
 2020-10-03 |        119        0.61       23.45
 2020-10-04 |        153        0.78       24.23
 2020-10-05 |        149        0.76       24.98
 2020-10-06 |        115        0.59       25.57
 2020-10-07 |        155        0.79       26.36
 2020-10-08 |        146        0.74       27.10
 2020-10-09 |        148        0.75       27.86
 2020-10-10 |        128        0.65       28.51
 2020-10-11 |        139        0.71       29.22
 2020-10-12 |        143        0.73       29.95
 2020-10-13 |        141        0.72       30.67
 2020-10-14 |        147        0.75       31.42
 2020-10-15 |        148        0.75       32.17
 2020-10-16 |        157        0.80       32.97
 2020-10-17 |        148        0.75       33.73
 2020-10-18 |        133        0.68       34.40
 2020-10-19 |        137        0.70       35.10
 2020-10-20 |        130        0.66       35.76
 2020-10-21 |        152        0.77       36.54
 2020-10-22 |        143        0.73       37.27
 2020-10-23 |        152        0.77       38.04
 2020-10-24 |        144        0.73       38.78
 2020-10-25 |        159        0.81       39.59
 2020-10-26 |        150        0.76       40.35
 2020-10-27 |        125        0.64       40.99
 2020-10-28 |        140        0.71       41.70
 2020-10-29 |        160        0.82       42.52
 2020-10-30 |        122        0.62       43.14
 2020-10-31 |        154        0.78       43.92
 2020-11-01 |        132        0.67       44.60
 2020-11-02 |        132        0.67       45.27
 2020-11-03 |        138        0.70       45.97
 2020-11-04 |        144        0.73       46.71
 2020-11-05 |        143        0.73       47.44
 2020-11-06 |        153        0.78       48.22
 2020-11-07 |        151        0.77       48.99
 2020-11-08 |        167        0.85       49.84
 2020-11-09 |        142        0.72       50.56
 2020-11-10 |        137        0.70       51.26
 2020-11-11 |        153        0.78       52.04
 2020-11-12 |        170        0.87       52.91
 2020-11-13 |        161        0.82       53.73
 2020-11-14 |        161        0.82       54.55
 2020-11-15 |        160        0.82       55.36
 2020-11-16 |        150        0.76       56.13
 2020-11-17 |        135        0.69       56.81
 2020-11-18 |        146        0.74       57.56
 2020-11-19 |        152        0.77       58.33
 2020-11-20 |        136        0.69       59.03
 2020-11-21 |        138        0.70       59.73
 2020-11-22 |        126        0.64       60.37
 2020-11-23 |        127        0.65       61.02
 2020-11-24 |        148        0.75       61.77
 2020-11-25 |        172        0.88       62.65
 2020-11-26 |        155        0.79       63.44
 2020-11-27 |        154        0.78       64.23
 2020-11-28 |        159        0.81       65.04
 2020-11-29 |        153        0.78       65.82
 2020-11-30 |        142        0.72       66.54
 2020-12-01 |        151        0.77       67.31
 2020-12-02 |        131        0.67       67.98
 2020-12-03 |        135        0.69       68.66
 2020-12-04 |        153        0.78       69.44
 2020-12-05 |        152        0.77       70.22
 2020-12-06 |        129        0.66       70.88
 2020-12-07 |        153        0.78       71.66
 2020-12-08 |        153        0.78       72.44
 2020-12-09 |        155        0.79       73.23
 2020-12-10 |        152        0.77       74.00
 2020-12-11 |        157        0.80       74.80
 2020-12-12 |        120        0.61       75.41
 2020-12-13 |        156        0.80       76.21
 2020-12-14 |        129        0.66       76.87
 2020-12-15 |        139        0.71       77.57
 2020-12-16 |        139        0.71       78.28
 2020-12-17 |        144        0.73       79.02
 2020-12-18 |        157        0.80       79.82
 2020-12-19 |        108        0.55       80.37
 2020-12-20 |        138        0.70       81.07
 2020-12-21 |        125        0.64       81.71
 2020-12-22 |        129        0.66       82.36
 2020-12-23 |        149        0.76       83.12
 2020-12-24 |        134        0.68       83.81
 2020-12-25 |        161        0.82       84.63
 2020-12-26 |        161        0.82       85.45
 2020-12-27 |        130        0.66       86.11
 2020-12-28 |        150        0.76       86.88
 2020-12-29 |        123        0.63       87.50
 2020-12-30 |        161        0.82       88.32
 2020-12-31 |        148        0.75       89.08
 2021-01-01 |        163        0.83       89.91
 2021-01-02 |        131        0.67       90.58
 2021-01-03 |        138        0.70       91.28
 2021-01-04 |        141        0.72       92.00
 2021-01-05 |        140        0.71       92.71
 2021-01-06 |        130        0.66       93.37
 2021-01-07 |        151        0.77       94.14
 2021-01-08 |        133        0.68       94.82
 2021-01-09 |        134        0.68       95.50
 2021-01-10 |        155        0.79       96.29
 2021-01-11 |        147        0.75       97.04
 2021-01-12 |        143        0.73       97.77
 2021-01-13 |        144        0.73       98.51
 2021-01-14 |        151        0.77       99.28
 2021-01-15 |        142        0.72      100.00
------------+-----------------------------------
      Total |     19,620      100.00
(59,139 missing values generated)

Contains data
  obs:        78,759                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

positivetes |
     t_date |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |        130        0.66        0.66
 2020-09-03 |        137        0.70        1.36
 2020-09-04 |        130        0.66        2.02
 2020-09-05 |        145        0.74        2.75
 2020-09-06 |        138        0.70        3.45
 2020-09-07 |        172        0.87        4.33
 2020-09-08 |        157        0.80        5.12
 2020-09-09 |        136        0.69        5.81
 2020-09-10 |        154        0.78        6.60
 2020-09-11 |        178        0.90        7.50
 2020-09-12 |        146        0.74        8.24
 2020-09-13 |        141        0.72        8.96
 2020-09-14 |        140        0.71        9.67
 2020-09-15 |        155        0.79       10.45
 2020-09-16 |        133        0.68       11.13
 2020-09-17 |        137        0.70       11.83
 2020-09-18 |        138        0.70       12.53
 2020-09-19 |        149        0.76       13.28
 2020-09-20 |        146        0.74       14.02
 2020-09-21 |        143        0.73       14.75
 2020-09-22 |        154        0.78       15.53
 2020-09-23 |        138        0.70       16.23
 2020-09-24 |        156        0.79       17.02
 2020-09-25 |        134        0.68       17.71
 2020-09-26 |        120        0.61       18.31
 2020-09-27 |        153        0.78       19.09
 2020-09-28 |        140        0.71       19.80
 2020-09-29 |        131        0.67       20.47
 2020-09-30 |        146        0.74       21.21
 2020-10-01 |        148        0.75       21.96
 2020-10-02 |        143        0.73       22.69
 2020-10-03 |        133        0.68       23.36
 2020-10-04 |        157        0.80       24.16
 2020-10-05 |        146        0.74       24.90
 2020-10-06 |        149        0.76       25.66
 2020-10-07 |        128        0.65       26.31
 2020-10-08 |        137        0.70       27.00
 2020-10-09 |        146        0.74       27.74
 2020-10-10 |        142        0.72       28.46
 2020-10-11 |        154        0.78       29.25
 2020-10-12 |        164        0.83       30.08
 2020-10-13 |        149        0.76       30.84
 2020-10-14 |        152        0.77       31.61
 2020-10-15 |        150        0.76       32.37
 2020-10-16 |        150        0.76       33.13
 2020-10-17 |        140        0.71       33.84
 2020-10-18 |        140        0.71       34.55
 2020-10-19 |        137        0.70       35.25
 2020-10-20 |        145        0.74       35.98
 2020-10-21 |        144        0.73       36.71
 2020-10-22 |        139        0.71       37.42
 2020-10-23 |        145        0.74       38.16
 2020-10-24 |        155        0.79       38.94
 2020-10-25 |        123        0.62       39.57
 2020-10-26 |        156        0.79       40.36
 2020-10-27 |        146        0.74       41.10
 2020-10-28 |        136        0.69       41.79
 2020-10-29 |        135        0.69       42.48
 2020-10-30 |        120        0.61       43.09
 2020-10-31 |        133        0.68       43.76
 2020-11-01 |        142        0.72       44.48
 2020-11-02 |        145        0.74       45.22
 2020-11-03 |        162        0.82       46.04
 2020-11-04 |        163        0.83       46.87
 2020-11-05 |        148        0.75       47.62
 2020-11-06 |        136        0.69       48.31
 2020-11-07 |        138        0.70       49.01
 2020-11-08 |        146        0.74       49.75
 2020-11-09 |        147        0.75       50.50
 2020-11-10 |        120        0.61       51.11
 2020-11-11 |        168        0.85       51.96
 2020-11-12 |        143        0.73       52.69
 2020-11-13 |        169        0.86       53.55
 2020-11-14 |        152        0.77       54.32
 2020-11-15 |        137        0.70       55.01
 2020-11-16 |        145        0.74       55.75
 2020-11-17 |        144        0.73       56.48
 2020-11-18 |        138        0.70       57.18
 2020-11-19 |        140        0.71       57.89
 2020-11-20 |        174        0.88       58.78
 2020-11-21 |        140        0.71       59.49
 2020-11-22 |        132        0.67       60.16
 2020-11-23 |        134        0.68       60.84
 2020-11-24 |        132        0.67       61.51
 2020-11-25 |        132        0.67       62.18
 2020-11-26 |        118        0.60       62.78
 2020-11-27 |        132        0.67       63.45
 2020-11-28 |        131        0.67       64.11
 2020-11-29 |        132        0.67       64.78
 2020-11-30 |        138        0.70       65.48
 2020-12-01 |        165        0.84       66.32
 2020-12-02 |        133        0.68       67.00
 2020-12-03 |        160        0.81       67.81
 2020-12-04 |        156        0.79       68.60
 2020-12-05 |        157        0.80       69.40
 2020-12-06 |        144        0.73       70.13
 2020-12-07 |        142        0.72       70.85
 2020-12-08 |        156        0.79       71.64
 2020-12-09 |        130        0.66       72.30
 2020-12-10 |        148        0.75       73.05
 2020-12-11 |        155        0.79       73.84
 2020-12-12 |        156        0.79       74.63
 2020-12-13 |        140        0.71       75.34
 2020-12-14 |        148        0.75       76.10
 2020-12-15 |        171        0.87       76.96
 2020-12-16 |        144        0.73       77.69
 2020-12-17 |        159        0.81       78.50
 2020-12-18 |        155        0.79       79.29
 2020-12-19 |        136        0.69       79.98
 2020-12-20 |        145        0.74       80.72
 2020-12-21 |        166        0.84       81.56
 2020-12-22 |        142        0.72       82.28
 2020-12-23 |        136        0.69       82.97
 2020-12-24 |        131        0.67       83.64
 2020-12-25 |        135        0.69       84.32
 2020-12-26 |        146        0.74       85.06
 2020-12-27 |        138        0.70       85.76
 2020-12-28 |        145        0.74       86.50
 2020-12-29 |        138        0.70       87.20
 2020-12-30 |        164        0.83       88.03
 2020-12-31 |        146        0.74       88.77
 2021-01-01 |        141        0.72       89.49
 2021-01-02 |        143        0.73       90.22
 2021-01-03 |        135        0.69       90.90
 2021-01-04 |        166        0.84       91.74
 2021-01-05 |        156        0.79       92.54
 2021-01-06 |        146        0.74       93.28
 2021-01-07 |        138        0.70       93.98
 2021-01-08 |        145        0.74       94.71
 2021-01-09 |        162        0.82       95.54
 2021-01-10 |        121        0.61       96.15
 2021-01-11 |        162        0.82       96.97
 2021-01-12 |        147        0.75       97.72
 2021-01-13 |        158        0.80       98.52
 2021-01-14 |        151        0.77       99.29
 2021-01-15 |        140        0.71      100.00
------------+-----------------------------------
      Total |     19,695      100.00
(59,064 missing values generated)

Contains data
  obs:        78,759                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

   hes_date |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |        139        0.71        0.71
 2020-09-03 |        138        0.70        1.41
 2020-09-04 |        157        0.80        2.21
 2020-09-05 |        154        0.78        2.99
 2020-09-06 |        146        0.74        3.73
 2020-09-07 |        156        0.79        4.53
 2020-09-08 |        128        0.65        5.18
 2020-09-09 |        161        0.82        6.00
 2020-09-10 |        164        0.83        6.83
 2020-09-11 |        136        0.69        7.52
 2020-09-12 |        152        0.77        8.30
 2020-09-13 |        139        0.71        9.00
 2020-09-14 |        135        0.69        9.69
 2020-09-15 |        138        0.70       10.39
 2020-09-16 |        145        0.74       11.13
 2020-09-17 |        120        0.61       11.74
 2020-09-18 |        130        0.66       12.40
 2020-09-19 |        161        0.82       13.22
 2020-09-20 |        137        0.70       13.92
 2020-09-21 |        150        0.76       14.68
 2020-09-22 |        160        0.81       15.49
 2020-09-23 |        126        0.64       16.13
 2020-09-24 |        140        0.71       16.85
 2020-09-25 |        145        0.74       17.58
 2020-09-26 |        161        0.82       18.40
 2020-09-27 |        124        0.63       19.03
 2020-09-28 |        134        0.68       19.71
 2020-09-29 |        130        0.66       20.38
 2020-09-30 |        158        0.80       21.18
 2020-10-01 |        143        0.73       21.91
 2020-10-02 |        126        0.64       22.55
 2020-10-03 |        141        0.72       23.26
 2020-10-04 |        151        0.77       24.03
 2020-10-05 |        145        0.74       24.77
 2020-10-06 |        144        0.73       25.50
 2020-10-07 |        142        0.72       26.22
 2020-10-08 |        143        0.73       26.95
 2020-10-09 |        162        0.82       27.78
 2020-10-10 |        157        0.80       28.57
 2020-10-11 |        169        0.86       29.43
 2020-10-12 |        124        0.63       30.06
 2020-10-13 |        153        0.78       30.84
 2020-10-14 |        145        0.74       31.58
 2020-10-15 |        154        0.78       32.36
 2020-10-16 |        139        0.71       33.07
 2020-10-17 |        153        0.78       33.85
 2020-10-18 |        163        0.83       34.68
 2020-10-19 |        138        0.70       35.38
 2020-10-20 |        137        0.70       36.08
 2020-10-21 |        163        0.83       36.91
 2020-10-22 |        164        0.83       37.74
 2020-10-23 |        148        0.75       38.49
 2020-10-24 |        169        0.86       39.35
 2020-10-25 |        132        0.67       40.02
 2020-10-26 |        155        0.79       40.81
 2020-10-27 |        149        0.76       41.57
 2020-10-28 |        139        0.71       42.28
 2020-10-29 |        153        0.78       43.05
 2020-10-30 |        141        0.72       43.77
 2020-10-31 |        131        0.67       44.44
 2020-11-01 |        139        0.71       45.15
 2020-11-02 |        151        0.77       45.91
 2020-11-03 |        138        0.70       46.62
 2020-11-04 |        136        0.69       47.31
 2020-11-05 |        145        0.74       48.04
 2020-11-06 |        140        0.71       48.76
 2020-11-07 |        132        0.67       49.43
 2020-11-08 |        133        0.68       50.10
 2020-11-09 |        150        0.76       50.87
 2020-11-10 |        136        0.69       51.56
 2020-11-11 |        164        0.83       52.39
 2020-11-12 |        146        0.74       53.14
 2020-11-13 |        143        0.73       53.86
 2020-11-14 |        158        0.80       54.67
 2020-11-15 |        144        0.73       55.40
 2020-11-16 |        139        0.71       56.11
 2020-11-17 |        145        0.74       56.84
 2020-11-18 |        139        0.71       57.55
 2020-11-19 |        130        0.66       58.21
 2020-11-20 |        143        0.73       58.94
 2020-11-21 |        148        0.75       59.69
 2020-11-22 |        165        0.84       60.53
 2020-11-23 |        145        0.74       61.27
 2020-11-24 |        159        0.81       62.08
 2020-11-25 |        132        0.67       62.75
 2020-11-26 |        131        0.67       63.41
 2020-11-27 |        158        0.80       64.22
 2020-11-28 |        152        0.77       64.99
 2020-11-29 |        124        0.63       65.62
 2020-11-30 |        132        0.67       66.29
 2020-12-01 |        138        0.70       67.00
 2020-12-02 |        141        0.72       67.71
 2020-12-03 |        138        0.70       68.41
 2020-12-04 |        122        0.62       69.04
 2020-12-05 |        143        0.73       69.76
 2020-12-06 |        147        0.75       70.51
 2020-12-07 |        143        0.73       71.24
 2020-12-08 |        141        0.72       71.95
 2020-12-09 |        129        0.66       72.61
 2020-12-10 |        141        0.72       73.33
 2020-12-11 |        159        0.81       74.14
 2020-12-12 |        141        0.72       74.85
 2020-12-13 |        148        0.75       75.61
 2020-12-14 |        149        0.76       76.36
 2020-12-15 |        126        0.64       77.01
 2020-12-16 |        124        0.63       77.64
 2020-12-17 |        154        0.78       78.42
 2020-12-18 |        146        0.74       79.16
 2020-12-19 |        129        0.66       79.82
 2020-12-20 |        154        0.78       80.60
 2020-12-21 |        135        0.69       81.29
 2020-12-22 |        141        0.72       82.00
 2020-12-23 |        131        0.67       82.67
 2020-12-24 |        160        0.81       83.49
 2020-12-25 |        143        0.73       84.21
 2020-12-26 |        134        0.68       84.89
 2020-12-27 |        136        0.69       85.59
 2020-12-28 |        149        0.76       86.34
 2020-12-29 |        146        0.74       87.09
 2020-12-30 |        166        0.84       87.93
 2020-12-31 |        142        0.72       88.65
 2021-01-01 |        154        0.78       89.44
 2021-01-02 |        148        0.75       90.19
 2021-01-03 |        129        0.66       90.84
 2021-01-04 |        167        0.85       91.69
 2021-01-05 |        148        0.75       92.45
 2021-01-06 |        139        0.71       93.15
 2021-01-07 |        146        0.74       93.90
 2021-01-08 |        140        0.71       94.61
 2021-01-09 |        143        0.73       95.34
 2021-01-10 |        150        0.76       96.10
 2021-01-11 |        163        0.83       96.93
 2021-01-12 |        138        0.70       97.63
 2021-01-13 |        148        0.75       98.38
 2021-01-14 |        150        0.76       99.15
 2021-01-15 |        168        0.85      100.00
------------+-----------------------------------
      Total |     19,661      100.00
(59,098 missing values generated)

Contains data
  obs:        78,759                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

onscoviddea |
    th_date |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |         39        0.79        0.79
 2020-09-03 |         40        0.81        1.61
 2020-09-04 |         44        0.89        2.50
 2020-09-05 |         36        0.73        3.23
 2020-09-06 |         41        0.83        4.06
 2020-09-07 |         41        0.83        4.90
 2020-09-08 |         29        0.59        5.49
 2020-09-09 |         55        1.12        6.60
 2020-09-10 |         27        0.55        7.15
 2020-09-11 |         39        0.79        7.94
 2020-09-12 |         38        0.77        8.72
 2020-09-13 |         26        0.53        9.24
 2020-09-14 |         32        0.65        9.89
 2020-09-15 |         38        0.77       10.67
 2020-09-16 |         41        0.83       11.50
 2020-09-17 |         33        0.67       12.17
 2020-09-18 |         40        0.81       12.98
 2020-09-19 |         36        0.73       13.71
 2020-09-20 |         36        0.73       14.45
 2020-09-21 |         36        0.73       15.18
 2020-09-22 |         41        0.83       16.01
 2020-09-23 |         29        0.59       16.60
 2020-09-24 |         24        0.49       17.09
 2020-09-25 |         33        0.67       17.76
 2020-09-26 |         27        0.55       18.31
 2020-09-27 |         38        0.77       19.08
 2020-09-28 |         52        1.06       20.13
 2020-09-29 |         42        0.85       20.99
 2020-09-30 |         36        0.73       21.72
 2020-10-01 |         46        0.93       22.65
 2020-10-02 |         35        0.71       23.36
 2020-10-03 |         33        0.67       24.03
 2020-10-04 |         35        0.71       24.75
 2020-10-05 |         30        0.61       25.36
 2020-10-06 |         31        0.63       25.99
 2020-10-07 |         42        0.85       26.84
 2020-10-08 |         34        0.69       27.53
 2020-10-09 |         29        0.59       28.12
 2020-10-10 |         34        0.69       28.81
 2020-10-11 |         33        0.67       29.48
 2020-10-12 |         36        0.73       30.21
 2020-10-13 |         35        0.71       30.92
 2020-10-14 |         38        0.77       31.69
 2020-10-15 |         34        0.69       32.39
 2020-10-16 |         39        0.79       33.18
 2020-10-17 |         31        0.63       33.81
 2020-10-18 |         29        0.59       34.40
 2020-10-19 |         41        0.83       35.23
 2020-10-20 |         45        0.91       36.14
 2020-10-21 |         37        0.75       36.90
 2020-10-22 |         35        0.71       37.61
 2020-10-23 |         36        0.73       38.34
 2020-10-24 |         36        0.73       39.07
 2020-10-25 |         24        0.49       39.56
 2020-10-26 |         30        0.61       40.17
 2020-10-27 |         33        0.67       40.84
 2020-10-28 |         34        0.69       41.53
 2020-10-29 |         45        0.91       42.44
 2020-10-30 |         39        0.79       43.23
 2020-10-31 |         28        0.57       43.80
 2020-11-01 |         30        0.61       44.41
 2020-11-02 |         33        0.67       45.08
 2020-11-03 |         26        0.53       45.61
 2020-11-04 |         39        0.79       46.40
 2020-11-05 |         30        0.61       47.01
 2020-11-06 |         28        0.57       47.58
 2020-11-07 |         38        0.77       48.35
 2020-11-08 |         33        0.67       49.02
 2020-11-09 |         38        0.77       49.80
 2020-11-10 |         31        0.63       50.43
 2020-11-11 |         40        0.81       51.24
 2020-11-12 |         38        0.77       52.01
 2020-11-13 |         40        0.81       52.82
 2020-11-14 |         49        1.00       53.82
 2020-11-15 |         35        0.71       54.53
 2020-11-16 |         35        0.71       55.24
 2020-11-17 |         29        0.59       55.83
 2020-11-18 |         32        0.65       56.48
 2020-11-19 |         34        0.69       57.17
 2020-11-20 |         29        0.59       57.76
 2020-11-21 |         39        0.79       58.55
 2020-11-22 |         31        0.63       59.18
 2020-11-23 |         42        0.85       60.04
 2020-11-24 |         29        0.59       60.63
 2020-11-25 |         59        1.20       61.82
 2020-11-26 |         29        0.59       62.41
 2020-11-27 |         46        0.93       63.35
 2020-11-28 |         40        0.81       64.16
 2020-11-29 |         30        0.61       64.77
 2020-11-30 |         39        0.79       65.56
 2020-12-01 |         31        0.63       66.19
 2020-12-02 |         34        0.69       66.88
 2020-12-03 |         45        0.91       67.80
 2020-12-04 |         46        0.93       68.73
 2020-12-05 |         43        0.87       69.61
 2020-12-06 |         40        0.81       70.42
 2020-12-07 |         28        0.57       70.99
 2020-12-08 |         34        0.69       71.68
 2020-12-09 |         36        0.73       72.41
 2020-12-10 |         31        0.63       73.04
 2020-12-11 |         38        0.77       73.81
 2020-12-12 |         31        0.63       74.44
 2020-12-13 |         32        0.65       75.09
 2020-12-14 |         38        0.77       75.86
 2020-12-15 |         34        0.69       76.55
 2020-12-16 |         29        0.59       77.14
 2020-12-17 |         41        0.83       77.98
 2020-12-18 |         37        0.75       78.73
 2020-12-19 |         30        0.61       79.34
 2020-12-20 |         37        0.75       80.09
 2020-12-21 |         32        0.65       80.74
 2020-12-22 |         45        0.91       81.65
 2020-12-23 |         40        0.81       82.47
 2020-12-24 |         37        0.75       83.22
 2020-12-25 |         42        0.85       84.07
 2020-12-26 |         30        0.61       84.68
 2020-12-27 |         36        0.73       85.41
 2020-12-28 |         44        0.89       86.31
 2020-12-29 |         42        0.85       87.16
 2020-12-30 |         35        0.71       87.87
 2020-12-31 |         51        1.04       88.91
 2021-01-01 |         38        0.77       89.68
 2021-01-02 |         36        0.73       90.41
 2021-01-03 |         31        0.63       91.04
 2021-01-04 |         45        0.91       91.95
 2021-01-05 |         32        0.65       92.60
 2021-01-06 |         35        0.71       93.32
 2021-01-07 |         47        0.95       94.27
 2021-01-08 |         36        0.73       95.00
 2021-01-09 |         30        0.61       95.61
 2021-01-10 |         34        0.69       96.30
 2021-01-11 |         43        0.87       97.18
 2021-01-12 |         32        0.65       97.83
 2021-01-13 |         42        0.85       98.68
 2021-01-14 |         27        0.55       99.23
 2021-01-15 |         38        0.77      100.00
------------+-----------------------------------
      Total |      4,922      100.00
(73,837 missing values generated)

Contains data
  obs:        78,759                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

ons_noncovi |
ddeath_date |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |        123        0.83        0.83
 2020-09-03 |        105        0.71        1.54
 2020-09-04 |        124        0.84        2.37
 2020-09-05 |        113        0.76        3.14
 2020-09-06 |        112        0.76        3.89
 2020-09-07 |        110        0.74        4.63
 2020-09-08 |        106        0.72        5.35
 2020-09-09 |        121        0.82        6.17
 2020-09-10 |        111        0.75        6.91
 2020-09-11 |        115        0.78        7.69
 2020-09-12 |        119        0.80        8.49
 2020-09-13 |        119        0.80        9.30
 2020-09-14 |        119        0.80       10.10
 2020-09-15 |        109        0.74       10.83
 2020-09-16 |        111        0.75       11.58
 2020-09-17 |        113        0.76       12.35
 2020-09-18 |        124        0.84       13.18
 2020-09-19 |        106        0.72       13.90
 2020-09-20 |        113        0.76       14.66
 2020-09-21 |        114        0.77       15.43
 2020-09-22 |        117        0.79       16.22
 2020-09-23 |         99        0.67       16.89
 2020-09-24 |        102        0.69       17.57
 2020-09-25 |        104        0.70       18.28
 2020-09-26 |        102        0.69       18.96
 2020-09-27 |        118        0.80       19.76
 2020-09-28 |        111        0.75       20.51
 2020-09-29 |        115        0.78       21.28
 2020-09-30 |        109        0.74       22.02
 2020-10-01 |        129        0.87       22.89
 2020-10-02 |        115        0.78       23.67
 2020-10-03 |        106        0.72       24.38
 2020-10-04 |        109        0.74       25.12
 2020-10-05 |         96        0.65       25.76
 2020-10-06 |        105        0.71       26.47
 2020-10-07 |        114        0.77       27.24
 2020-10-08 |        107        0.72       27.96
 2020-10-09 |        122        0.82       28.79
 2020-10-10 |        121        0.82       29.60
 2020-10-11 |        114        0.77       30.37
 2020-10-12 |         93        0.63       31.00
 2020-10-13 |         89        0.60       31.60
 2020-10-14 |        105        0.71       32.31
 2020-10-15 |        108        0.73       33.04
 2020-10-16 |        133        0.90       33.93
 2020-10-17 |        112        0.76       34.69
 2020-10-18 |        116        0.78       35.47
 2020-10-19 |        115        0.78       36.25
 2020-10-20 |         99        0.67       36.92
 2020-10-21 |        119        0.80       37.72
 2020-10-22 |        109        0.74       38.45
 2020-10-23 |        112        0.76       39.21
 2020-10-24 |        122        0.82       40.03
 2020-10-25 |        110        0.74       40.77
 2020-10-26 |         99        0.67       41.44
 2020-10-27 |        108        0.73       42.17
 2020-10-28 |         80        0.54       42.71
 2020-10-29 |        110        0.74       43.45
 2020-10-30 |        102        0.69       44.14
 2020-10-31 |         97        0.65       44.80
 2020-11-01 |        112        0.76       45.55
 2020-11-02 |        106        0.72       46.27
 2020-11-03 |        108        0.73       46.99
 2020-11-04 |        112        0.76       47.75
 2020-11-05 |        125        0.84       48.59
 2020-11-06 |        106        0.72       49.31
 2020-11-07 |        110        0.74       50.05
 2020-11-08 |        124        0.84       50.89
 2020-11-09 |        112        0.76       51.64
 2020-11-10 |         99        0.67       52.31
 2020-11-11 |        115        0.78       53.09
 2020-11-12 |         92        0.62       53.71
 2020-11-13 |        102        0.69       54.40
 2020-11-14 |        102        0.69       55.08
 2020-11-15 |        122        0.82       55.91
 2020-11-16 |        134        0.90       56.81
 2020-11-17 |        101        0.68       57.49
 2020-11-18 |        108        0.73       58.22
 2020-11-19 |        113        0.76       58.98
 2020-11-20 |         98        0.66       59.64
 2020-11-21 |        113        0.76       60.41
 2020-11-22 |        115        0.78       61.18
 2020-11-23 |         98        0.66       61.84
 2020-11-24 |        110        0.74       62.59
 2020-11-25 |        120        0.81       63.39
 2020-11-26 |        100        0.67       64.07
 2020-11-27 |        101        0.68       64.75
 2020-11-28 |        116        0.78       65.53
 2020-11-29 |        113        0.76       66.30
 2020-11-30 |        100        0.67       66.97
 2020-12-01 |        101        0.68       67.65
 2020-12-02 |        116        0.78       68.43
 2020-12-03 |         96        0.65       69.08
 2020-12-04 |        111        0.75       69.83
 2020-12-05 |        111        0.75       70.58
 2020-12-06 |        102        0.69       71.27
 2020-12-07 |        104        0.70       71.97
 2020-12-08 |        104        0.70       72.67
 2020-12-09 |        116        0.78       73.45
 2020-12-10 |        115        0.78       74.23
 2020-12-11 |        118        0.80       75.03
 2020-12-12 |        113        0.76       75.79
 2020-12-13 |        106        0.72       76.50
 2020-12-14 |        101        0.68       77.18
 2020-12-15 |        105        0.71       77.89
 2020-12-16 |        121        0.82       78.71
 2020-12-17 |        109        0.74       79.44
 2020-12-18 |        118        0.80       80.24
 2020-12-19 |         99        0.67       80.91
 2020-12-20 |        106        0.72       81.62
 2020-12-21 |        101        0.68       82.30
 2020-12-22 |        103        0.69       83.00
 2020-12-23 |        109        0.74       83.73
 2020-12-24 |        113        0.76       84.50
 2020-12-25 |        113        0.76       85.26
 2020-12-26 |        113        0.76       86.02
 2020-12-27 |        110        0.74       86.76
 2020-12-28 |        102        0.69       87.45
 2020-12-29 |         96        0.65       88.10
 2020-12-30 |        104        0.70       88.80
 2020-12-31 |         98        0.66       89.46
 2021-01-01 |        101        0.68       90.14
 2021-01-02 |         96        0.65       90.79
 2021-01-03 |         95        0.64       91.43
 2021-01-04 |         95        0.64       92.07
 2021-01-05 |        125        0.84       92.92
 2021-01-06 |        114        0.77       93.69
 2021-01-07 |        108        0.73       94.41
 2021-01-08 |         89        0.60       95.01
 2021-01-09 |        105        0.71       95.72
 2021-01-10 |        102        0.69       96.41
 2021-01-11 |        118        0.80       97.21
 2021-01-12 |         92        0.62       97.83
 2021-01-13 |        102        0.69       98.52
 2021-01-14 |        119        0.80       99.32
 2021-01-15 |        101        0.68      100.00
------------+-----------------------------------
      Total |     14,823      100.00
(63,936 missing values generated)

Contains data
  obs:        78,759                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
ons_noncovidd~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

onsdeath_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |        162        0.82        0.82
 2020-09-03 |        145        0.73        1.55
 2020-09-04 |        168        0.85        2.41
 2020-09-05 |        149        0.75        3.16
 2020-09-06 |        153        0.77        3.94
 2020-09-07 |        151        0.76        4.70
 2020-09-08 |        135        0.68        5.38
 2020-09-09 |        176        0.89        6.28
 2020-09-10 |        138        0.70        6.97
 2020-09-11 |        154        0.78        7.75
 2020-09-12 |        157        0.80        8.55
 2020-09-13 |        145        0.73        9.28
 2020-09-14 |        151        0.76       10.05
 2020-09-15 |        147        0.74       10.79
 2020-09-16 |        152        0.77       11.56
 2020-09-17 |        146        0.74       12.30
 2020-09-18 |        164        0.83       13.13
 2020-09-19 |        142        0.72       13.85
 2020-09-20 |        149        0.75       14.61
 2020-09-21 |        150        0.76       15.37
 2020-09-22 |        158        0.80       16.17
 2020-09-23 |        128        0.65       16.81
 2020-09-24 |        126        0.64       17.45
 2020-09-25 |        137        0.69       18.15
 2020-09-26 |        129        0.65       18.80
 2020-09-27 |        156        0.79       19.59
 2020-09-28 |        163        0.83       20.42
 2020-09-29 |        157        0.80       21.21
 2020-09-30 |        145        0.73       21.94
 2020-10-01 |        175        0.89       22.83
 2020-10-02 |        150        0.76       23.59
 2020-10-03 |        139        0.70       24.29
 2020-10-04 |        144        0.73       25.02
 2020-10-05 |        126        0.64       25.66
 2020-10-06 |        136        0.69       26.35
 2020-10-07 |        156        0.79       27.14
 2020-10-08 |        141        0.71       27.86
 2020-10-09 |        151        0.76       28.62
 2020-10-10 |        155        0.79       29.40
 2020-10-11 |        147        0.74       30.15
 2020-10-12 |        129        0.65       30.80
 2020-10-13 |        124        0.63       31.43
 2020-10-14 |        143        0.72       32.15
 2020-10-15 |        142        0.72       32.87
 2020-10-16 |        172        0.87       33.75
 2020-10-17 |        143        0.72       34.47
 2020-10-18 |        145        0.73       35.20
 2020-10-19 |        156        0.79       35.99
 2020-10-20 |        144        0.73       36.72
 2020-10-21 |        156        0.79       37.51
 2020-10-22 |        144        0.73       38.24
 2020-10-23 |        148        0.75       38.99
 2020-10-24 |        158        0.80       39.79
 2020-10-25 |        134        0.68       40.47
 2020-10-26 |        129        0.65       41.12
 2020-10-27 |        141        0.71       41.84
 2020-10-28 |        114        0.58       42.42
 2020-10-29 |        155        0.79       43.20
 2020-10-30 |        141        0.71       43.91
 2020-10-31 |        125        0.63       44.55
 2020-11-01 |        142        0.72       45.27
 2020-11-02 |        139        0.70       45.97
 2020-11-03 |        134        0.68       46.65
 2020-11-04 |        151        0.76       47.41
 2020-11-05 |        155        0.79       48.20
 2020-11-06 |        134        0.68       48.88
 2020-11-07 |        148        0.75       49.63
 2020-11-08 |        157        0.80       50.42
 2020-11-09 |        150        0.76       51.18
 2020-11-10 |        130        0.66       51.84
 2020-11-11 |        155        0.79       52.63
 2020-11-12 |        130        0.66       53.28
 2020-11-13 |        142        0.72       54.00
 2020-11-14 |        151        0.76       54.77
 2020-11-15 |        157        0.80       55.56
 2020-11-16 |        169        0.86       56.42
 2020-11-17 |        130        0.66       57.08
 2020-11-18 |        140        0.71       57.79
 2020-11-19 |        147        0.74       58.53
 2020-11-20 |        127        0.64       59.17
 2020-11-21 |        152        0.77       59.94
 2020-11-22 |        146        0.74       60.68
 2020-11-23 |        140        0.71       61.39
 2020-11-24 |        139        0.70       62.10
 2020-11-25 |        179        0.91       63.00
 2020-11-26 |        129        0.65       63.66
 2020-11-27 |        147        0.74       64.40
 2020-11-28 |        156        0.79       65.19
 2020-11-29 |        143        0.72       65.92
 2020-11-30 |        139        0.70       66.62
 2020-12-01 |        132        0.67       67.29
 2020-12-02 |        150        0.76       68.05
 2020-12-03 |        141        0.71       68.76
 2020-12-04 |        157        0.80       69.56
 2020-12-05 |        154        0.78       70.34
 2020-12-06 |        142        0.72       71.06
 2020-12-07 |        132        0.67       71.72
 2020-12-08 |        138        0.70       72.42
 2020-12-09 |        152        0.77       73.19
 2020-12-10 |        146        0.74       73.93
 2020-12-11 |        156        0.79       74.72
 2020-12-12 |        144        0.73       75.45
 2020-12-13 |        138        0.70       76.15
 2020-12-14 |        139        0.70       76.85
 2020-12-15 |        139        0.70       77.56
 2020-12-16 |        150        0.76       78.32
 2020-12-17 |        150        0.76       79.08
 2020-12-18 |        155        0.79       79.86
 2020-12-19 |        129        0.65       80.52
 2020-12-20 |        143        0.72       81.24
 2020-12-21 |        133        0.67       81.91
 2020-12-22 |        148        0.75       82.66
 2020-12-23 |        149        0.75       83.42
 2020-12-24 |        150        0.76       84.18
 2020-12-25 |        155        0.79       84.96
 2020-12-26 |        143        0.72       85.69
 2020-12-27 |        146        0.74       86.43
 2020-12-28 |        146        0.74       87.17
 2020-12-29 |        138        0.70       87.87
 2020-12-30 |        139        0.70       88.57
 2020-12-31 |        149        0.75       89.32
 2021-01-01 |        139        0.70       90.03
 2021-01-02 |        132        0.67       90.70
 2021-01-03 |        126        0.64       91.33
 2021-01-04 |        140        0.71       92.04
 2021-01-05 |        157        0.80       92.84
 2021-01-06 |        149        0.75       93.59
 2021-01-07 |        155        0.79       94.38
 2021-01-08 |        125        0.63       95.01
 2021-01-09 |        135        0.68       95.70
 2021-01-10 |        136        0.69       96.38
 2021-01-11 |        161        0.82       97.20
 2021-01-12 |        124        0.63       97.83
 2021-01-13 |        144        0.73       98.56
 2021-01-14 |        146        0.74       99.30
 2021-01-15 |        139        0.70      100.00
------------+-----------------------------------
      Total |     19,745      100.00
(59,014 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(78,759 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 safetab `i'
  5. }
(19,620 real changes made)
0

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,139       75.09       75.09
          1 |     19,620       24.91      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(19,695 real changes made)
0

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,064       74.99       74.99
          1 |     19,695       25.01      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(19,661 real changes made)
0

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,098       75.04       75.04
          1 |     19,661       24.96      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(4,922 real changes made)
0

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     73,837       93.75       93.75
          1 |      4,922        6.25      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(14,823 real changes made)
0

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,936       81.18       81.18
          1 |     14,823       18.82      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(19,745 real changes made)
0

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,014       74.93       74.93
          1 |     19,745       25.07      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("09/11/2020")

. gen positivetest_censor_date = d("09/11/2020")

. gen ae_censor_date = d("09/11/2020")

. gen hes_censor_date = d("09/11/2020")

. gen icu_censor_date = d("18/08/2020")

. gen cpnsdeath_censor_date  = d("09/11/2020")

. gen onsdeath_censor_date = d("09/11/2020")

. gen onscoviddeath_censor_date = d("09/11/2020")

. gen ons_noncoviddeath_censor_date = d("09/11/2020")

. gen onsconfirmeddeath_censor_date=d("09/11/2020")

. 
. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |     78,759   09nov2020           0  09nov2020  09nov2020
posit~r_date |     78,759   09nov2020           0  09nov2020  09nov2020
ae_censor_~e |     78,759   09nov2020           0  09nov2020  09nov2020
hes_censor~e |     78,759   09nov2020           0  09nov2020  09nov2020
icu_censor~e |     78,759   18aug2020           0  18aug2020  18aug2020
-------------+---------------------------------------------------------
cpnsd~r_date |     78,759   09nov2020           0  09nov2020  09nov2020
onsdeath_c~e |     78,759   09nov2020           0  09nov2020  09nov2020
onscovidde.. |     78,759   09nov2020           0  09nov2020  09nov2020
ons_n~r_date |     78,759   09nov2020           0  09nov2020  09nov2020
onsconfirm.. |     78,759   09nov2020           0  09nov2020  09nov2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. safetab ethnicity, m
10

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     11,919       15.13       15.13
                 Mixed |     11,794       14.97       30.11
Asian or Asian British |     11,695       14.85       44.96
                 Black |     11,788       14.97       59.92
                 Other |     11,869       15.07       74.99
                     . |     19,694       25.01      100.00
-----------------------+-----------------------------------
                 Total |     78,759      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(66,840 missing values generated)

.  replace eth5=2 if ethnicity==3
(11,695 real changes made)

.  replace eth5=3 if ethnicity==4
(11,788 real changes made)

.  replace eth5=4 if ethnicity==2
(11,794 real changes made)

.  replace eth5=5 if ethnicity==5
(11,869 real changes made)

.  replace eth5=6 if ethnicity==.
(19,694 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     11,919       15.13       15.13
South Asian |     11,695       14.85       29.98
      Black |     11,788       14.97       44.95
      Mixed |     11,794       14.97       59.92
      Other |     11,869       15.07       74.99
    Unknown |     19,694       25.01      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(19,612 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. safetab ethnicity_16,m
13

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |      3,691        4.69        4.69
            Irish |      3,707        4.71        9.39
      Other White |      3,727        4.73       14.13
White + Caribbean |      3,661        4.65       18.77
  White + African |      3,658        4.64       23.42
    White + Asian |      3,707        4.71       28.13
      Other mixed |      3,719        4.72       32.85
           Indian |      3,758        4.77       37.62
        Pakistani |      3,620        4.60       42.21
      Bangladeshi |      3,748        4.76       46.97
      Other Asian |      3,691        4.69       51.66
        Caribbean |      3,717        4.72       56.38
          African |      3,718        4.72       61.10
      Other Black |      3,700        4.70       65.80
          Chinese |      3,673        4.66       70.46
            Other |      3,652        4.64       75.10
          Unknown |     19,612       24.90      100.00
------------------+-----------------------------------
            Total |     78,759      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 14745 changes made)

. recode eth16 8 = 4
(eth16: 3758 changes made)

. recode eth16 9 = 5
(eth16: 3620 changes made)

. recode eth16 10 = 6
(eth16: 3748 changes made)

. recode eth16 11= 7
(eth16: 3691 changes made)

. recode eth16 12 = 8
(eth16: 3717 changes made)

. recode eth16 13 = 9
(eth16: 3718 changes made)

. recode eth16 14 = 10
(eth16: 3700 changes made)

. recode eth16 15 = 11
(eth16: 3673 changes made)

. recode eth16 99 = 12
(eth16: 14745 changes made)

. recode eth16 16 = 13
(eth16: 3652 changes made)

. recode eth16 17 = 14
(eth16: 19612 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. safetab eth16,m
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |      3,691        4.69        4.69
      Irish |      3,707        4.71        9.39
Other White |      3,727        4.73       14.13
     Indian |      3,758        4.77       18.90
  Pakistani |      3,620        4.60       23.49
Bangladeshi |      3,748        4.76       28.25
Other Asian |      3,691        4.69       32.94
  Caribbean |      3,717        4.72       37.66
    African |      3,718        4.72       42.38
Other Black |      3,700        4.70       47.08
    Chinese |      3,673        4.66       51.74
  All mixed |     14,745       18.72       70.46
      Other |      3,652        4.64       75.10
    Unknown |     19,612       24.90      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. safetab eth16 eth5, m
11

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |       537        556        567        559 |     3,691 
      Irish |       561        578        549        536 |     3,707 
Other White |       568        548        576        543 |     3,727 
     Indian |       558        585        545        579 |     3,758 
  Pakistani |       540        548        503        548 |     3,620 
Bangladeshi |       582        555        571        578 |     3,748 
Other Asian |       585        554        526        509 |     3,691 
  Caribbean |       555        538        551        572 |     3,717 
    African |       551        553        576        587 |     3,718 
Other Black |       570        571        508        564 |     3,700 
    Chinese |       541        538        547        526 |     3,673 
  All mixed |     2,282      2,142      2,273      2,099 |    14,745 
      Other |       519        558        545        544 |     3,652 
    Unknown |     2,970      2,871      2,951      3,050 |    19,612 
------------+--------------------------------------------+----------
      Total |    11,919     11,695     11,788     11,794 |    78,759 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |       575        897 |     3,691 
      Irish |       572        911 |     3,707 
Other White |       533        959 |     3,727 
     Indian |       570        921 |     3,758 
  Pakistani |       554        927 |     3,620 
Bangladeshi |       595        867 |     3,748 
Other Asian |       550        967 |     3,691 
  Caribbean |       573        928 |     3,717 
    African |       581        870 |     3,718 
Other Black |       550        937 |     3,700 
    Chinese |       569        952 |     3,673 
  All mixed |     2,227      3,722 |    14,745 
      Other |       587        899 |     3,652 
    Unknown |     2,833      4,937 |    19,612 
------------+----------------------+----------
      Total |    11,869     19,694 |    78,759 

. bysort eth5: safetab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        537        4.51        4.51
      Irish |        561        4.71        9.21
Other White |        568        4.77       13.98
     Indian |        558        4.68       18.66
  Pakistani |        540        4.53       23.19
Bangladeshi |        582        4.88       28.07
Other Asian |        585        4.91       32.98
  Caribbean |        555        4.66       37.64
    African |        551        4.62       42.26
Other Black |        570        4.78       47.04
    Chinese |        541        4.54       51.58
  All mixed |      2,282       19.15       70.73
      Other |        519        4.35       75.08
    Unknown |      2,970       24.92      100.00
------------+-----------------------------------
      Total |     11,919      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        556        4.75        4.75
      Irish |        578        4.94        9.70
Other White |        548        4.69       14.38
     Indian |        585        5.00       19.38
  Pakistani |        548        4.69       24.07
Bangladeshi |        555        4.75       28.82
Other Asian |        554        4.74       33.55
  Caribbean |        538        4.60       38.15
    African |        553        4.73       42.88
Other Black |        571        4.88       47.76
    Chinese |        538        4.60       52.36
  All mixed |      2,142       18.32       70.68
      Other |        558        4.77       75.45
    Unknown |      2,871       24.55      100.00
------------+-----------------------------------
      Total |     11,695      100.00

-------------------------------------------------------------------------------
-> eth5 = Black
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        567        4.81        4.81
      Irish |        549        4.66        9.47
Other White |        576        4.89       14.35
     Indian |        545        4.62       18.98
  Pakistani |        503        4.27       23.24
Bangladeshi |        571        4.84       28.09
Other Asian |        526        4.46       32.55
  Caribbean |        551        4.67       37.22
    African |        576        4.89       42.11
Other Black |        508        4.31       46.42
    Chinese |        547        4.64       51.06
  All mixed |      2,273       19.28       70.34
      Other |        545        4.62       74.97
    Unknown |      2,951       25.03      100.00
------------+-----------------------------------
      Total |     11,788      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        559        4.74        4.74
      Irish |        536        4.54        9.28
Other White |        543        4.60       13.89
     Indian |        579        4.91       18.80
  Pakistani |        548        4.65       23.44
Bangladeshi |        578        4.90       28.34
Other Asian |        509        4.32       32.66
  Caribbean |        572        4.85       37.51
    African |        587        4.98       42.49
Other Black |        564        4.78       47.27
    Chinese |        526        4.46       51.73
  All mixed |      2,099       17.80       69.53
      Other |        544        4.61       74.14
    Unknown |      3,050       25.86      100.00
------------+-----------------------------------
      Total |     11,794      100.00

-------------------------------------------------------------------------------
-> eth5 = Other
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        575        4.84        4.84
      Irish |        572        4.82        9.66
Other White |        533        4.49       14.15
     Indian |        570        4.80       18.96
  Pakistani |        554        4.67       23.62
Bangladeshi |        595        5.01       28.64
Other Asian |        550        4.63       33.27
  Caribbean |        573        4.83       38.10
    African |        581        4.90       42.99
Other Black |        550        4.63       47.63
    Chinese |        569        4.79       52.42
  All mixed |      2,227       18.76       71.19
      Other |        587        4.95       76.13
    Unknown |      2,833       23.87      100.00
------------+-----------------------------------
      Total |     11,869      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        897        4.55        4.55
      Irish |        911        4.63        9.18
Other White |        959        4.87       14.05
     Indian |        921        4.68       18.73
  Pakistani |        927        4.71       23.43
Bangladeshi |        867        4.40       27.84
Other Asian |        967        4.91       32.75
  Caribbean |        928        4.71       37.46
    African |        870        4.42       41.88
Other Black |        937        4.76       46.63
    Chinese |        952        4.83       51.47
  All mixed |      3,722       18.90       70.37
      Other |        899        4.56       74.93
    Unknown |      4,937       25.07      100.00
------------+-----------------------------------
      Total |     19,694      100.00

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(78,749 missing values generated)

. replace stp = sum(stp)
(78,758 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(78759 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(11,706 real changes made)

. safetab  carehometype carehome, m
22

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0      3,864 |     3,864 
        PN |         0      3,927 |     3,927 
        PS |         0      3,915 |     3,915 
         U |    67,053          0 |    67,053 
-----------+----------------------+----------
     Total |    67,053     11,706 |    78,759 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [3,12]                       units:  1
         unique values:  10                       missing .:  0/78,759

                  mean:   7.48844
              std. dev:    1.0423

           percentiles:        10%       25%       50%       75%       90%
                                 6         7         7         8         9

. 
. *gen categories of household size.
. gen hh_total_cat=.
(78,759 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(1,852 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(76,793 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(114 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(11,706 real changes made)

. 
. 
. *who are people with missing household size
. safecount if hh_total_cat==.
  0

. safecount if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,579    4.927802    .2731888          3          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     65,381    7.544394    .9650706          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |         93    11.01075    .1036952         11         12

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     11,706    7.493337     1.04728          3         12


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. safetab hh_total_cat,m
13

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        3-5 |      1,579        2.00        2.00
       6-10 |     65,381       83.01       85.02
        11+ |         93        0.12       85.14
   carehome |     11,706       14.86      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. safetab hh_total_cat carehome,m 
22

hh_total_c |       carehome
        at |         0          1 |     Total
-----------+----------------------+----------
       3-5 |     1,579          0 |     1,579 
      6-10 |    65,381          0 |    65,381 
       11+ |        93          0 |        93 
  carehome |         0     11,706 |    11,706 
-----------+----------------------+----------
     Total |    67,053     11,706 |    78,759 

. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(93 real changes made, 93 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(3 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |     78,759    2.003355    .1429833   1.098612   2.397895
   hh_linear |     78,759    7.488401     1.04215          3         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(78,282 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(3,089 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(306 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(78,759 real changes made)
(63,008 real changes made)
(63,008 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(78,759 real changes made)
(62,973 real changes made)
(62,973 missing values generated)
variable cancer was str7 now str10
(78,759 real changes made)
(62,922 real changes made)
(62,922 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(78,759 real changes made)
(63,210 real changes made)
(63,210 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(78,759 real changes made)
(63,012 real changes made)
(63,012 missing values generated)
variable chronic_liver_disease was str7 now str10
(78,759 real changes made)
(63,117 real changes made)
(63,117 missing values generated)
variable other_neuro was str7 now str10
(78,759 real changes made)
(62,936 real changes made)
(62,936 missing values generated)
variable stroke was str7 now str10
(78,759 real changes made)
(62,897 real changes made)
(62,897 missing values generated)
variable dementia was str7 now str10
(78,759 real changes made)
(63,008 real changes made)
(63,008 missing values generated)
variable esrf was str7 now str10
(78,759 real changes made)
(62,959 real changes made)
(62,959 missing values generated)
variable hypertension was str7 now str10
(78,759 real changes made)
(62,976 real changes made)
(62,976 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(78,759 real changes made)
(62,999 real changes made)
(62,999 missing values generated)
variable diabetes was str7 now str10
(78,759 real changes made)
(74,887 real changes made)
(74,887 missing values generated)
variable bmi_date_measured was str7 now str10
(78,759 real changes made)
(3,935 real changes made)
(3,935 missing values generated)
variable bp_sys_date_measured was str7 now str10
(78,759 real changes made)
(3,902 real changes made)
(3,902 missing values generated)
variable bp_dias_date_measured was str7 now str10
(78,759 real changes made)
(3,959 real changes made)
(3,959 missing values generated)
variable creatinine_date was str7 now str10
(78,759 real changes made)
(3,933 real changes made)
(3,933 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(78,759 real changes made)
(3,911 real changes made)
(3,911 missing values generated)
variable hba1c_percentage_date was str7 now str10
(78,759 real changes made)
(3,987 real changes made)
(3,987 missing values generated)
variable smoking_status_date was str7 now str10
(78,759 real changes made)
(63,127 real changes made)
(63,127 missing values generated)
variable insulin was str7 now str10
(78,759 real changes made)
(62,961 real changes made)
(62,961 missing values generated)
variable statin was str7 now str10
(78,759 real changes made)
(62,967 real changes made)
(62,967 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         safetab `newvar', m
  6.         
. }
28

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,008       80.00       80.00
          1 |     15,751       20.00      100.00
------------+-----------------------------------
      Total |     78,759      100.00
24

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,973       79.96       79.96
          1 |     15,786       20.04      100.00
------------+-----------------------------------
      Total |     78,759      100.00
7

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,922       79.89       79.89
          1 |     15,837       20.11      100.00
------------+-----------------------------------
      Total |     78,759      100.00
15

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,210       80.26       80.26
          1 |     15,549       19.74      100.00
------------+-----------------------------------
      Total |     78,759      100.00
15

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,012       80.01       80.01
          1 |     15,747       19.99      100.00
------------+-----------------------------------
      Total |     78,759      100.00
22

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,117       80.14       80.14
          1 |     15,642       19.86      100.00
------------+-----------------------------------
      Total |     78,759      100.00
12

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,936       79.91       79.91
          1 |     15,823       20.09      100.00
------------+-----------------------------------
      Total |     78,759      100.00
7

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,897       79.86       79.86
          1 |     15,862       20.14      100.00
------------+-----------------------------------
      Total |     78,759      100.00
9

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,008       80.00       80.00
          1 |     15,751       20.00      100.00
------------+-----------------------------------
      Total |     78,759      100.00
5

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,959       79.94       79.94
          1 |     15,800       20.06      100.00
------------+-----------------------------------
      Total |     78,759      100.00
13

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,976       79.96       79.96
          1 |     15,783       20.04      100.00
------------+-----------------------------------
      Total |     78,759      100.00
17

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,999       79.99       79.99
          1 |     15,760       20.01      100.00
------------+-----------------------------------
      Total |     78,759      100.00
13

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,935        5.00        5.00
          1 |     74,824       95.00      100.00
------------+-----------------------------------
      Total |     78,759      100.00
21

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,902        4.95        4.95
          1 |     74,857       95.05      100.00
------------+-----------------------------------
      Total |     78,759      100.00
22

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,959        5.03        5.03
          1 |     74,800       94.97      100.00
------------+-----------------------------------
      Total |     78,759      100.00
16

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,933        4.99        4.99
          1 |     74,826       95.01      100.00
------------+-----------------------------------
      Total |     78,759      100.00
24

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,911        4.97        4.97
          1 |     74,848       95.03      100.00
------------+-----------------------------------
      Total |     78,759      100.00
22

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,987        5.06        5.06
          1 |     74,772       94.94      100.00
------------+-----------------------------------
      Total |     78,759      100.00
20

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,127       80.15       80.15
          1 |     15,632       19.85      100.00
------------+-----------------------------------
      Total |     78,759      100.00
8

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,961       79.94       79.94
          1 |     15,798       20.06      100.00
------------+-----------------------------------
      Total |     78,759      100.00
7

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,967       79.95       79.95
          1 |     15,792       20.05      100.00
------------+-----------------------------------
      Total |     78,759      100.00
15

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,072       69.92       69.92
          1 |     23,687       30.08      100.00
------------+-----------------------------------
      Total |     78,759      100.00
5

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,106       69.97       69.97
          1 |     23,653       30.03      100.00
------------+-----------------------------------
      Total |     78,759      100.00
15

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,115       69.98       69.98
          1 |     23,644       30.02      100.00
------------+-----------------------------------
      Total |     78,759      100.00
13

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,146       70.02       70.02
          1 |     23,613       29.98      100.00
------------+-----------------------------------
      Total |     78,759      100.00
25

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,221       70.11       70.11
          1 |     23,538       29.89      100.00
------------+-----------------------------------
      Total |     78,759      100.00
15

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,125       69.99       69.99
          1 |     23,634       30.01      100.00
------------+-----------------------------------
      Total |     78,759      100.00
19

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,141       70.01       70.01
          1 |     23,618       29.99      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(6,704 real changes made, 6,704 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(3,935 missing values generated)

. gen bmi_age = age - bmi_time
(3,935 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(3,325 real changes made, 3,325 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(10,029 real changes made, 10,029 to missing)

. replace bmi_measured = . if bmi == . 
(13,964 real changes made, 13,964 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(78,759 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 1929 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 7723 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 10641 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 13562 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 13843 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 17097 changes made)

. replace bmicat = .u if bmi>=.
(13,964 real changes made, 13,964 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(76830 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(13,964 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(480 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(827 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(1,058 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(933 real changes made)

. replace bmicat_sa = 7 if bmi==.
(13,964 real changes made)

. 
. safetab bmicat_sa
0

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,929        2.45        2.45
          2 |      7,243        9.20       11.65
          3 |     10,294       13.07       24.72
          4 |     13,331       16.93       41.64
          5 |     13,968       17.74       59.38
          6 |     18,030       22.89       82.27
          7 |     13,964       17.73      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(62866 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(75,666 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(1,616 real changes made)

. replace smoke = 3  if smoking_status == "S"
(9,493 real changes made)

. replace smoke = .u if smoking_status == "M"
(1,566 real changes made, 1,566 to missing)

. replace smoke = .u if smoking_status == "" 
(62,991 real changes made, 62,991 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(64557 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(64,669 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(1,278 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(277 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 63114 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(63,210 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(28,223 real changes made)

. safetab immunosuppressed
0

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,536       64.17       64.17
          1 |     28,223       35.83      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50–300 (30–250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(89 real changes made, 89 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(78,759 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(93 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(74,707 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(7,761 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(7761 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1616 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(7,761 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(276 real changes made, 276 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(4,209 missing values generated)

. 
. gen min=.
(78,759 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(38,106 real changes made)

. replace min = SCr_adj/0.9 if male==1
(36,444 real changes made)

. replace min = min^-0.329  if male==0
(38,106 real changes made)

. replace min = min^-0.411  if male==1
(36,444 real changes made)

. replace min = 1 if min<1
(20,650 real changes made)

. 
. gen max=.
(78,759 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(38,106 real changes made)

. replace max=SCr_adj/0.9 if male==1
(36,444 real changes made)

. replace max=max^-1.209
(74,550 real changes made)

. replace max=1 if max>1
(58,109 real changes made)

. 
. gen egfr=min*max*141
(4,209 missing values generated)

. replace egfr=egfr*(0.993^age)
(74,550 real changes made)

. replace egfr=egfr*1.018 if male==0
(38,106 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(4209 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. safetab egfr_cat
0

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |        929        1.25        1.25
Stage 3 egfr 30-6 |     73,621       98.75      100.00
------------------+-----------------------------------
            Total |     74,550      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(929 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |     77,830       98.82       98.82
   eGFR <60 |        929        1.18      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(501 real changes made, 501 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,740 real changes made, 1,740 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     74,271    5.045912    1.954833   .0000628   14.40442
hba1c_mmol~l |     73,108    41.02913    18.79259   .0026451   121.7093

. gen     hba1c_pct = hba1c_percentage 
(4,488 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(73,108 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(78,443 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(76,341 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(15,627 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(1,599 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(59,115 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    59,115          0          0          0 |    59,115 
         1 |         0      2,418          0          0 |     2,418 
         2 |         0          0     15,627          0 |    15,627 
         3 |         0          0          0      1,599 |     1,599 
-----------+--------------------------------------------+----------
     Total |    59,115      2,418     15,627      1,599 |    78,759 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(76,373 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(15,782 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(60,591 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(28,740 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(14,075 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(4,989 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(6,130 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(3,230 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(316 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     50,019       63.51       63.51
  >=6.5-7.4 |     14,075       17.87       81.38
  >=7.5-7.9 |      4,989        6.33       87.71
    >=8-8.9 |      6,130        7.78       95.50
        >=9 |      3,230        4.10       99.60
    Unknown |        316        0.40      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(14,665 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(14,349 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     64,094       81.38       81.38
          1 |     14,349       18.22       99.60
          . |        316        0.40      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(19,644 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(1,979 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(432 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(12,715 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(2,854 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(65 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     59,115       75.06       75.06
  T1DM, controlled |      1,979        2.51       77.57
T1DM, uncontrolled |        432        0.55       78.12
  T2DM, controlled |     12,715       16.14       94.26
T2DM, uncontrolled |      2,854        3.62       97.89
Diabetes, no HbA1c |         65        0.08       97.97
                 . |      1,599        2.03      100.00
-------------------+-----------------------------------
             Total |     78,759      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,651       80.43       80.43
          1 |      1,570        9.98       90.41
          2 |      1,509        9.59      100.00
------------+-----------------------------------
      Total |     15,730      100.00

. replace asthma=0 if asthma==.
(63,029 real changes made)

. replace asthma=1 if asthma==2
(1,509 real changes made)

. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     75,680       96.09       96.09
          1 |      3,079        3.91      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(15,751 real changes made)
(15,786 real changes made)
(15,837 real changes made)
(15,549 real changes made)
(15,747 real changes made)
(15,642 real changes made)
(15,823 real changes made)
(15,862 real changes made)
(15,751 real changes made)
(15,800 real changes made)
(15,783 real changes made)
(3,079 real changes made)
(15,760 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |     78,759    2.439975    1.402421          0         10

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(6,213 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      5,199           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     15,696           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     22,439           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     18,548           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     16,877    4.500326    .7541168          4         10


. safetab comorbidity_cat,m
16

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,199        6.60        6.60
          1 |     15,696       19.93       26.53
          2 |     22,439       28.49       55.02
          3 |     18,548       23.55       78.57
          4 |     16,877       21.43      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. safetab combination_bp_meds
0

**TABLE OF combination_bp_meds REDACTED DUE TO SMALL N**


. replace combination_bp_meds=0 if combination_bp_meds<0 
(526 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(16,364 real changes made)

. safetab combination_bp_meds
0

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,698       15.67       15.67
          1 |     19,897       84.33      100.00
------------+-----------------------------------
      Total |     23,595      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(23,987 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |     78,759     2.46396    2.300799          0         12

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(10,293 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,432       88.16       88.16
          1 |      9,327       11.84      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(10,390 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,454       88.19       88.19
          1 |      9,305       11.81      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(10,288 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,386       88.10       88.10
          1 |      9,373       11.90      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(2,471 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,308       96.89       96.89
          1 |      2,451        3.11      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(7,168 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     71,104       90.28       90.28
          1 |      7,655        9.72      100.00
------------+-----------------------------------
      Total |     78,759      100.00
(9,639 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,653       87.17       87.17
          1 |     10,106       12.83      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         safetab `i'
  4. }
0

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,432       88.16       88.16
          1 |      9,327       11.84      100.00
------------+-----------------------------------
      Total |     78,759      100.00
0

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,454       88.19       88.19
          1 |      9,305       11.81      100.00
------------+-----------------------------------
      Total |     78,759      100.00
0

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,386       88.10       88.10
          1 |      9,373       11.90      100.00
------------+-----------------------------------
      Total |     78,759      100.00
0

    outcome |
onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,308       96.89       96.89
          1 |      2,451        3.11      100.00
------------+-----------------------------------
      Total |     78,759      100.00
0

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     71,104       90.28       90.28
          1 |      7,655        9.72      100.00
------------+-----------------------------------
      Total |     78,759      100.00
0

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,653       87.17       87.17
          1 |     10,106       12.83      100.00
------------+-----------------------------------
      Total |     78,759      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_sys_dat~d  perm_immun~f  diabetes_t~e  carehometype
primary_c~se  bp_dias_da~e  temp_immun~e  diabetes_e~s  bmi_time
primary_c~re  bp_dias_da~d  temp_immun~f  diabetes_e~r  bmi_age
suspected_~e  ~l_date_date  died_ons_c..  index         cancer_cat
ae_date       hba1c~l_date  d~nfirmedc~y  onsconfirm..  temp1
icu_date      hba1c_perc..  died_ons_s~y  onssuspect~e  temp2
cpnsd~h_date  crea~te_date  died_ons_c~g  dereg_date    SCr_adj
ethni~6_date  crea~ne_date  ethnicity     ae_censor_~e  min
ethni~y_date  smoki~e_date  has_consul~y  icu_censor~e  max
bmi_measured  smoki~s_date  hba1c_per~ge  cpnsd~r_date  diabcat
bp_sys_dat~e  perm_immun~e  creatinine    onsconfirm..

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. safecount
  78,759

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. safecount
  78,759

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. safecount 
  78,759

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. /****************************************************************
> *  Create outcome specific datasets for the whole population  *
> *****************************************************************
> 
> 
> foreach i of global outcomes {
>         use ./output/analysis_dataset.dta, clear
>         drop if `i'_date <= indexdate 
>         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
>         save ./output/analysis_dataset_STSET_`i'.dta, replace
> }       
> 
> 
>         
> * Close log file 
> log close
> */
. 
end of do-file
