-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:  12 Jan 2021, 17:36:33

. 
. clear

. import delimited ./output/input.csv
(80 vars, 10,000 obs)

. 
. global outcomes "tested positivetest hes onscoviddeath ons_noncoviddeath onsd
> eath"

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(2,170 observations deleted)

. safecount
  7,830

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(5 observations deleted)

. safecount
  7,825

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(3,964 missing values generated)

. replace male = 0 if sex == "F"
(3,964 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male
0

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      3,964       50.66       50.66
       Male |      3,861       49.34      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. safecount
  7,825

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(7,825 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 7825 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. safetab imd, m
4

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      5,444       69.57       69.57
               4 |      1,579       20.18       89.75
 5 most deprived |        802       10.25      100.00
-----------------+-----------------------------------
           Total |      7,825      100.00

. 
. drop if imd==.u
(0 observations deleted)

. safecount
  7,825

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(7,512 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(7,498 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(7,499 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(6,579 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         d `var_date'
  3.         safetab `var'_date
  4.         confirm string variable `var'_date
  5.         rename `var'_date `var'_dstr
  6.         gen `var'_date = date(`var'_dstr, "YMD")
  7.         drop `var'_dstr
  8.         format `var'_date %td 
  9. 
. }

Contains data
  obs:         7,825                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
tested_date     str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF tested_date REDACTED DUE TO SMALL N**

(6,275 missing values generated)

Contains data
  obs:         7,825                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
positivetest_~e str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF positivetest_date REDACTED DUE TO SMALL N**

(6,278 missing values generated)

Contains data
  obs:         7,825                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
hes_date        str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

   hes_date |      Freq.     Percent        Cum.
------------+-----------------------------------
 2020-09-02 |         13        0.67        0.67
 2020-09-03 |         20        1.03        1.69
 2020-09-04 |         12        0.62        2.31
 2020-09-05 |         23        1.18        3.49
 2020-09-06 |         15        0.77        4.26
 2020-09-07 |         13        0.67        4.92
 2020-09-08 |         14        0.72        5.64
 2020-09-09 |         17        0.87        6.51
 2020-09-10 |          9        0.46        6.97
 2020-09-11 |          9        0.46        7.44
 2020-09-12 |         10        0.51        7.95
 2020-09-13 |         15        0.77        8.72
 2020-09-14 |         12        0.62        9.33
 2020-09-15 |         12        0.62        9.95
 2020-09-16 |         12        0.62       10.56
 2020-09-17 |         15        0.77       11.33
 2020-09-18 |         18        0.92       12.26
 2020-09-19 |         16        0.82       13.08
 2020-09-20 |         18        0.92       14.00
 2020-09-21 |         15        0.77       14.77
 2020-09-22 |         14        0.72       15.49
 2020-09-23 |          8        0.41       15.90
 2020-09-24 |         20        1.03       16.92
 2020-09-25 |         18        0.92       17.85
 2020-09-26 |         11        0.56       18.41
 2020-09-27 |         12        0.62       19.03
 2020-09-28 |         17        0.87       19.90
 2020-09-29 |          8        0.41       20.31
 2020-09-30 |         13        0.67       20.97
 2020-10-01 |         18        0.92       21.90
 2020-10-02 |          8        0.41       22.31
 2020-10-03 |         21        1.08       23.38
 2020-10-04 |         15        0.77       24.15
 2020-10-05 |         15        0.77       24.92
 2020-10-06 |         15        0.77       25.69
 2020-10-07 |         14        0.72       26.41
 2020-10-08 |         13        0.67       27.08
 2020-10-09 |         13        0.67       27.74
 2020-10-10 |         11        0.56       28.31
 2020-10-11 |         12        0.62       28.92
 2020-10-12 |         14        0.72       29.64
 2020-10-13 |         20        1.03       30.67
 2020-10-14 |          9        0.46       31.13
 2020-10-15 |         15        0.77       31.90
 2020-10-16 |         18        0.92       32.82
 2020-10-17 |          9        0.46       33.28
 2020-10-18 |         19        0.97       34.26
 2020-10-19 |         12        0.62       34.87
 2020-10-20 |         19        0.97       35.85
 2020-10-21 |         16        0.82       36.67
 2020-10-22 |         14        0.72       37.38
 2020-10-23 |         12        0.62       38.00
 2020-10-24 |          8        0.41       38.41
 2020-10-25 |         24        1.23       39.64
 2020-10-26 |         18        0.92       40.56
 2020-10-27 |         20        1.03       41.59
 2020-10-28 |         14        0.72       42.31
 2020-10-29 |          8        0.41       42.72
 2020-10-30 |         18        0.92       43.64
 2020-10-31 |         13        0.67       44.31
 2020-11-01 |         16        0.82       45.13
 2020-11-02 |          8        0.41       45.54
 2020-11-03 |          8        0.41       45.95
 2020-11-04 |          8        0.41       46.36
 2020-11-05 |         18        0.92       47.28
 2020-11-06 |         11        0.56       47.85
 2020-11-07 |         12        0.62       48.46
 2020-11-08 |         18        0.92       49.38
 2020-11-09 |         16        0.82       50.21
 2020-11-10 |         19        0.97       51.18
 2020-11-11 |         20        1.03       52.21
 2020-11-12 |         17        0.87       53.08
 2020-11-13 |         12        0.62       53.69
 2020-11-14 |         14        0.72       54.41
 2020-11-15 |         16        0.82       55.23
 2020-11-16 |         13        0.67       55.90
 2020-11-17 |         17        0.87       56.77
 2020-11-18 |         14        0.72       57.49
 2020-11-19 |         16        0.82       58.31
 2020-11-20 |         11        0.56       58.87
 2020-11-21 |         14        0.72       59.59
 2020-11-22 |         18        0.92       60.51
 2020-11-23 |         10        0.51       61.03
 2020-11-24 |         16        0.82       61.85
 2020-11-25 |         20        1.03       62.87
 2020-11-26 |         18        0.92       63.79
 2020-11-27 |         15        0.77       64.56
 2020-11-28 |         13        0.67       65.23
 2020-11-29 |         17        0.87       66.10
 2020-11-30 |         23        1.18       67.28
 2020-12-01 |         18        0.92       68.21
 2020-12-02 |         18        0.92       69.13
 2020-12-03 |         13        0.67       69.79
 2020-12-04 |         12        0.62       70.41
 2020-12-05 |         12        0.62       71.03
 2020-12-06 |         14        0.72       71.74
 2020-12-07 |         20        1.03       72.77
 2020-12-08 |         25        1.28       74.05
 2020-12-09 |         14        0.72       74.77
 2020-12-10 |         22        1.13       75.90
 2020-12-11 |         16        0.82       76.72
 2020-12-12 |          7        0.36       77.08
 2020-12-13 |         17        0.87       77.95
 2020-12-14 |         13        0.67       78.62
 2020-12-15 |         15        0.77       79.38
 2020-12-16 |         13        0.67       80.05
 2020-12-17 |         10        0.51       80.56
 2020-12-18 |         18        0.92       81.49
 2020-12-19 |         18        0.92       82.41
 2020-12-20 |         18        0.92       83.33
 2020-12-21 |         13        0.67       84.00
 2020-12-22 |          9        0.46       84.46
 2020-12-23 |         13        0.67       85.13
 2020-12-24 |         15        0.77       85.90
 2020-12-25 |         10        0.51       86.41
 2020-12-26 |         10        0.51       86.92
 2020-12-27 |         10        0.51       87.44
 2020-12-28 |         18        0.92       88.36
 2020-12-29 |         12        0.62       88.97
 2020-12-30 |         20        1.03       90.00
 2020-12-31 |         15        0.77       90.77
 2021-01-01 |         14        0.72       91.49
 2021-01-02 |         18        0.92       92.41
 2021-01-03 |         16        0.82       93.23
 2021-01-04 |         13        0.67       93.90
 2021-01-05 |         12        0.62       94.51
 2021-01-06 |         15        0.77       95.28
 2021-01-07 |         15        0.77       96.05
 2021-01-08 |         13        0.67       96.72
 2021-01-09 |         14        0.72       97.44
 2021-01-10 |         14        0.72       98.15
 2021-01-11 |         18        0.92       99.08
 2021-01-12 |         18        0.92      100.00
------------+-----------------------------------
      Total |      1,950      100.00
(5,875 missing values generated)

Contains data
  obs:         7,825                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onscoviddeath~e str10   %10s                  
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF onscoviddeath_date REDACTED DUE TO SMALL N**

(7,512 missing values generated)

Contains data
  obs:         7,825                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
ons_noncovidd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF ons_noncoviddeath_date REDACTED DUE TO SMALL N**

(6,579 missing values generated)

Contains data
  obs:         7,825                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str7    %9s                   
confirmed_date  str10   %10s                  
primary_care~se str10   %10s                  
primary_care~re str10   %10s                  
suspected_date  str10   %10s                  
ae_date         str10   %10s                  
icu_date        str10   %10s                  
cpnsdeath_date  str10   %10s                  
onsdeath_date   str10   %10s                  
ethnicity_16_~e int     %8.0g                 
ethnicity_date  int     %8.0g                 
bmi_date_meas~d str7    %9s                   
bp_sys_date_m~d str7    %9s                   
bp_dias_date_~d str7    %9s                   
hba1c_mmol_pe~e str7    %9s                   
hba1c_percen~te str7    %9s                   
creatinine_date str7    %9s                   
smoking_statu~e str7    %9s                   
chronic_respi~e str7    %9s                   
chronic_cardi~e str7    %9s                   
type1_diabetes  str7    %9s                   
type2_diabetes  str7    %9s                   
unknown_diabe~s str7    %9s                   
cancer          str7    %9s                   
permanent_imm~y str7    %9s                   
temporary_imm~y str7    %9s                   
chronic_liver~e str7    %9s                   
other_neuro     str7    %9s                   
stroke          str7    %9s                   
dementia        str7    %9s                   
esrf            str7    %9s                   
hypertension    str7    %9s                   
ra_sle_psoria~s str7    %9s                   
insulin         str7    %9s                   
statin          str7    %9s                   
any_resp_supp~g byte    %8.0g                 
basic_resp_su~g byte    %8.0g                 
advanced_resp~g byte    %8.0g                 
covid_admissi~i str4    %9s                   covid_admission_primary_diagnosis
died_ons_covi~y byte    %8.0g                 
died_ons_conf~y byte    %8.0g                 
died_ons_susp~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
rural_urban     str5    %9s                   
stp             str5    %9s                   
region          str24   %24s                  
ethnicity_16    byte    %8.0g                 
ethnicity       byte    %8.0g                 
care_home_type  str2    %9s                   
hh_id           int     %8.0g                 
hh_size         byte    %8.0g                 
is_prison       byte    %8.0g                 
gp_consult_co~t byte    %8.0g                 
has_consultat~y byte    %8.0g                 
bmi             float   %9.0g                 
bp_sys          float   %9.0g                 
bp_dias         float   %9.0g                 
hba1c_mmol_pe~l float   %9.0g                 
hba1c_percen~ge float   %9.0g                 
creatinine      float   %9.0g                 
smoking_status  str1    %9s                   
asthma          byte    %8.0g                 
diabetes_type   str10   %10s                  
diabetes_exet~s str10   %10s                  
diabetes_exeter str7    %9s                   
ace_inhibitors  byte    %8.0g                 
alpha_blockers  byte    %8.0g                 
arbs            byte    %8.0g                 
betablockers    byte    %8.0g                 
calcium_chann~s byte    %8.0g                 
combination_b~s byte    %8.0g                 
spironolactone  byte    %8.0g                 
thiazide_diur~s byte    %8.0g                 
patient_id      long    %12.0g                
male            float   %9.0g      male       
imd             float   %16.0g     imd        
age1            float   %9.0g                 
age2            float   %9.0g                 
age3            float   %9.0g                 
index           str10   %10s                  
indexdate       float   %d                    
onsconfirmedd~e str10   %10s                  
onssuspectedd~e str10   %10s                  
tested_date     float   %td                   
positivetest_~e float   %td                   
hes_date        float   %td                   
onscoviddeath~e float   %td                   
ons_noncovidd~e float   %td                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
0

**TABLE OF onsdeath_date REDACTED DUE TO SMALL N**

(6,266 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(7,825 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 safetab `i'
  5. }
(1,550 real changes made)
0

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,275       80.19       80.19
          1 |      1,550       19.81      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(1,547 real changes made)
0

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,278       80.23       80.23
          1 |      1,547       19.77      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(1,950 real changes made)
0

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,875       75.08       75.08
          1 |      1,950       24.92      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(313 real changes made)
0

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,512       96.00       96.00
          1 |        313        4.00      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(1,246 real changes made)
0

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,579       84.08       84.08
          1 |      1,246       15.92      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(1,559 real changes made)
0

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,266       80.08       80.08
          1 |      1,559       19.92      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("09/11/2020")

. gen positivetest_censor_date = d("09/11/2020")

. gen ae_censor_date = d("09/11/2020")

. gen hes_censor_date = d("09/11/2020")

. gen icu_censor_date = d("18/08/2020")

. gen cpnsdeath_censor_date  = d("09/11/2020")

. gen onsdeath_censor_date = d("09/11/2020")

. gen onscoviddeath_censor_date = d("09/11/2020")

. gen ons_noncoviddeath_censor_date = d("09/11/2020")

. gen onsconfirmeddeath_censor_date=d("09/11/2020")

. 
. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |      7,825   09nov2020           0  09nov2020  09nov2020
posit~r_date |      7,825   09nov2020           0  09nov2020  09nov2020
ae_censor_~e |      7,825   09nov2020           0  09nov2020  09nov2020
hes_censor~e |      7,825   09nov2020           0  09nov2020  09nov2020
icu_censor~e |      7,825   18aug2020           0  18aug2020  18aug2020
-------------+---------------------------------------------------------
cpnsd~r_date |      7,825   09nov2020           0  09nov2020  09nov2020
onsdeath_c~e |      7,825   09nov2020           0  09nov2020  09nov2020
onscovidde.. |      7,825   09nov2020           0  09nov2020  09nov2020
ons_n~r_date |      7,825   09nov2020           0  09nov2020  09nov2020
onsconfirm.. |      7,825   09nov2020           0  09nov2020  09nov2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. safetab ethnicity, m
10

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      1,163       14.86       14.86
                 Mixed |      1,163       14.86       29.73
Asian or Asian British |      1,195       15.27       45.00
                 Black |      1,159       14.81       59.81
                 Other |      1,153       14.73       74.54
                     . |      1,992       25.46      100.00
-----------------------+-----------------------------------
                 Total |      7,825      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(6,662 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,195 real changes made)

.  replace eth5=3 if ethnicity==4
(1,159 real changes made)

.  replace eth5=4 if ethnicity==2
(1,163 real changes made)

.  replace eth5=5 if ethnicity==5
(1,153 real changes made)

.  replace eth5=6 if ethnicity==.
(1,992 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. safetab eth5, m
5

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      1,163       14.86       14.86
South Asian |      1,195       15.27       30.13
      Black |      1,159       14.81       44.95
      Mixed |      1,163       14.86       59.81
      Other |      1,153       14.73       74.54
    Unknown |      1,992       25.46      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(1,966 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. safetab ethnicity_16,m
13

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |        407        5.20        5.20
            Irish |        386        4.93       10.13
      Other White |        373        4.77       14.90
White + Caribbean |        360        4.60       19.50
  White + African |        344        4.40       23.90
    White + Asian |        376        4.81       28.70
      Other mixed |        383        4.89       33.60
           Indian |        373        4.77       38.36
        Pakistani |        346        4.42       42.79
      Bangladeshi |        375        4.79       47.58
      Other Asian |        365        4.66       52.24
        Caribbean |        352        4.50       56.74
          African |        333        4.26       61.00
      Other Black |        359        4.59       65.58
          Chinese |        373        4.77       70.35
            Other |        354        4.52       74.88
          Unknown |      1,966       25.12      100.00
------------------+-----------------------------------
            Total |      7,825      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 1463 changes made)

. recode eth16 8 = 4
(eth16: 373 changes made)

. recode eth16 9 = 5
(eth16: 346 changes made)

. recode eth16 10 = 6
(eth16: 375 changes made)

. recode eth16 11= 7
(eth16: 365 changes made)

. recode eth16 12 = 8
(eth16: 352 changes made)

. recode eth16 13 = 9
(eth16: 333 changes made)

. recode eth16 14 = 10
(eth16: 359 changes made)

. recode eth16 15 = 11
(eth16: 373 changes made)

. recode eth16 99 = 12
(eth16: 1463 changes made)

. recode eth16 16 = 13
(eth16: 354 changes made)

. recode eth16 17 = 14
(eth16: 1966 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. safetab eth16,m
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        407        5.20        5.20
      Irish |        386        4.93       10.13
Other White |        373        4.77       14.90
     Indian |        373        4.77       19.67
  Pakistani |        346        4.42       24.09
Bangladeshi |        375        4.79       28.88
Other Asian |        365        4.66       33.55
  Caribbean |        352        4.50       38.04
    African |        333        4.26       42.30
Other Black |        359        4.59       46.89
    Chinese |        373        4.77       51.65
  All mixed |      1,463       18.70       70.35
      Other |        354        4.52       74.88
    Unknown |      1,966       25.12      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. safetab eth16 eth5, m
11

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |        57         68         72         58 |       407 
      Irish |        53         70         66         57 |       386 
Other White |        62         52         51         61 |       373 
     Indian |        58         56         50         66 |       373 
  Pakistani |        45         64         46         47 |       346 
Bangladeshi |        63         57         50         59 |       375 
Other Asian |        56         60         58         52 |       365 
  Caribbean |        49         48         60         40 |       352 
    African |        43         46         45         60 |       333 
Other Black |        51         53         56         51 |       359 
    Chinese |        62         64         40         51 |       373 
  All mixed |       211        223        220        210 |     1,463 
      Other |        52         49         57         55 |       354 
    Unknown |       301        285        288        296 |     1,966 
------------+--------------------------------------------+----------
      Total |     1,163      1,195      1,159      1,163 |     7,825 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |        52        100 |       407 
      Irish |        57         83 |       386 
Other White |        51         96 |       373 
     Indian |        58         85 |       373 
  Pakistani |        61         83 |       346 
Bangladeshi |        51         95 |       375 
Other Asian |        54         85 |       365 
  Caribbean |        60         95 |       352 
    African |        51         88 |       333 
Other Black |        44        104 |       359 
    Chinese |        60         96 |       373 
  All mixed |       227        372 |     1,463 
      Other |        52         89 |       354 
    Unknown |       275        521 |     1,966 
------------+----------------------+----------
      Total |     1,153      1,992 |     7,825 

. bysort eth5: safetab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         57        4.90        4.90
      Irish |         53        4.56        9.46
Other White |         62        5.33       14.79
     Indian |         58        4.99       19.78
  Pakistani |         45        3.87       23.65
Bangladeshi |         63        5.42       29.06
Other Asian |         56        4.82       33.88
  Caribbean |         49        4.21       38.09
    African |         43        3.70       41.79
Other Black |         51        4.39       46.17
    Chinese |         62        5.33       51.50
  All mixed |        211       18.14       69.65
      Other |         52        4.47       74.12
    Unknown |        301       25.88      100.00
------------+-----------------------------------
      Total |      1,163      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         68        5.69        5.69
      Irish |         70        5.86       11.55
Other White |         52        4.35       15.90
     Indian |         56        4.69       20.59
  Pakistani |         64        5.36       25.94
Bangladeshi |         57        4.77       30.71
Other Asian |         60        5.02       35.73
  Caribbean |         48        4.02       39.75
    African |         46        3.85       43.60
Other Black |         53        4.44       48.03
    Chinese |         64        5.36       53.39
  All mixed |        223       18.66       72.05
      Other |         49        4.10       76.15
    Unknown |        285       23.85      100.00
------------+-----------------------------------
      Total |      1,195      100.00

-------------------------------------------------------------------------------
-> eth5 = Black
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         72        6.21        6.21
      Irish |         66        5.69       11.91
Other White |         51        4.40       16.31
     Indian |         50        4.31       20.62
  Pakistani |         46        3.97       24.59
Bangladeshi |         50        4.31       28.90
Other Asian |         58        5.00       33.91
  Caribbean |         60        5.18       39.09
    African |         45        3.88       42.97
Other Black |         56        4.83       47.80
    Chinese |         40        3.45       51.25
  All mixed |        220       18.98       70.23
      Other |         57        4.92       75.15
    Unknown |        288       24.85      100.00
------------+-----------------------------------
      Total |      1,159      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         58        4.99        4.99
      Irish |         57        4.90        9.89
Other White |         61        5.25       15.13
     Indian |         66        5.67       20.81
  Pakistani |         47        4.04       24.85
Bangladeshi |         59        5.07       29.92
Other Asian |         52        4.47       34.39
  Caribbean |         40        3.44       37.83
    African |         60        5.16       42.99
Other Black |         51        4.39       47.38
    Chinese |         51        4.39       51.76
  All mixed |        210       18.06       69.82
      Other |         55        4.73       74.55
    Unknown |        296       25.45      100.00
------------+-----------------------------------
      Total |      1,163      100.00

-------------------------------------------------------------------------------
-> eth5 = Other
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |         52        4.51        4.51
      Irish |         57        4.94        9.45
Other White |         51        4.42       13.88
     Indian |         58        5.03       18.91
  Pakistani |         61        5.29       24.20
Bangladeshi |         51        4.42       28.62
Other Asian |         54        4.68       33.30
  Caribbean |         60        5.20       38.51
    African |         51        4.42       42.93
Other Black |         44        3.82       46.75
    Chinese |         60        5.20       51.95
  All mixed |        227       19.69       71.64
      Other |         52        4.51       76.15
    Unknown |        275       23.85      100.00
------------+-----------------------------------
      Total |      1,153      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown
6

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        100        5.02        5.02
      Irish |         83        4.17        9.19
Other White |         96        4.82       14.01
     Indian |         85        4.27       18.27
  Pakistani |         83        4.17       22.44
Bangladeshi |         95        4.77       27.21
Other Asian |         85        4.27       31.48
  Caribbean |         95        4.77       36.24
    African |         88        4.42       40.66
Other Black |        104        5.22       45.88
    Chinese |         96        4.82       50.70
  All mixed |        372       18.67       69.38
      Other |         89        4.47       73.85
    Unknown |        521       26.15      100.00
------------+-----------------------------------
      Total |      1,992      100.00

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(7,815 missing values generated)

. replace stp = sum(stp)
(7,824 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(7825 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(1,133 real changes made)

. safetab  carehometype carehome, m
22

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0        360 |       360 
        PN |         0        400 |       400 
        PS |         0        373 |       373 
         U |     6,692          0 |     6,692 
-----------+----------------------+----------
     Total |     6,692      1,133 |     7,825 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [3,11]                       units:  1
         unique values:  9                        missing .:  0/7,825

            tabulation:  Freq.  Value
                             1  3
                            10  4
                           172  5
                         1,145  6
                         2,679  7
                         2,557  8
                         1,075  9
                           174  10
                            12  11

. 
. *gen categories of household size.
. gen hh_total_cat=.
(7,825 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(183 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(7,630 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(12 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(1,133 real changes made)

. 
. 
. *who are people with missing household size
. safecount if hh_total_cat==.
  0

. safecount if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |        164    4.939024     .264346          3          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      6,519    7.538886    .9837505          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |          9          11           0         11         11

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,133    7.479259    1.046938          4         11


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. safetab hh_total_cat,m
13

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        3-5 |        164        2.10        2.10
       6-10 |      6,519       83.31       85.41
        11+ |          9        0.12       85.52
   carehome |      1,133       14.48      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. safetab hh_total_cat carehome,m 
22

hh_total_c |       carehome
        at |         0          1 |     Total
-----------+----------------------+----------
       3-5 |       164          0 |       164 
      6-10 |     6,519          0 |     6,519 
       11+ |         9          0 |         9 
  carehome |         0      1,133 |     1,133 
-----------+----------------------+----------
     Total |     6,692      1,133 |     7,825 

. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(9 real changes made, 9 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(0 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |      7,825    2.001919    .1448059   1.098612   2.397895
   hh_linear |      7,825    7.479744    1.057706          3         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(7,778 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(322 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(30 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(7,825 real changes made)
(6,260 real changes made)
(6,260 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(7,825 real changes made)
(6,284 real changes made)
(6,284 missing values generated)
variable cancer was str7 now str10
(7,825 real changes made)
(6,246 real changes made)
(6,246 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(7,825 real changes made)
(6,292 real changes made)
(6,292 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(7,825 real changes made)
(6,290 real changes made)
(6,290 missing values generated)
variable chronic_liver_disease was str7 now str10
(7,825 real changes made)
(6,259 real changes made)
(6,259 missing values generated)
variable other_neuro was str7 now str10
(7,825 real changes made)
(6,262 real changes made)
(6,262 missing values generated)
variable stroke was str7 now str10
(7,825 real changes made)
(6,252 real changes made)
(6,252 missing values generated)
variable dementia was str7 now str10
(7,825 real changes made)
(6,227 real changes made)
(6,227 missing values generated)
variable esrf was str7 now str10
(7,825 real changes made)
(6,260 real changes made)
(6,260 missing values generated)
variable hypertension was str7 now str10
(7,825 real changes made)
(6,238 real changes made)
(6,238 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(7,825 real changes made)
(6,277 real changes made)
(6,277 missing values generated)
variable diabetes was str7 now str10
(7,825 real changes made)
(7,426 real changes made)
(7,426 missing values generated)
variable bmi_date_measured was str7 now str10
(7,825 real changes made)
(370 real changes made)
(370 missing values generated)
variable bp_sys_date_measured was str7 now str10
(7,825 real changes made)
(382 real changes made)
(382 missing values generated)
variable bp_dias_date_measured was str7 now str10
(7,825 real changes made)
(404 real changes made)
(404 missing values generated)
variable creatinine_date was str7 now str10
(7,825 real changes made)
(392 real changes made)
(392 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(7,825 real changes made)
(386 real changes made)
(386 missing values generated)
variable hba1c_percentage_date was str7 now str10
(7,825 real changes made)
(397 real changes made)
(397 missing values generated)
variable smoking_status_date was str7 now str10
(7,825 real changes made)
(6,282 real changes made)
(6,282 missing values generated)
variable insulin was str7 now str10
(7,825 real changes made)
(6,259 real changes made)
(6,259 missing values generated)
variable statin was str7 now str10
(7,825 real changes made)
(6,239 real changes made)
(6,239 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         safetab `newvar', m
  6.         
. }
28

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,260       80.00       80.00
          1 |      1,565       20.00      100.00
------------+-----------------------------------
      Total |      7,825      100.00
24

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,284       80.31       80.31
          1 |      1,541       19.69      100.00
------------+-----------------------------------
      Total |      7,825      100.00
7

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,246       79.82       79.82
          1 |      1,579       20.18      100.00
------------+-----------------------------------
      Total |      7,825      100.00
15

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,292       80.41       80.41
          1 |      1,533       19.59      100.00
------------+-----------------------------------
      Total |      7,825      100.00
15

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,290       80.38       80.38
          1 |      1,535       19.62      100.00
------------+-----------------------------------
      Total |      7,825      100.00
22

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,259       79.99       79.99
          1 |      1,566       20.01      100.00
------------+-----------------------------------
      Total |      7,825      100.00
12

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,262       80.03       80.03
          1 |      1,563       19.97      100.00
------------+-----------------------------------
      Total |      7,825      100.00
7

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,252       79.90       79.90
          1 |      1,573       20.10      100.00
------------+-----------------------------------
      Total |      7,825      100.00
9

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,227       79.58       79.58
          1 |      1,598       20.42      100.00
------------+-----------------------------------
      Total |      7,825      100.00
5

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,260       80.00       80.00
          1 |      1,565       20.00      100.00
------------+-----------------------------------
      Total |      7,825      100.00
13

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,238       79.72       79.72
          1 |      1,587       20.28      100.00
------------+-----------------------------------
      Total |      7,825      100.00
17

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,277       80.22       80.22
          1 |      1,548       19.78      100.00
------------+-----------------------------------
      Total |      7,825      100.00
13

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        370        4.73        4.73
          1 |      7,455       95.27      100.00
------------+-----------------------------------
      Total |      7,825      100.00
21

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        382        4.88        4.88
          1 |      7,443       95.12      100.00
------------+-----------------------------------
      Total |      7,825      100.00
22

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        404        5.16        5.16
          1 |      7,421       94.84      100.00
------------+-----------------------------------
      Total |      7,825      100.00
16

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        392        5.01        5.01
          1 |      7,433       94.99      100.00
------------+-----------------------------------
      Total |      7,825      100.00
24

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        386        4.93        4.93
          1 |      7,439       95.07      100.00
------------+-----------------------------------
      Total |      7,825      100.00
22

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        397        5.07        5.07
          1 |      7,428       94.93      100.00
------------+-----------------------------------
      Total |      7,825      100.00
20

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,282       80.28       80.28
          1 |      1,543       19.72      100.00
------------+-----------------------------------
      Total |      7,825      100.00
8

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,259       79.99       79.99
          1 |      1,566       20.01      100.00
------------+-----------------------------------
      Total |      7,825      100.00
7

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,239       79.73       79.73
          1 |      1,586       20.27      100.00
------------+-----------------------------------
      Total |      7,825      100.00
15

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,504       70.34       70.34
          1 |      2,321       29.66      100.00
------------+-----------------------------------
      Total |      7,825      100.00
5

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,463       69.81       69.81
          1 |      2,362       30.19      100.00
------------+-----------------------------------
      Total |      7,825      100.00
15

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,445       69.58       69.58
          1 |      2,380       30.42      100.00
------------+-----------------------------------
      Total |      7,825      100.00
13

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,485       70.10       70.10
          1 |      2,340       29.90      100.00
------------+-----------------------------------
      Total |      7,825      100.00
25

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,455       69.71       69.71
          1 |      2,370       30.29      100.00
------------+-----------------------------------
      Total |      7,825      100.00
15

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,475       69.97       69.97
          1 |      2,350       30.03      100.00
------------+-----------------------------------
      Total |      7,825      100.00
19

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,471       69.92       69.92
          1 |      2,354       30.08      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(646 real changes made, 646 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(370 missing values generated)

. gen bmi_age = age - bmi_time
(370 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(334 real changes made, 334 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(980 real changes made, 980 to missing)

. replace bmi_measured = . if bmi == . 
(1,350 real changes made, 1,350 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(7,825 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 196 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 796 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 1092 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 1294 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 1359 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 1738 changes made)

. replace bmicat = .u if bmi>=.
(1,350 real changes made, 1,350 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(7629 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(1,350 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(49 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(79 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(96 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(101 real changes made)

. replace bmicat_sa = 7 if bmi==.
(1,350 real changes made)

. 
. safetab bmicat_sa
0

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        196        2.50        2.50
          2 |        747        9.55       12.05
          3 |      1,062       13.57       25.62
          4 |      1,277       16.32       41.94
          5 |      1,354       17.30       59.25
          6 |      1,839       23.50       82.75
          7 |      1,350       17.25      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(6279 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(7,507 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(140 real changes made)

. replace smoke = 3  if smoking_status == "S"
(963 real changes made)

. replace smoke = .u if smoking_status == "M"
(161 real changes made, 161 to missing)

. replace smoke = .u if smoking_status == "" 
(6,243 real changes made, 6,243 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(6404 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(6,426 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(132 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(38 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 6256 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(6,292 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(2,778 real changes made)

. safetab immunosuppressed
0

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,047       64.50       64.50
          1 |      2,778       35.50      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50–300 (30–250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(6 real changes made, 6 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(7,825 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(11 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(7,410 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(778 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(778 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 148 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(778 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(23 real changes made, 23 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(415 missing values generated)

. 
. gen min=.
(7,825 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(3,749 real changes made)

. replace min = SCr_adj/0.9 if male==1
(3,661 real changes made)

. replace min = min^-0.329  if male==0
(3,749 real changes made)

. replace min = min^-0.411  if male==1
(3,661 real changes made)

. replace min = 1 if min<1
(1,960 real changes made)

. 
. gen max=.
(7,825 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(3,749 real changes made)

. replace max=SCr_adj/0.9 if male==1
(3,661 real changes made)

. replace max=max^-1.209
(7,410 real changes made)

. replace max=1 if max>1
(5,865 real changes made)

. 
. gen egfr=min*max*141
(415 missing values generated)

. replace egfr=egfr*(0.993^age)
(7,410 real changes made)

. replace egfr=egfr*1.018 if male==0
(3,749 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(415 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. safetab egfr_cat
0

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |         90        1.21        1.21
Stage 3 egfr 30-6 |      7,320       98.79      100.00
------------------+-----------------------------------
            Total |      7,410      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(90 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |      7,735       98.85       98.85
   eGFR <60 |         90        1.15      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(32 real changes made, 32 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(165 real changes made, 165 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      7,396    5.033554    1.984213   .0094438   12.55544
hba1c_mmol~l |      7,274    41.13833    18.51268   .0492191   110.7383

. gen     hba1c_pct = hba1c_percentage 
(429 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(7,274 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(7,790 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(7,598 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,609 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(139 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(5,850 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |     5,850          0          0          0 |     5,850 
         1 |         0        227          0          0 |       227 
         2 |         0          0      1,609          0 |     1,609 
         3 |         0          0          0        139 |       139 
-----------+--------------------------------------------+----------
     Total |     5,850        227      1,609        139 |     7,825 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(7,582 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,586 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(5,996 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(2,865 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(1,406 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(487 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(631 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(306 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(35 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      4,960       63.39       63.39
  >=6.5-7.4 |      1,406       17.97       81.35
  >=7.5-7.9 |        487        6.22       87.58
    >=8-8.9 |        631        8.06       95.64
        >=9 |        306        3.91       99.55
    Unknown |         35        0.45      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(1,459 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(1,424 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,366       81.35       81.35
          1 |      1,424       18.20       99.55
          . |         35        0.45      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(1,975 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(192 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(35 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(1,301 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(298 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(10 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |      5,850       74.76       74.76
  T1DM, controlled |        192        2.45       77.21
T1DM, uncontrolled |         35        0.45       77.66
  T2DM, controlled |      1,301       16.63       94.29
T2DM, uncontrolled |        298        3.81       98.10
Diabetes, no HbA1c |         10        0.13       98.22
                 . |        139        1.78      100.00
-------------------+-----------------------------------
             Total |      7,825      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,240       80.21       80.21
          1 |        142        9.18       89.39
          2 |        164       10.61      100.00
------------+-----------------------------------
      Total |      1,546      100.00

. replace asthma=0 if asthma==.
(6,279 real changes made)

. replace asthma=1 if asthma==2
(164 real changes made)

. safetab asthma
0

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,519       96.09       96.09
          1 |        306        3.91      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(1,565 real changes made)
(1,541 real changes made)
(1,579 real changes made)
(1,533 real changes made)
(1,535 real changes made)
(1,566 real changes made)
(1,563 real changes made)
(1,573 real changes made)
(1,598 real changes made)
(1,565 real changes made)
(1,587 real changes made)
(306 real changes made)
(1,548 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |      7,825    2.435655    1.391705          0          8

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(581 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |        533           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,534           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      2,215           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,856           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      1,687    4.461766    .7278904          4          8


. safetab comorbidity_cat,m
16

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        533        6.81        6.81
          1 |      1,534       19.60       26.42
          2 |      2,215       28.31       54.72
          3 |      1,856       23.72       78.44
          4 |      1,687       21.56      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. safetab combination_bp_meds
0

**TABLE OF combination_bp_meds REDACTED DUE TO SMALL N**


. replace combination_bp_meds=0 if combination_bp_meds<0 
(43 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(1,618 real changes made)

. safetab combination_bp_meds
0

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        373       15.90       15.90
          1 |      1,973       84.10      100.00
------------+-----------------------------------
      Total |      2,346      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(2,392 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |      7,825    2.434633    2.294544          0         10

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(1,539 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,814       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(1,536 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,814       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(972 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,847       87.50       87.50
          1 |        978       12.50      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(310 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,822       99.96       99.96
          1 |          3        0.04      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(1,235 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,814       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,825      100.00
(1,545 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,811       99.82       99.82
          1 |         14        0.18      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         safetab `i'
  4. }
0

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,814       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,825      100.00
0

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,814       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,825      100.00
0

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,847       87.50       87.50
          1 |        978       12.50      100.00
------------+-----------------------------------
      Total |      7,825      100.00
0

**TABLE OF onscoviddeath REDACTED DUE TO SMALL N**

0

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,814       99.86       99.86
          1 |         11        0.14      100.00
------------+-----------------------------------
      Total |      7,825      100.00
0

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,811       99.82       99.82
          1 |         14        0.18      100.00
------------+-----------------------------------
      Total |      7,825      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_sys_dat~d  perm_immun~f  diabetes_t~e  carehometype
primary_c~se  bp_dias_da~e  temp_immun~e  diabetes_e~s  bmi_time
primary_c~re  bp_dias_da~d  temp_immun~f  diabetes_e~r  bmi_age
suspected_~e  ~l_date_date  died_ons_c..  index         cancer_cat
ae_date       hba1c~l_date  d~nfirmedc~y  onsconfirm..  temp1
icu_date      hba1c_perc..  died_ons_s~y  onssuspect~e  temp2
cpnsd~h_date  crea~te_date  died_ons_c~g  dereg_date    SCr_adj
ethni~6_date  crea~ne_date  ethnicity     ae_censor_~e  min
ethni~y_date  smoki~e_date  has_consul~y  icu_censor~e  max
bmi_measured  smoki~s_date  hba1c_per~ge  cpnsd~r_date  diabcat
bp_sys_dat~e  perm_immun~e  creatinine    onsconfirm..

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. safecount
  7,825

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. safecount
  7,825

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. safecount 
  7,825

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. /****************************************************************
> *  Create outcome specific datasets for the whole population  *
> *****************************************************************
> 
> 
> foreach i of global outcomes {
>         use ./output/analysis_dataset.dta, clear
>         drop if `i'_date <= indexdate 
>         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
>         save ./output/analysis_dataset_STSET_`i'.dta, replace
> }       
> 
> 
>         
> * Close log file 
> log close
> */
. 
end of do-file
