-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04a_eth_an_multivariable_eth16.log
  log type:  text
 opened on:   6 Jan 2021, 12:14:32

. 
. cap file close tablecontent

. file open tablecontent using ./output/table2_eth16.txt, write text replace
(note: file ./output/table2_eth16.txt not found)

. file write tablecontent ("Table 2: Association between ethnicity in 16 catego
> ries and COVID-19 outcomes - No care homes") _n

. file write tablecontent _tab ("Denominator") _tab ("Event") _tab ("Total pers
> on-weeks") _tab ("Rate per 1,000") _tab ("Crude") _tab _tab ("Age/Sex Adjuste
> d") _tab _tab ("Age/Sex/IMD Adjusted") _tab _tab      ("plus co-morbidities")
>  _tab _tab       ("plus hh siz")  _tab _tab  _n

. file write tablecontent _tab _tab _tab _tab _tab   ("HR") _tab ("95% CI") _ta
> b ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% C
> I") _tab ("HR") _tab ("95% CI") _tab _tab _n

. 
. 
. 
. foreach i of global outcomes {
  2. use ./output/analysis_dataset_STSET_`i'.dta, clear
  3. drop if carehome==1
  4. safetab ethnicity_16 `i', missing row
  5. } //end outcomes
(1,191 observations deleted)

**TABLE OF ethnicity_16 tested REDACTED DUE TO SMALL N**

(1,191 observations deleted)

**TABLE OF ethnicity_16 positivetest REDACTED DUE TO SMALL N**

(1,191 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |  outcome
                  |    icu
Eth 16 categories |         0 |     Total
------------------+-----------+----------
          British |       316 |       316 
                  |    100.00 |    100.00 
------------------+-----------+----------
            Irish |       311 |       311 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Other White |       309 |       309 
                  |    100.00 |    100.00 
------------------+-----------+----------
White + Caribbean |       277 |       277 
                  |    100.00 |    100.00 
------------------+-----------+----------
  White + African |       310 |       310 
                  |    100.00 |    100.00 
------------------+-----------+----------
    White + Asian |       312 |       312 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Other mixed |       278 |       278 
                  |    100.00 |    100.00 
------------------+-----------+----------
           Indian |       334 |       334 
                  |    100.00 |    100.00 
------------------+-----------+----------
        Pakistani |       310 |       310 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Bangladeshi |       327 |       327 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Other Asian |       322 |       322 
                  |    100.00 |    100.00 
------------------+-----------+----------
        Caribbean |       288 |       288 
                  |    100.00 |    100.00 
------------------+-----------+----------
          African |       332 |       332 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Other Black |       331 |       331 
                  |    100.00 |    100.00 
------------------+-----------+----------
          Chinese |       297 |       297 
                  |    100.00 |    100.00 
------------------+-----------+----------
            Other |       275 |       275 
                  |    100.00 |    100.00 
------------------+-----------+----------
          Unknown |     1,664 |     1,664 
                  |    100.00 |    100.00 
------------------+-----------+----------
            Total |     6,593 |     6,593 
                  |    100.00 |    100.00 
(1,191 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |      outcome hes
Eth 16 categories |         0          1 |     Total
------------------+----------------------+----------
          British |       277         39 |       316 
                  |     87.66      12.34 |    100.00 
------------------+----------------------+----------
            Irish |       271         40 |       311 
                  |     87.14      12.86 |    100.00 
------------------+----------------------+----------
      Other White |       259         50 |       309 
                  |     83.82      16.18 |    100.00 
------------------+----------------------+----------
White + Caribbean |       246         31 |       277 
                  |     88.81      11.19 |    100.00 
------------------+----------------------+----------
  White + African |       267         43 |       310 
                  |     86.13      13.87 |    100.00 
------------------+----------------------+----------
    White + Asian |       270         42 |       312 
                  |     86.54      13.46 |    100.00 
------------------+----------------------+----------
      Other mixed |       228         50 |       278 
                  |     82.01      17.99 |    100.00 
------------------+----------------------+----------
           Indian |       292         42 |       334 
                  |     87.43      12.57 |    100.00 
------------------+----------------------+----------
        Pakistani |       273         37 |       310 
                  |     88.06      11.94 |    100.00 
------------------+----------------------+----------
      Bangladeshi |       281         46 |       327 
                  |     85.93      14.07 |    100.00 
------------------+----------------------+----------
      Other Asian |       280         42 |       322 
                  |     86.96      13.04 |    100.00 
------------------+----------------------+----------
        Caribbean |       251         37 |       288 
                  |     87.15      12.85 |    100.00 
------------------+----------------------+----------
          African |       283         49 |       332 
                  |     85.24      14.76 |    100.00 
------------------+----------------------+----------
      Other Black |       285         46 |       331 
                  |     86.10      13.90 |    100.00 
------------------+----------------------+----------
          Chinese |       247         50 |       297 
                  |     83.16      16.84 |    100.00 
------------------+----------------------+----------
            Other |       240         35 |       275 
                  |     87.27      12.73 |    100.00 
------------------+----------------------+----------
          Unknown |     1,427        237 |     1,664 
                  |     85.76      14.24 |    100.00 
------------------+----------------------+----------
            Total |     5,677        916 |     6,593 
                  |     86.11      13.89 |    100.00 
(1,191 observations deleted)

**TABLE OF ethnicity_16 onscoviddeath REDACTED DUE TO SMALL N**

(1,191 observations deleted)

**TABLE OF ethnicity_16 ons_noncoviddeath REDACTED DUE TO SMALL N**

(1,191 observations deleted)

**TABLE OF ethnicity_16 onsdeath REDACTED DUE TO SMALL N**


. 
. foreach i of global outcomes {
  2.         di "`i'"
  3.         
. * Open Stata dataset
. use ./output/analysis_dataset_STSET_`i'.dta, clear
  4. drop if carehome==1
  5. 
. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.ethnicity_16, strata(stp) nolog
  6. estimates save ./output/model/crude_`i'_eth16, replace 
  7. eststo model1
  8. parmest, label eform format(estimate p lb ub) saving(./output/model/crude_
> `i'_eth16, replace) idstr(crude_`i'_eth16) 
  9. local hr "`hr' ./output/model/crude_`i'_eth16 "
 10. 
. 
. /* Multivariable models */ 
. *Age and gender
. stcox i.ethnicity_16 i.male age1 age2 age3, strata(stp) nolog
 11. estimates save ./output/model/model0_`i'_eth16, replace 
 12. eststo model2
 13. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model0_`i
> '_eth16, replace) idstr(model0_`i'_eth16)
 14. local hr "`hr' ./output/model/model0_`i'_eth16 "
 15.  
. 
. * Age, Gender, IMD
. 
. stcox i.ethnicity_16 i.male age1 age2 age3 i.imd, strata(stp) nolog
 16. if _rc==0{
 17. estimates
 18. estimates save ./output/model/model1_`i'_eth16, replace 
 19. eststo model3
 20. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model1_`i
> '_eth16, replace) idstr(model1_`i'_eth16) 
 21. local hr "`hr' ./output/model/model1_`i'_eth16 "
 22. }
 23. else di "WARNING MODEL1 DID NOT FIT (OUTCOME `i')"
 24. 
. * Age, Gender, IMD and Comorbidities 
. stcox i.ethnicity_16 i.male age1 age2 age3      i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis, strata(stp) nolog           
 25. if _rc==0{
 26. estimates
 27. estimates save ./output/model/model2_`i'_eth16, replace 
 28. eststo model4
 29. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model2_`i
> '_eth16, replace) idstr(model2_`i'_eth16) 
 30. local hr "`hr' ./output/model/model2_`i'_eth16 "
 31. }
 32. else di "WARNING MODEL2 DID NOT FIT (OUTCOME `i')"
 33. 
.                                                                              
>    
. * Age, Gender, IMD and Comorbidities  and household size 
. stcox i.ethnicity_16 i.male age1 age2 age3      i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis                      ///
>                                                                              
>    i.hh_total_cat, strata(stp) nolog               
 34. estimates save ./output/model/model3_`i'_eth16, replace
 35. eststo model5
 36. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model3_`i
> '_eth16, replace) idstr(model3_`i'_eth16) 
 37. local hr "`hr' ./output/model/model3_`i'_eth16 "
 38. 
. 
. 
. /* Estout================================================================*/ 
. esttab model1 model2 model3 model4 model5 using ./output/estout_table2_eth16.
> txt, b(a2) ci(2) label wide compress eform ///
>         title ("`i'") ///
>         varlabels(`e(labels)') ///
>         stats(N_sub) ///
>         append 
 39. eststo clear
 40. 
.                                                                              
>    
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("`i'") _n
 41. 
. * eth16 labelled columns
. 
. local lab1: label ethnicity_16 1
 42. local lab2: label ethnicity_16 2
 43. local lab3: label ethnicity_16 3
 44. local lab4: label ethnicity_16 4
 45. local lab5: label ethnicity_16 5
 46. local lab6: label ethnicity_16 6
 47. local lab7: label ethnicity_16 7
 48. local lab8: label ethnicity_16 8
 49. local lab9: label ethnicity_16 9
 50. local lab10: label ethnicity_16 10
 51. local lab11: label ethnicity_16 11
 52. local lab12: label ethnicity_16 12
 53. local lab13: label ethnicity_16 13
 54. local lab14: label ethnicity_16 14
 55. local lab15: label ethnicity_16 15
 56. local lab16: label ethnicity_16 16
 57. local lab17: label ethnicity_16 17
 58. 
. /* counts */
.  
. * First row, eth16 = 1 (White British) reference cat
.         qui safecount if ethnicity_16==1
 59.         local denominator = r(N)
 60.         qui safecount if ethnicity_16 == 1 & `i' == 1
 61.         local event = r(N)
 62.     bysort eth16: egen total_follow_up = total(_t)
 63.         qui su total_follow_up if ethnicity_16 == 1
 64.         local person_week = r(mean)/7
 65.         local rate = 1000*(`event'/`person_week')
 66.         
.         file write tablecontent  ("`lab1'") _tab (`denominator') _tab (`event
> ') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab
 67.         file write tablecontent ("1.00") _tab _tab ("1.00") _tab _tab ("1.
> 00")  _tab _tab ("1.00") _tab _tab ("1.00") _n
 68.         
. * Subsequent ethnic groups
. forvalues eth=2/17 {
 69.         qui safecount if ethnicity_16==`eth'
 70.         local denominator = r(N)
 71.         qui safecount if ethnicity_16 == `eth' & `i' == 1
 72.         local event = r(N)
 73.         qui su total_follow_up if ethnicity_16 == `eth'
 74.         local person_week = r(mean)/7
 75.         local rate = 1000*(`event'/`person_week')
 76.         file write tablecontent  ("`lab`eth''") _tab (`denominator') _tab 
> (`event') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab  
 77.         cap estimates use ./output/model/crude_`i'_eth16 
 78.          cap lincom `eth'.ethnicity_16, eform
 79.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 80.         cap estimates clear
 81.         cap estimates use ./output/model/model0_`i'_eth16 
 82.          cap lincom `eth'.ethnicity_16, eform
 83.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 84.         cap estimates clear
 85.         cap estimates use ./output/model/model1_`i'_eth16 
 86.          cap lincom `eth'.ethnicity_16, eform
 87.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 88.         cap estimates clear
 89.         cap estimates use ./output/model/model2_`i'_eth16 
 90.          cap lincom `eth'.ethnicity_16, eform
 91.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 92.         cap estimates clear
 93.         cap estimates use ./output/model/model3_`i'_eth16 
 94.          cap lincom `eth'.ethnicity_16, eform
 95.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _n
 96. }  //end ethnic group
 97. 
. 
. } //end outcomes
tested
(1,191 observations deleted)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(8)       =       21.19
Log likelihood  =   -73.676025                  Prob > chi2      =      0.0067

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   7.56e-10          .        .       .            .           .
Other White  |   1.97e+10   2.79e+10    16.75   0.000     1.23e+09    3.16e+11
White + C..  |   4.89e+10   5.99e+10    20.07   0.000     4.42e+09    5.41e+11
White + A..  |   7.50e-10          .        .       .            .           .
White + A..  |   7.51e-10          .        .       .            .           .
Other mixed  |   2.07e+10   2.93e+10    16.77   0.000     1.29e+09    3.31e+11
     Indian  |   7.51e-10          .        .       .            .           .
  Pakistani  |   4.03e+10   4.94e+10    19.92   0.000     3.65e+09    4.46e+11
Bangladeshi  |   7.56e-10          .        .       .            .           .
Other Asian  |   7.53e-10          .        .       .            .           .
  Caribbean  |   2.14e+10   3.03e+10    16.81   0.000     1.34e+09    3.43e+11
    African  |   1.99e+10          .        .       .            .           .
Other Black  |   3.80e+10   4.65e+10    19.87   0.000     3.44e+09    4.19e+11
    Chinese  |   3.99e+10   4.90e+10    19.90   0.000     3.61e+09    4.42e+11
      Other  |   2.07e-09          .        .       .            .           .
    Unknown  |   3.70e+09   5.24e+09    15.57   0.000     2.31e+08    5.93e+10
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/crude_tested_eth16.ster saved
file ./output/model/crude_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(19)      =       23.97
Log likelihood  =   -72.286135                  Prob > chi2      =      0.1974

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.14e-07   48.52858    -0.00   1.000            0           .
Other White  |   1.98e+10   2.80e+10    16.73   0.000     1.23e+09    3.18e+11
White + C..  |   5.04e+10   6.18e+10    20.08   0.000     4.55e+09    5.58e+11
White + A..  |   1.17e-07   48.38098    -0.00   1.000            0           .
White + A..  |   1.14e-07   48.09306    -0.00   1.000            0           .
Other mixed  |   2.12e+10          .        .       .            .           .
     Indian  |   1.11e-07   45.74814    -0.00   1.000            0           .
  Pakistani  |   3.73e+10   4.57e+10    19.83   0.000     3.36e+09    4.13e+11
Bangladeshi  |   1.14e-07   45.84111    -0.00   1.000            0           .
Other Asian  |   1.09e-07   44.44651    -0.00   1.000            0           .
  Caribbean  |   2.17e+10   3.08e+10    16.78   0.000     1.35e+09    3.50e+11
    African  |   1.96e+10   2.78e+10    16.73   0.000     1.22e+09    3.15e+11
Other Black  |   3.61e+10   4.44e+10    19.78   0.000     3.25e+09    4.02e+11
    Chinese  |   4.12e+10   5.06e+10    19.92   0.000     3.72e+09    4.57e+11
      Other  |   1.13e-07   52.22736    -0.00   1.000            0           .
    Unknown  |   3.66e+09   5.19e+09    15.54   0.000     2.28e+08    5.89e+10
             |
        male |
       Male  |   2.394564   1.446591     1.45   0.148     .7328301    7.824376
        age1 |   1.010828   .0733493     0.15   0.882     .8768212    1.165315
        age2 |   .8944236   .2448045    -0.41   0.684     .5230807    1.529388
        age3 |   1.408056   1.034011     0.47   0.641      .333839    5.938855
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/model0_tested_eth16.ster saved
file ./output/model/model0_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(21)      =       26.45
Log likelihood  =   -71.043639                  Prob > chi2      =      0.1897

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.26e-07   53.37497    -0.00   1.000            0           .
Other White  |   2.13e+10   3.02e+10    16.76   0.000     1.32e+09    3.43e+11
White + C..  |   5.35e+10   6.60e+10    20.03   0.000     4.77e+09    6.00e+11
White + A..  |   1.26e-07   51.91698    -0.00   1.000            0           .
White + A..  |   1.37e-07   56.56939    -0.00   1.000            0           .
Other mixed  |   2.32e+10   3.30e+10    16.79   0.000     1.43e+09    3.77e+11
     Indian  |   1.21e-07   49.71506    -0.00   1.000            0           .
  Pakistani  |   3.92e+10   4.84e+10    19.75   0.000     3.48e+09    4.41e+11
Bangladeshi  |   1.21e-07   48.47032    -0.00   1.000            0           .
Other Asian  |   1.25e-07   50.41701    -0.00   1.000            0           .
  Caribbean  |   2.43e+10          .        .       .            .           .
    African  |   2.11e+10   3.00e+10    16.73   0.000     1.30e+09    3.42e+11
Other Black  |   3.77e+10   4.64e+10    19.78   0.000     3.37e+09    4.21e+11
    Chinese  |   4.34e+10   5.36e+10    19.84   0.000     3.86e+09    4.88e+11
      Other  |   1.16e-07   53.70453    -0.00   1.000            0           .
    Unknown  |   4.01e+09   5.68e+09    15.60   0.000     2.49e+08    6.45e+10
             |
        male |
       Male  |   2.364167    1.42804     1.42   0.154     .7236402    7.723848
        age1 |   1.012343   .0734909     0.17   0.866     .8780816    1.167134
        age2 |   .8907251   .2439621    -0.42   0.673      .520723    1.523634
        age3 |   1.419283    1.04331     0.48   0.634     .3360114    5.994931
             |
         imd |
          4  |   1.029109   .6816647     0.04   0.965      .280957    3.769494
5 most de..  |   2.83e-17   4.66e-09    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(21)      =       26.45
Log likelihood  =   -71.043639                  Prob > chi2      =      0.1897

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.26e-07   53.37497    -0.00   1.000            0           .
Other White  |   2.13e+10   3.02e+10    16.76   0.000     1.32e+09    3.43e+11
White + C..  |   5.35e+10   6.60e+10    20.03   0.000     4.77e+09    6.00e+11
White + A..  |   1.26e-07   51.91698    -0.00   1.000            0           .
White + A..  |   1.37e-07   56.56939    -0.00   1.000            0           .
Other mixed  |   2.32e+10   3.30e+10    16.79   0.000     1.43e+09    3.77e+11
     Indian  |   1.21e-07   49.71506    -0.00   1.000            0           .
  Pakistani  |   3.92e+10   4.84e+10    19.75   0.000     3.48e+09    4.41e+11
Bangladeshi  |   1.21e-07   48.47032    -0.00   1.000            0           .
Other Asian  |   1.25e-07   50.41701    -0.00   1.000            0           .
  Caribbean  |   2.43e+10          .        .       .            .           .
    African  |   2.11e+10   3.00e+10    16.73   0.000     1.30e+09    3.42e+11
Other Black  |   3.77e+10   4.64e+10    19.78   0.000     3.37e+09    4.21e+11
    Chinese  |   4.34e+10   5.36e+10    19.84   0.000     3.86e+09    4.88e+11
      Other  |   1.16e-07   53.70453    -0.00   1.000            0           .
    Unknown  |   4.01e+09   5.68e+09    15.60   0.000     2.49e+08    6.45e+10
             |
        male |
       Male  |   2.364167    1.42804     1.42   0.154     .7236402    7.723848
        age1 |   1.012343   .0734909     0.17   0.866     .8780816    1.167134
        age2 |   .8907251   .2439621    -0.42   0.673      .520723    1.523634
        age3 |   1.419283    1.04331     0.48   0.634     .3360114    5.994931
             |
         imd |
          4  |   1.029109   .6816647     0.04   0.965      .280957    3.769494
5 most de..  |   2.83e-17   4.66e-09    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/model1_tested_eth16.ster saved
file ./output/model/model1_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(35)      =       51.50
Log likelihood  =   -58.518309                  Prob > chi2      =      0.0356

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   7.42e-10          .        .       .            .           .
Other White  |   1.46e+10   2.18e+10    15.66   0.000     7.79e+08    2.72e+11
White + C..  |   5.28e+10   6.90e+10    18.89   0.000     4.08e+09    6.84e+11
White + A..  |   9.47e-10          .        .       .            .           .
White + A..  |   9.80e-10          .        .       .            .           .
Other mixed  |   1.88e+10   2.82e+10    15.80   0.000     1.00e+09    3.54e+11
     Indian  |   8.91e-10          .        .       .            .           .
  Pakistani  |   3.16e+10   4.13e+10    18.48   0.000     2.43e+09    4.10e+11
Bangladeshi  |   8.44e-10          .        .       .            .           .
Other Asian  |   1.04e-09          .        .       .            .           .
  Caribbean  |   1.85e+10          .        .       .            .           .
    African  |   1.59e+10   2.34e+10    15.97   0.000     8.91e+08    2.84e+11
Other Black  |   3.15e+10   4.08e+10    18.64   0.000     2.48e+09    4.00e+11
    Chinese  |   5.17e+10   6.78e+10    18.81   0.000     3.96e+09    6.76e+11
      Other  |   2.41e-09          .        .       .            .           .
    Unknown  |   3.08e+09   4.46e+09    15.07   0.000     1.80e+08    5.27e+10
             |
        male |
       Male  |   2.338229   1.482507     1.34   0.180     .6748385    8.101663
        age1 |    1.01939   .0757053     0.26   0.796     .8813038    1.179112
        age2 |   .8496756   .2425192    -0.57   0.568     .4856221    1.486647
        age3 |   1.635397   1.266627     0.64   0.525     .3583947    7.462513
             |
         imd |
          4  |   .8794053   .6206248    -0.18   0.856     .2205305    3.506789
5 most de..  |   8.15e-20          .        .       .            .           .
             |
   bmicat_sa |
Normal (..)  |   1.59e-10          .        .       .            .           .
Overweig..)  |   1.97e+09          .        .       .            .           .
Obese I ..)  |   8.20e+09   9.55e+09    19.61   0.000     8.37e+08    8.03e+10
Obese II..)  |   2.52e+09   3.68e+09    14.85   0.000     1.45e+08    4.39e+10
Obese II..)  |   5.87e+09   6.87e+09    19.24   0.000     5.94e+08    5.81e+10
    Unknown  |   7.27e+09   8.88e+09    18.60   0.000     6.65e+08    7.96e+10
             |
    hba1ccat |
  >=6.5-7.4  |    .300639   .3283513    -1.10   0.271     .0353494    2.556872
  >=7.5-7.9  |   .8175516   .8894243    -0.19   0.853     .0969355    6.895212
    >=8-8.9  |   5.94e-20          .        .       .            .           .
        >=9  |   1.085132   1.223447     0.07   0.942     .1190647     9.88967
    Unknown  |   7.82e-19          .        .       .            .           .
             |
gp_consult~t |   1.022377   .1284189     0.18   0.860     .7992694    1.307763
             |
smoke_nomiss |
     Former  |   7.53e-20          .        .       .            .           .
    Current  |   4.51e-20          .        .       .            .           .
             |
1.hyperten~n |   .3697137    .395588    -0.93   0.352     .0454039    3.010497
             |
      bp_cat |
High, sta..  |   688660.7   561264.2    16.49   0.000       139402     3402057
    Unknown  |    1273813          .        .       .            .           .
             |
    1.asthma |   8.861438   7.928153     2.44   0.015     1.534444    51.17494
1.~y_disease |   .6358222   .5228866    -0.55   0.582     .1268603    3.186733
1.~c_disease |    .670911   .5470961    -0.49   0.625     .1356908    3.317259
             |
     dm_type |
       T1DM  |   1.36e-19          .        .       .            .           .
       T2DM  |   1.225121   .8388022     0.30   0.767     .3201754    4.687811
 UNKNOWN_DM  |   4.89e-19          .        .       .            .           .
             |
    1.cancer |   .9647933   .6786743    -0.05   0.959     .2430329    3.830042
1.~r_disease |   .7437221   .5991906    -0.37   0.713     .1533302    3.607395
    1.stroke |   1.721721   1.205006     0.78   0.438     .4367367    6.787437
  1.dementia |   1.259452   .8796357     0.33   0.741     .3203903    4.950898
1.other_ne~o |   1.042972   .7157206     0.06   0.951     .2717387     4.00308
             |
      egfr60 |
   eGFR <60  |   2.93e-19          .        .       .            .           .
      1.esrf |   .3085855   .3290638    -1.10   0.270     .0381669    2.494965
1.immunosu~d |   2.406167   1.430561     1.48   0.140     .7503312    7.716114
1.ra_sle_p~s |   1.772356   1.172759     0.86   0.387     .4845241    6.483158
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(35)      =       51.50
Log likelihood  =   -58.518309                  Prob > chi2      =      0.0356

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   7.42e-10          .        .       .            .           .
Other White  |   1.46e+10   2.18e+10    15.66   0.000     7.79e+08    2.72e+11
White + C..  |   5.28e+10   6.90e+10    18.89   0.000     4.08e+09    6.84e+11
White + A..  |   9.47e-10          .        .       .            .           .
White + A..  |   9.80e-10          .        .       .            .           .
Other mixed  |   1.88e+10   2.82e+10    15.80   0.000     1.00e+09    3.54e+11
     Indian  |   8.91e-10          .        .       .            .           .
  Pakistani  |   3.16e+10   4.13e+10    18.48   0.000     2.43e+09    4.10e+11
Bangladeshi  |   8.44e-10          .        .       .            .           .
Other Asian  |   1.04e-09          .        .       .            .           .
  Caribbean  |   1.85e+10          .        .       .            .           .
    African  |   1.59e+10   2.34e+10    15.97   0.000     8.91e+08    2.84e+11
Other Black  |   3.15e+10   4.08e+10    18.64   0.000     2.48e+09    4.00e+11
    Chinese  |   5.17e+10   6.78e+10    18.81   0.000     3.96e+09    6.76e+11
      Other  |   2.41e-09          .        .       .            .           .
    Unknown  |   3.08e+09   4.46e+09    15.07   0.000     1.80e+08    5.27e+10
             |
        male |
       Male  |   2.338229   1.482507     1.34   0.180     .6748385    8.101663
        age1 |    1.01939   .0757053     0.26   0.796     .8813038    1.179112
        age2 |   .8496756   .2425192    -0.57   0.568     .4856221    1.486647
        age3 |   1.635397   1.266627     0.64   0.525     .3583947    7.462513
             |
         imd |
          4  |   .8794053   .6206248    -0.18   0.856     .2205305    3.506789
5 most de..  |   8.15e-20          .        .       .            .           .
             |
   bmicat_sa |
Normal (..)  |   1.59e-10          .        .       .            .           .
Overweig..)  |   1.97e+09          .        .       .            .           .
Obese I ..)  |   8.20e+09   9.55e+09    19.61   0.000     8.37e+08    8.03e+10
Obese II..)  |   2.52e+09   3.68e+09    14.85   0.000     1.45e+08    4.39e+10
Obese II..)  |   5.87e+09   6.87e+09    19.24   0.000     5.94e+08    5.81e+10
    Unknown  |   7.27e+09   8.88e+09    18.60   0.000     6.65e+08    7.96e+10
             |
    hba1ccat |
  >=6.5-7.4  |    .300639   .3283513    -1.10   0.271     .0353494    2.556872
  >=7.5-7.9  |   .8175516   .8894243    -0.19   0.853     .0969355    6.895212
    >=8-8.9  |   5.94e-20          .        .       .            .           .
        >=9  |   1.085132   1.223447     0.07   0.942     .1190647     9.88967
    Unknown  |   7.82e-19          .        .       .            .           .
             |
gp_consult~t |   1.022377   .1284189     0.18   0.860     .7992694    1.307763
             |
smoke_nomiss |
     Former  |   7.53e-20          .        .       .            .           .
    Current  |   4.51e-20          .        .       .            .           .
             |
1.hyperten~n |   .3697137    .395588    -0.93   0.352     .0454039    3.010497
             |
      bp_cat |
High, sta..  |   688660.7   561264.2    16.49   0.000       139402     3402057
    Unknown  |    1273813          .        .       .            .           .
             |
    1.asthma |   8.861438   7.928153     2.44   0.015     1.534444    51.17494
1.~y_disease |   .6358222   .5228866    -0.55   0.582     .1268603    3.186733
1.~c_disease |    .670911   .5470961    -0.49   0.625     .1356908    3.317259
             |
     dm_type |
       T1DM  |   1.36e-19          .        .       .            .           .
       T2DM  |   1.225121   .8388022     0.30   0.767     .3201754    4.687811
 UNKNOWN_DM  |   4.89e-19          .        .       .            .           .
             |
    1.cancer |   .9647933   .6786743    -0.05   0.959     .2430329    3.830042
1.~r_disease |   .7437221   .5991906    -0.37   0.713     .1533302    3.607395
    1.stroke |   1.721721   1.205006     0.78   0.438     .4367367    6.787437
  1.dementia |   1.259452   .8796357     0.33   0.741     .3203903    4.950898
1.other_ne~o |   1.042972   .7157206     0.06   0.951     .2717387     4.00308
             |
      egfr60 |
   eGFR <60  |   2.93e-19          .        .       .            .           .
      1.esrf |   .3085855   .3290638    -1.10   0.270     .0381669    2.494965
1.immunosu~d |   2.406167   1.430561     1.48   0.140     .7503312    7.716114
1.ra_sle_p~s |   1.772356   1.172759     0.86   0.387     .4845241    6.483158
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/model2_tested_eth16.ster saved
file ./output/model/model2_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(35)      =       52.25
Log likelihood  =   -58.147215                  Prob > chi2      =      0.0306

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.07e-09          .        .       .            .           .
Other White  |   1.56e+10   2.33e+10    15.69   0.000     8.31e+08    2.92e+11
White + C..  |   5.49e+10   7.17e+10    18.93   0.000     4.24e+09    7.11e+11
White + A..  |   1.05e-09          .        .       .            .           .
White + A..  |   9.68e-10          .        .       .            .           .
Other mixed  |   2.01e+10   3.02e+10    15.77   0.000     1.05e+09    3.82e+11
     Indian  |   1.00e-09          .        .       .            .           .
  Pakistani  |   3.35e+10   4.38e+10    18.50   0.000     2.57e+09    4.36e+11
Bangladeshi  |   8.85e-10          .        .       .            .           .
Other Asian  |   1.20e-09          .        .       .            .           .
  Caribbean  |   1.92e+10          .        .       .            .           .
    African  |   1.63e+10   2.40e+10    15.97   0.000     9.11e+08    2.93e+11
Other Black  |   3.34e+10   4.34e+10    18.65   0.000     2.62e+09    4.26e+11
    Chinese  |   5.30e+10   6.94e+10    18.86   0.000     4.07e+09    6.90e+11
      Other  |   2.46e-09          .        .       .            .           .
    Unknown  |   3.25e+09   4.71e+09    15.10   0.000     1.89e+08    5.58e+10
             |
        male |
       Male  |   2.298953    1.46039     1.31   0.190     .6619295    7.984515
        age1 |   1.019419   .0756345     0.26   0.795     .8814527     1.17898
        age2 |   .8511729   .2422745    -0.57   0.571     .4872313    1.486964
        age3 |   1.626104   1.254913     0.63   0.529     .3583029    7.379827
             |
         imd |
          4  |   .8933501   .6274461    -0.16   0.872     .2255167     3.53887
5 most de..  |   7.87e-20          .        .       .            .           .
             |
   bmicat_sa |
Normal (..)  |   1.60e-10          .        .       .            .           .
Overweig..)  |   2.07e+09          .        .       .            .           .
Obese I ..)  |   8.32e+09   9.66e+09    19.65   0.000     8.52e+08    8.11e+10
Obese II..)  |   2.60e+09   3.80e+09    14.83   0.000     1.48e+08    4.56e+10
Obese II..)  |   6.08e+09   7.11e+09    19.28   0.000     6.16e+08    6.01e+10
    Unknown  |   7.30e+09   8.89e+09    18.64   0.000     6.70e+08    7.95e+10
             |
    hba1ccat |
  >=6.5-7.4  |   .2983972   .3257467    -1.11   0.268     .0351218    2.535203
  >=7.5-7.9  |    .853473   .9299304    -0.15   0.884     .1008636    7.221796
    >=8-8.9  |   6.00e-20          .        .       .            .           .
        >=9  |   1.082842    1.22251     0.07   0.944     .1184606     9.89821
    Unknown  |   7.83e-19          .        .       .            .           .
             |
gp_consult~t |   1.022042   .1274404     0.17   0.861     .8004439    1.304989
             |
smoke_nomiss |
     Former  |   7.10e-20          .        .       .            .           .
    Current  |   4.32e-20          .        .       .            .           .
             |
1.hyperten~n |   .3679971   .3935407    -0.93   0.350     .0452438    2.993161
             |
      bp_cat |
High, sta..  |   758062.9   619638.7    16.56   0.000     152733.8     3762489
    Unknown  |    1453004          .        .       .            .           .
             |
    1.asthma |   8.571214   7.655841     2.41   0.016      1.48849    49.35587
1.~y_disease |   .6278261   .5160199    -0.57   0.571     .1253787    3.143801
1.~c_disease |   .6693486    .546983    -0.49   0.623     .1349154    3.320803
             |
     dm_type |
       T1DM  |   1.34e-19          .        .       .            .           .
       T2DM  |   1.276725   .8763953     0.36   0.722      .332505     4.90226
 UNKNOWN_DM  |   4.78e-19          .        .       .            .           .
             |
    1.cancer |   .9382843   .6594738    -0.09   0.928     .2366284    3.720507
1.~r_disease |    .782179    .631086    -0.30   0.761     .1608906    3.802609
    1.stroke |   1.711249   1.196036     0.77   0.442     .4348969    6.733487
  1.dementia |   1.265286   .8860424     0.34   0.737     .3207137    4.991833
1.other_ne~o |   1.038566   .7129336     0.06   0.956       .27047    3.987948
             |
      egfr60 |
   eGFR <60  |   2.85e-19          .        .       .            .           .
      1.esrf |   .3022155   .3220139    -1.12   0.261     .0374414     2.43939
1.immunosu~d |   2.392953   1.421609     1.47   0.142     .7468809    7.666853
1.ra_sle_p~s |   1.782955   1.182884     0.87   0.383     .4857568     6.54428
             |
hh_total_cat |
       6-10  |   1.07e+16          .        .       .            .           .
        11+  |   .0181843          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/model3_tested_eth16.ster saved
file ./output/model/model3_tested_eth16.dta saved
(note: file ./output/estout_table2_eth16.txt not found)
(output written to ./output/estout_table2_eth16.txt)
positivetest
(1,191 observations deleted)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(8)       =       17.61
Log likelihood  =   -95.198636                  Prob > chi2      =      0.0244

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   4.57e-20          .        .       .            .           .
Other White  |   4.57e-20          .        .       .            .           .
White + C..  |   3.417886   3.947924     1.06   0.287     .3552661    32.88224
White + A..  |   4.58e-20          .        .       .            .           .
White + A..  |   .9708545   1.373992    -0.02   0.983     .0606038    15.55278
Other mixed  |   1.179754   1.669281     0.12   0.907     .0736872    18.88821
     Indian  |   .9198195   1.302086    -0.06   0.953     .0573788    14.74531
  Pakistani  |   4.56e-20          .        .       .            .           .
Bangladeshi  |   .9738489   1.378172    -0.02   0.985     .0607978    15.59894
Other Asian  |   .9681643   1.370124    -0.02   0.982     .0604432    15.50781
  Caribbean  |   4.58e-20          .        .       .            .           .
    African  |   4.58e-20          .        .       .            .           .
Other Black  |   4.58e-20          .        .       .            .           .
    Chinese  |   1.060647   1.500853     0.04   0.967     .0662355    16.98444
      Other  |   4.56e-20          .        .       .            .           .
    Unknown  |   1.140065   1.232013     0.12   0.903     .1371128    9.479413
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_positivetest_eth16.ster not found)
file ./output/model/crude_positivetest_eth16.ster saved
(note: file ./output/model/crude_positivetest_eth16.dta not found)
file ./output/model/crude_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(20)      =       20.26
Log likelihood  =   -93.871455                  Prob > chi2      =      0.4416

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.87e-16   2.03e-08    -0.00   1.000            0           .
Other White  |   3.77e-16   1.98e-08    -0.00   1.000            0           .
White + C..  |   3.435442   3.969322     1.07   0.285     .3568628    33.07226
White + A..  |   3.90e-16   2.07e-08    -0.00   1.000            0           .
White + A..  |   1.020378   1.445048     0.01   0.989     .0635767     16.3766
Other mixed  |   1.176828   1.665691     0.12   0.908     .0734373    18.85862
     Indian  |   .9307747   1.317792    -0.05   0.960      .058038    14.92714
  Pakistani  |   3.54e-16   1.85e-08    -0.00   1.000            0           .
Bangladeshi  |    .989578   1.400807    -0.01   0.994     .0617339    15.86268
Other Asian  |   .9447028   1.337355    -0.04   0.968     .0589256     15.1456
  Caribbean  |   3.70e-16   2.00e-08    -0.00   1.000            0           .
    African  |   3.86e-16   1.93e-08    -0.00   1.000            0           .
Other Black  |   3.82e-16   1.90e-08    -0.00   1.000            0           .
    Chinese  |   1.111614   1.573607     0.07   0.940     .0693408    17.82048
      Other  |   3.77e-16   2.10e-08    -0.00   1.000            0           .
    Unknown  |   1.165411   1.259455     0.14   0.887     .1401486    9.691013
             |
        male |
       Male  |   1.683638   .8713867     1.01   0.314     .6105191    4.642994
        age1 |   .9943304   .0647994    -0.09   0.930     .8751024    1.129802
        age2 |   1.030815   .2608186     0.12   0.905     .6277811    1.692596
        age3 |   .8395421   .5946419    -0.25   0.805     .2094799    3.364672
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_positivetest_eth16.ster not found)
file ./output/model/model0_positivetest_eth16.ster saved
(note: file ./output/model/model0_positivetest_eth16.dta not found)
file ./output/model/model0_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(22)      =       20.50
Log likelihood  =   -93.750521                  Prob > chi2      =      0.5515

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.38e-16   1.19e-08    -0.00   1.000            0           .
Other White  |   1.37e-16   1.18e-08    -0.00   1.000            0           .
White + C..  |   3.412169   3.943043     1.06   0.288      .354321    32.85974
White + A..  |   1.42e-16   1.24e-08    -0.00   1.000            0           .
White + A..  |   1.001984   1.419402     0.00   0.999     .0623815    16.09407
Other mixed  |    1.14239   1.619237     0.09   0.925     .0710085    18.37884
     Indian  |   .9161778   1.297677    -0.06   0.951     .0570605    14.71039
  Pakistani  |   1.30e-16   1.12e-08    -0.00   1.000            0           .
Bangladeshi  |    .974741   1.380326    -0.02   0.986     .0607445    15.64126
Other Asian  |   .9356074   1.324806    -0.05   0.963     .0583183    15.01006
  Caribbean  |   1.33e-16   1.18e-08    -0.00   1.000            0           .
    African  |   1.40e-16   1.15e-08    -0.00   1.000            0           .
Other Black  |   1.40e-16   1.15e-08    -0.00   1.000            0           .
    Chinese  |   1.095585   1.551587     0.06   0.949     .0682588    17.58462
      Other  |   1.37e-16   1.26e-08    -0.00   1.000            0           .
    Unknown  |   1.148776   1.241988     0.13   0.898      .138028    9.561009
             |
        male |
       Male  |   1.696997   .8785862     1.02   0.307     .6151606    4.681377
        age1 |   .9925687   .0649061    -0.11   0.909     .8731699    1.128294
        age2 |   1.038381   .2634336     0.15   0.882     .6315535    1.707276
        age3 |   .8230719   .5842316    -0.27   0.784     .2047572     3.30854
             |
         imd |
          4  |   .9325689   .6083196    -0.11   0.915     .2596795    3.349069
5 most de..  |   1.443671    1.11636     0.47   0.635      .317141    6.571796
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(22)      =       20.50
Log likelihood  =   -93.750521                  Prob > chi2      =      0.5515

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.38e-16   1.19e-08    -0.00   1.000            0           .
Other White  |   1.37e-16   1.18e-08    -0.00   1.000            0           .
White + C..  |   3.412169   3.943043     1.06   0.288      .354321    32.85974
White + A..  |   1.42e-16   1.24e-08    -0.00   1.000            0           .
White + A..  |   1.001984   1.419402     0.00   0.999     .0623815    16.09407
Other mixed  |    1.14239   1.619237     0.09   0.925     .0710085    18.37884
     Indian  |   .9161778   1.297677    -0.06   0.951     .0570605    14.71039
  Pakistani  |   1.30e-16   1.12e-08    -0.00   1.000            0           .
Bangladeshi  |    .974741   1.380326    -0.02   0.986     .0607445    15.64126
Other Asian  |   .9356074   1.324806    -0.05   0.963     .0583183    15.01006
  Caribbean  |   1.33e-16   1.18e-08    -0.00   1.000            0           .
    African  |   1.40e-16   1.15e-08    -0.00   1.000            0           .
Other Black  |   1.40e-16   1.15e-08    -0.00   1.000            0           .
    Chinese  |   1.095585   1.551587     0.06   0.949     .0682588    17.58462
      Other  |   1.37e-16   1.26e-08    -0.00   1.000            0           .
    Unknown  |   1.148776   1.241988     0.13   0.898      .138028    9.561009
             |
        male |
       Male  |   1.696997   .8785862     1.02   0.307     .6151606    4.681377
        age1 |   .9925687   .0649061    -0.11   0.909     .8731699    1.128294
        age2 |   1.038381   .2634336     0.15   0.882     .6315535    1.707276
        age3 |   .8230719   .5842316    -0.27   0.784     .2047572     3.30854
             |
         imd |
          4  |   .9325689   .6083196    -0.11   0.915     .2596795    3.349069
5 most de..  |   1.443671    1.11636     0.47   0.635      .317141    6.571796
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_positivetest_eth16.ster not found)
file ./output/model/model1_positivetest_eth16.ster saved
(note: file ./output/model/model1_positivetest_eth16.dta not found)
file ./output/model/model1_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(52)      =       56.02
Log likelihood  =   -75.991398                  Prob > chi2      =      0.3264

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.14e-16   8.80e-09    -0.00   1.000            0           .
Other White  |   6.74e-17   9.98e-09    -0.00   1.000            0           .
White + C..  |   5.538473   6.823343     1.39   0.165      .495129    61.95292
White + A..  |   6.14e-17   8.35e-09    -0.00   1.000            0           .
White + A..  |   1.094577   1.617904     0.06   0.951     .0604056    19.83422
Other mixed  |   1.852315    2.75148     0.41   0.678     .1007667    34.04968
     Indian  |   1.177755   1.729252     0.11   0.911     .0662627    20.93346
  Pakistani  |   9.69e-17   1.09e-08    -0.00   1.000            0           .
Bangladeshi  |   1.062489   1.581173     0.04   0.968     .0574891    19.63648
Other Asian  |   1.231956   1.818188     0.14   0.888     .0682882    22.22515
  Caribbean  |   7.38e-17   1.04e-08    -0.00   1.000            0           .
    African  |   8.29e-17   1.00e-08    -0.00   1.000            0           .
Other Black  |   8.53e-17   1.07e-08    -0.00   1.000            0           .
    Chinese  |    1.26729    1.85893     0.16   0.872     .0714969    22.46286
      Other  |   6.67e-17   8.50e-09    -0.00   1.000            0           .
    Unknown  |   1.332786   1.506318     0.25   0.799     .1454557     12.2121
             |
        male |
       Male  |   1.621249   .8697005     0.90   0.368     .5665423    4.639456
        age1 |   .9517407   .0680254    -0.69   0.489      .827331    1.094859
        age2 |   1.180439   .3231206     0.61   0.544     .6903111    2.018563
        age3 |    .595297   .4544039    -0.68   0.497     .1333497    2.657513
             |
         imd |
          4  |    .968286   .6494933    -0.05   0.962     .2600439     3.60546
5 most de..  |   1.909855   1.543918     0.80   0.423     .3916454    9.313393
             |
   bmicat_sa |
Normal (..)  |   2.09e+09   3.05e+09    14.71   0.000     1.20e+08    3.64e+10
Overweig..)  |   1.12e+09   1.66e+09    14.13   0.000     6.23e+07    2.02e+10
Obese I ..)  |   6.37e+09   7.42e+09    19.39   0.000     6.51e+08    6.24e+10
Obese II..)  |   1.86e+09   2.41e+09    16.50   0.000     1.48e+08    2.35e+10
Obese II..)  |   4.80e+09   5.52e+09    19.39   0.000     5.04e+08    4.57e+10
    Unknown  |   8.92e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .7451674   .5928875    -0.37   0.712     .1566755    3.544106
  >=7.5-7.9  |   2.400847   1.990727     1.06   0.291     .4726802    12.19443
    >=8-8.9  |   1.033949   1.112032     0.03   0.975     .1256075    8.511042
        >=9  |   1.25e-16   1.71e-08    -0.00   1.000            0           .
    Unknown  |    32.4097   41.19658     2.74   0.006      2.68347    391.4293
             |
gp_consult~t |   .9169224   .1070093    -0.74   0.457     .7294461    1.152582
             |
smoke_nomiss |
     Former  |   3.782006    4.27758     1.18   0.240     .4120822    34.71048
    Current  |   .5510162   .5854897    -0.56   0.575     .0686608    4.422013
             |
1.hyperten~n |   1.254482   .7622089     0.37   0.709      .381315    4.127098
             |
      bp_cat |
High, sta..  |    8449207    4964457    27.15   0.000      2671037    2.67e+07
    Unknown  |   4.79e+07          .        .       .            .           .
             |
    1.asthma |   7.55e-17   9.59e-09    -0.00   1.000            0           .
1.~y_disease |   1.938582   1.106869     1.16   0.246     .6331037    5.935992
1.~c_disease |    3.31411    1.76739     2.25   0.025     1.165272    9.425542
             |
     dm_type |
       T1DM  |   8.02e-17   1.50e-08    -0.00   1.000            0           .
       T2DM  |   .8988225   .6043135    -0.16   0.874     .2406455    3.357144
 UNKNOWN_DM  |   7.83e-17   1.21e-08    -0.00   1.000            0           .
             |
    1.cancer |   .4556203   .3633101    -0.99   0.324      .095468    2.174445
1.~r_disease |   1.048987   .7063399     0.07   0.943     .2802916    3.925819
    1.stroke |   .6694801   .5215469    -0.52   0.607     .1454199    3.082134
  1.dementia |   .4664539   .3789745    -0.94   0.348     .0948949    2.292846
1.other_ne~o |   .6596669   .5115167    -0.54   0.592     .1443075    3.015508
             |
      egfr60 |
   eGFR <60  |   4.76e-16   1.12e-07    -0.00   1.000            0           .
      1.esrf |   .5414689   .4238531    -0.78   0.433     .1167527    2.511194
1.immunosu~d |   1.260151   .6792584     0.43   0.668     .4381267    3.624476
1.ra_sle_p~s |   .9601809   .6523471    -0.06   0.952       .25354    3.636298
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(52)      =       56.02
Log likelihood  =   -75.991398                  Prob > chi2      =      0.3264

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.14e-16   8.80e-09    -0.00   1.000            0           .
Other White  |   6.74e-17   9.98e-09    -0.00   1.000            0           .
White + C..  |   5.538473   6.823343     1.39   0.165      .495129    61.95292
White + A..  |   6.14e-17   8.35e-09    -0.00   1.000            0           .
White + A..  |   1.094577   1.617904     0.06   0.951     .0604056    19.83422
Other mixed  |   1.852315    2.75148     0.41   0.678     .1007667    34.04968
     Indian  |   1.177755   1.729252     0.11   0.911     .0662627    20.93346
  Pakistani  |   9.69e-17   1.09e-08    -0.00   1.000            0           .
Bangladeshi  |   1.062489   1.581173     0.04   0.968     .0574891    19.63648
Other Asian  |   1.231956   1.818188     0.14   0.888     .0682882    22.22515
  Caribbean  |   7.38e-17   1.04e-08    -0.00   1.000            0           .
    African  |   8.29e-17   1.00e-08    -0.00   1.000            0           .
Other Black  |   8.53e-17   1.07e-08    -0.00   1.000            0           .
    Chinese  |    1.26729    1.85893     0.16   0.872     .0714969    22.46286
      Other  |   6.67e-17   8.50e-09    -0.00   1.000            0           .
    Unknown  |   1.332786   1.506318     0.25   0.799     .1454557     12.2121
             |
        male |
       Male  |   1.621249   .8697005     0.90   0.368     .5665423    4.639456
        age1 |   .9517407   .0680254    -0.69   0.489      .827331    1.094859
        age2 |   1.180439   .3231206     0.61   0.544     .6903111    2.018563
        age3 |    .595297   .4544039    -0.68   0.497     .1333497    2.657513
             |
         imd |
          4  |    .968286   .6494933    -0.05   0.962     .2600439     3.60546
5 most de..  |   1.909855   1.543918     0.80   0.423     .3916454    9.313393
             |
   bmicat_sa |
Normal (..)  |   2.09e+09   3.05e+09    14.71   0.000     1.20e+08    3.64e+10
Overweig..)  |   1.12e+09   1.66e+09    14.13   0.000     6.23e+07    2.02e+10
Obese I ..)  |   6.37e+09   7.42e+09    19.39   0.000     6.51e+08    6.24e+10
Obese II..)  |   1.86e+09   2.41e+09    16.50   0.000     1.48e+08    2.35e+10
Obese II..)  |   4.80e+09   5.52e+09    19.39   0.000     5.04e+08    4.57e+10
    Unknown  |   8.92e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .7451674   .5928875    -0.37   0.712     .1566755    3.544106
  >=7.5-7.9  |   2.400847   1.990727     1.06   0.291     .4726802    12.19443
    >=8-8.9  |   1.033949   1.112032     0.03   0.975     .1256075    8.511042
        >=9  |   1.25e-16   1.71e-08    -0.00   1.000            0           .
    Unknown  |    32.4097   41.19658     2.74   0.006      2.68347    391.4293
             |
gp_consult~t |   .9169224   .1070093    -0.74   0.457     .7294461    1.152582
             |
smoke_nomiss |
     Former  |   3.782006    4.27758     1.18   0.240     .4120822    34.71048
    Current  |   .5510162   .5854897    -0.56   0.575     .0686608    4.422013
             |
1.hyperten~n |   1.254482   .7622089     0.37   0.709      .381315    4.127098
             |
      bp_cat |
High, sta..  |    8449207    4964457    27.15   0.000      2671037    2.67e+07
    Unknown  |   4.79e+07          .        .       .            .           .
             |
    1.asthma |   7.55e-17   9.59e-09    -0.00   1.000            0           .
1.~y_disease |   1.938582   1.106869     1.16   0.246     .6331037    5.935992
1.~c_disease |    3.31411    1.76739     2.25   0.025     1.165272    9.425542
             |
     dm_type |
       T1DM  |   8.02e-17   1.50e-08    -0.00   1.000            0           .
       T2DM  |   .8988225   .6043135    -0.16   0.874     .2406455    3.357144
 UNKNOWN_DM  |   7.83e-17   1.21e-08    -0.00   1.000            0           .
             |
    1.cancer |   .4556203   .3633101    -0.99   0.324      .095468    2.174445
1.~r_disease |   1.048987   .7063399     0.07   0.943     .2802916    3.925819
    1.stroke |   .6694801   .5215469    -0.52   0.607     .1454199    3.082134
  1.dementia |   .4664539   .3789745    -0.94   0.348     .0948949    2.292846
1.other_ne~o |   .6596669   .5115167    -0.54   0.592     .1443075    3.015508
             |
      egfr60 |
   eGFR <60  |   4.76e-16   1.12e-07    -0.00   1.000            0           .
      1.esrf |   .5414689   .4238531    -0.78   0.433     .1167527    2.511194
1.immunosu~d |   1.260151   .6792584     0.43   0.668     .4381267    3.624476
1.ra_sle_p~s |   .9601809   .6523471    -0.06   0.952       .25354    3.636298
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_positivetest_eth16.ster not found)
file ./output/model/model2_positivetest_eth16.ster saved
(note: file ./output/model/model2_positivetest_eth16.dta not found)
file ./output/model/model2_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(50)      =       56.33
Log likelihood  =   -75.837881                  Prob > chi2      =      0.2501

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.81e-19   4.43e-10    -0.00   1.000            0           .
Other White  |   1.60e-19   4.84e-10    -0.00   1.000            0           .
White + C..  |   5.377111   6.612623     1.37   0.171     .4827973    59.88709
White + A..  |   1.43e-19   4.07e-10    -0.00   1.000            0           .
White + A..  |   1.121834   1.657934     0.08   0.938      .061938     20.3189
Other mixed  |   1.849296   2.745834     0.41   0.679     .1007264    33.95235
     Indian  |   1.183542   1.735345     0.11   0.909     .0668538    20.95277
  Pakistani  |   2.41e-19   5.41e-10    -0.00   1.000            0           .
Bangladeshi  |   1.067597   1.587576     0.04   0.965     .0578926    19.68754
Other Asian  |   1.224207   1.801889     0.14   0.891     .0683891    21.91408
  Caribbean  |   1.84e-19   5.08e-10    -0.00   1.000            0           .
    African  |   1.94e-19   4.86e-10    -0.00   1.000            0           .
Other Black  |   1.99e-19   5.13e-10    -0.00   1.000            0           .
    Chinese  |   1.205083   1.777277     0.13   0.899     .0669346    21.69618
      Other  |   1.56e-19   4.15e-10    -0.00   1.000            0           .
    Unknown  |   1.301137   1.469862     0.23   0.816     .1421482     11.9098
             |
        male |
       Male  |   1.613496   .8680296     0.89   0.374     .5621318    4.631246
        age1 |   .9554211   .0687197    -0.63   0.526     .8297958    1.100065
        age2 |   1.161872   .3200189     0.54   0.586     .6771871    1.993462
        age3 |   .6202888    .476223    -0.62   0.534     .1377492    2.793179
             |
         imd |
          4  |   .9827794   .6606011    -0.03   0.979     .2632076    3.669557
5 most de..  |   1.913026   1.546545     0.80   0.422     .3922701    9.329461
             |
   bmicat_sa |
Normal (..)  |   2.07e+09   3.02e+09    14.69   0.000     1.18e+08    3.62e+10
Overweig..)  |   1.13e+09   1.67e+09    14.12   0.000     6.27e+07    2.05e+10
Obese I ..)  |   6.30e+09   7.33e+09    19.37   0.000     6.42e+08    6.17e+10
Obese II..)  |   1.87e+09   2.42e+09    16.51   0.000     1.48e+08    2.36e+10
Obese II..)  |   4.69e+09   5.40e+09    19.34   0.000     4.91e+08    4.48e+10
    Unknown  |   9.14e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .7331329   .5834093    -0.39   0.696     .1541052    3.487773
  >=7.5-7.9  |   2.336631   1.939527     1.02   0.307     .4592486    11.88865
    >=8-8.9  |   1.046744   1.124958     0.04   0.966     .1273608    8.602903
        >=9  |   3.14e-19   8.70e-10    -0.00   1.000            0           .
    Unknown  |   31.50998   40.05356     2.71   0.007     2.608874    380.5777
             |
gp_consult~t |   .9231442   .1082783    -0.68   0.495     .7335498    1.161741
             |
smoke_nomiss |
     Former  |   3.825177   4.327462     1.19   0.236     .4165608    35.12568
    Current  |     .56377   .5991576    -0.54   0.590     .0702216    4.526193
             |
1.hyperten~n |   1.230001   .7480675     0.34   0.734     .3734375    4.051287
             |
      bp_cat |
High, sta..  |    8275191    4876755    27.03   0.000      2607029    2.63e+07
    Unknown  |   4.57e+07          .        .       .            .           .
             |
    1.asthma |   1.76e-19   4.67e-10    -0.00   1.000            0           .
1.~y_disease |   1.959103   1.121754     1.17   0.240     .6377806    6.017874
1.~c_disease |   3.326905   1.773946     2.25   0.024     1.169956    9.460438
             |
     dm_type |
       T1DM  |   1.94e-19          .        .       .            .           .
       T2DM  |   .8746747   .5906611    -0.20   0.843     .2328288    3.285916
 UNKNOWN_DM  |   1.84e-19          .        .       .            .           .
             |
    1.cancer |   .4639978   .3700469    -0.96   0.336     .0972001    2.214956
1.~r_disease |   1.026268   .6933036     0.04   0.969     .2730388     3.85742
    1.stroke |   .6507467   .5080375    -0.55   0.582     .1408898    3.005692
  1.dementia |   .4740146   .3858871    -0.92   0.359     .0961265    2.337439
1.other_ne~o |   .6619481   .5137659    -0.53   0.595     .1446007    3.030243
             |
      egfr60 |
   eGFR <60  |   1.21e-18          .        .       .            .           .
      1.esrf |   .5569065   .4376003    -0.74   0.456     .1193806     2.59795
1.immunosu~d |   1.265361   .6826725     0.44   0.663     .4395256    3.642878
1.ra_sle_p~s |   .9842329   .6697909    -0.02   0.981     .2593209    3.735581
             |
hh_total_cat |
       6-10  |   .5205739   .5828574    -0.58   0.560     .0580016    4.672239
        11+  |   3.13e-18          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_positivetest_eth16.ster not found)
file ./output/model/model3_positivetest_eth16.ster saved
(note: file ./output/model/model3_positivetest_eth16.dta not found)
file ./output/model/model3_positivetest_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
icu
(1,191 observations deleted)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_icu_eth16.ster not found)
file ./output/model/crude_icu_eth16.ster saved
(note: file ./output/model/crude_icu_eth16.dta not found)
file ./output/model/crude_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_icu_eth16.ster not found)
file ./output/model/model0_icu_eth16.ster saved
(note: file ./output/model/model0_icu_eth16.dta not found)
file ./output/model/model0_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_icu_eth16.ster not found)
file ./output/model/model1_icu_eth16.ster saved
(note: file ./output/model/model1_icu_eth16.dta not found)
file ./output/model/model1_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
   bmicat_sa |
Normal (..)  |          1  (omitted)
Overweig..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    hba1ccat |
  >=6.5-7.4  |          1  (omitted)
  >=7.5-7.9  |          1  (omitted)
    >=8-8.9  |          1  (omitted)
        >=9  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
gp_consult~t |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |          1  (omitted)
             |
1.hyperten~n |          1  (omitted)
             |
      bp_cat |
High, sta..  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    1.asthma |          1  (omitted)
1.~y_disease |          1  (omitted)
1.~c_disease |          1  (omitted)
             |
     dm_type |
       T1DM  |          1  (omitted)
       T2DM  |          1  (omitted)
 UNKNOWN_DM  |          1  (omitted)
             |
    1.cancer |          1  (omitted)
1.~r_disease |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
1.other_ne~o |          1  (omitted)
             |
      egfr60 |
   eGFR <60  |          1  (omitted)
      1.esrf |          1  (omitted)
1.immunosu~d |          1  (omitted)
1.ra_sle_p~s |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
   bmicat_sa |
Normal (..)  |          1  (omitted)
Overweig..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    hba1ccat |
  >=6.5-7.4  |          1  (omitted)
  >=7.5-7.9  |          1  (omitted)
    >=8-8.9  |          1  (omitted)
        >=9  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
gp_consult~t |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |          1  (omitted)
             |
1.hyperten~n |          1  (omitted)
             |
      bp_cat |
High, sta..  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    1.asthma |          1  (omitted)
1.~y_disease |          1  (omitted)
1.~c_disease |          1  (omitted)
             |
     dm_type |
       T1DM  |          1  (omitted)
       T2DM  |          1  (omitted)
 UNKNOWN_DM  |          1  (omitted)
             |
    1.cancer |          1  (omitted)
1.~r_disease |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
1.other_ne~o |          1  (omitted)
             |
      egfr60 |
   eGFR <60  |          1  (omitted)
      1.esrf |          1  (omitted)
1.immunosu~d |          1  (omitted)
1.ra_sle_p~s |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_icu_eth16.ster not found)
file ./output/model/model2_icu_eth16.ster saved
(note: file ./output/model/model2_icu_eth16.dta not found)
file ./output/model/model2_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
   bmicat_sa |
Normal (..)  |          1  (omitted)
Overweig..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    hba1ccat |
  >=6.5-7.4  |          1  (omitted)
  >=7.5-7.9  |          1  (omitted)
    >=8-8.9  |          1  (omitted)
        >=9  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
gp_consult~t |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |          1  (omitted)
             |
1.hyperten~n |          1  (omitted)
             |
      bp_cat |
High, sta..  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    1.asthma |          1  (omitted)
1.~y_disease |          1  (omitted)
1.~c_disease |          1  (omitted)
             |
     dm_type |
       T1DM  |          1  (omitted)
       T2DM  |          1  (omitted)
 UNKNOWN_DM  |          1  (omitted)
             |
    1.cancer |          1  (omitted)
1.~r_disease |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
1.other_ne~o |          1  (omitted)
             |
      egfr60 |
   eGFR <60  |          1  (omitted)
      1.esrf |          1  (omitted)
1.immunosu~d |          1  (omitted)
1.ra_sle_p~s |          1  (omitted)
             |
hh_total_cat |
       6-10  |          1  (omitted)
        11+  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_icu_eth16.ster not found)
file ./output/model/model3_icu_eth16.ster saved
(note: file ./output/model/model3_icu_eth16.dta not found)
file ./output/model/model3_icu_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
hes
(1,191 observations deleted)

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(16)      =       12.37
Log likelihood  =   -5874.4109                  Prob > chi2      =      0.7178

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.046818   .2356408     0.20   0.839     .6733859     1.62734
Other White  |   1.335418   .2854383     1.35   0.176     .8783701    2.030284
White + C..  |   .9074163   .2183745    -0.40   0.686     .5661877    1.454295
White + A..  |   1.126856   .2493256     0.54   0.589     .7303545    1.738615
White + A..  |   1.083335   .2410672     0.36   0.719     .7004073    1.675617
Other mixed  |   1.491399   .3187559     1.87   0.061     .9809955    2.267361
     Indian  |   1.012247   .2253017     0.05   0.956      .654379    1.565825
  Pakistani  |   .9505968   .2182284    -0.22   0.825     .6061584    1.490756
Bangladeshi  |   1.137642   .2477395     0.59   0.554     .7424088    1.743284
Other Asian  |   1.053038   .2342897     0.23   0.816     .6808645    1.628648
  Caribbean  |   1.027211   .2358281     0.12   0.907      .654998     1.61094
    African  |   1.206617   .2589859     0.88   0.382     .7922631     1.83768
Other Black  |   1.125939   .2452172     0.54   0.586     .7347383     1.72543
    Chinese  |   1.396188   .2984268     1.56   0.118     .9183428    2.122673
      Other  |   1.026666   .2391927     0.11   0.910     .6503039    1.620848
    Unknown  |   1.158239   .2002141     0.85   0.395     .8253888    1.625315
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_hes_eth16.ster not found)
file ./output/model/crude_hes_eth16.ster saved
(note: file ./output/model/crude_hes_eth16.dta not found)
file ./output/model/crude_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(20)      =       13.47
Log likelihood  =   -5873.8625                  Prob > chi2      =      0.8563

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.050696   .2365513     0.22   0.826     .6758327    1.633483
Other White  |   1.335765   .2855394     1.35   0.176     .8785632    2.030892
White + C..  |   .9075221   .2184213    -0.40   0.687     .5662276    1.454532
White + A..  |   1.130514   .2502052     0.55   0.579     .7326358    1.744471
White + A..  |   1.084122   .2413411     0.36   0.717     .7007909    1.677134
Other mixed  |    1.49324   .3192001     1.88   0.061     .9821413    2.270311
     Indian  |   1.012851   .2254382     0.06   0.954     .6547669    1.566766
  Pakistani  |   .9461456   .2172695    -0.24   0.809     .6032413    1.483969
Bangladeshi  |   1.134664    .247168     0.58   0.562     .7403665    1.738952
Other Asian  |   1.053802   .2345121     0.24   0.814     .6812921    1.629989
  Caribbean  |   1.031345   .2368152     0.13   0.893     .6575862     1.61754
    African  |   1.210073   .2597654     0.89   0.374     .7944834    1.843055
Other Black  |   1.126009   .2452627     0.54   0.586     .7347448    1.725628
    Chinese  |   1.398246   .2989184     1.57   0.117     .9196298    2.125956
      Other  |   1.030268   .2400889     0.13   0.898     .6525144     1.62671
    Unknown  |   1.160871   .2006996     0.86   0.388     .8272225    1.629093
             |
        male |
       Male  |   1.021258   .0677072     0.32   0.751     .8968147    1.162969
        age1 |   1.005484   .0090756     0.61   0.545     .9878531    1.023431
        age2 |   .9772045   .0322953    -0.70   0.485     .9159133    1.042597
        age3 |   1.058845   .0930583     0.65   0.515     .8912988    1.257887
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_hes_eth16.ster not found)
file ./output/model/model0_hes_eth16.ster saved
(note: file ./output/model/model0_hes_eth16.dta not found)
file ./output/model/model0_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(22)      =       14.45
Log likelihood  =   -5873.3736                  Prob > chi2      =      0.8848

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.053681   .2373463     0.23   0.816     .6775984    1.638499
Other White  |   1.339469   .2863786     1.37   0.172     .8809384    2.036665
White + C..  |   .9084061   .2186416    -0.40   0.690     .5667699    1.455973
White + A..  |   1.137081   .2517454     0.58   0.562     .7367818    1.754867
White + A..  |   1.086697   .2420263     0.37   0.709     .7023139    1.681457
Other mixed  |   1.498669   .3204554     1.89   0.058     .9855895    2.278848
     Indian  |   1.015196   .2260353     0.07   0.946     .6561881    1.570621
  Pakistani  |   .9467203   .2173997    -0.24   0.812     .6036099    1.484865
Bangladeshi  |    1.13773    .247881     0.59   0.554     .7423096    1.743786
Other Asian  |   1.056744   .2352068     0.25   0.804     .6831433    1.634661
  Caribbean  |   1.032664   .2372166     0.14   0.889      .658304    1.619911
    African  |   1.212428    .260325     0.90   0.370     .7959597    1.846803
Other Black  |   1.126737   .2454309     0.55   0.584     .7352075    1.726772
    Chinese  |   1.402407    .299847     1.58   0.114     .9223162    2.132399
      Other  |   1.031159   .2403084     0.13   0.895      .653064    1.628154
    Unknown  |   1.162869   .2010974     0.87   0.383     .8285725     1.63204
             |
        male |
       Male  |   1.020216   .0676473     0.30   0.763     .8958838    1.161804
        age1 |   1.005665   .0090774     0.63   0.531       .98803    1.023615
        age2 |   .9767347   .0322805    -0.71   0.476     .9154716    1.042097
        age3 |   1.059904   .0931544     0.66   0.508     .8921847    1.259152
             |
         imd |
          4  |   .9512846    .079409    -0.60   0.550     .8077109    1.120379
5 most de..  |   .9033245   .1066532    -0.86   0.389     .7167118    1.138526
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(22)      =       14.45
Log likelihood  =   -5873.3736                  Prob > chi2      =      0.8848

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.053681   .2373463     0.23   0.816     .6775984    1.638499
Other White  |   1.339469   .2863786     1.37   0.172     .8809384    2.036665
White + C..  |   .9084061   .2186416    -0.40   0.690     .5667699    1.455973
White + A..  |   1.137081   .2517454     0.58   0.562     .7367818    1.754867
White + A..  |   1.086697   .2420263     0.37   0.709     .7023139    1.681457
Other mixed  |   1.498669   .3204554     1.89   0.058     .9855895    2.278848
     Indian  |   1.015196   .2260353     0.07   0.946     .6561881    1.570621
  Pakistani  |   .9467203   .2173997    -0.24   0.812     .6036099    1.484865
Bangladeshi  |    1.13773    .247881     0.59   0.554     .7423096    1.743786
Other Asian  |   1.056744   .2352068     0.25   0.804     .6831433    1.634661
  Caribbean  |   1.032664   .2372166     0.14   0.889      .658304    1.619911
    African  |   1.212428    .260325     0.90   0.370     .7959597    1.846803
Other Black  |   1.126737   .2454309     0.55   0.584     .7352075    1.726772
    Chinese  |   1.402407    .299847     1.58   0.114     .9223162    2.132399
      Other  |   1.031159   .2403084     0.13   0.895      .653064    1.628154
    Unknown  |   1.162869   .2010974     0.87   0.383     .8285725     1.63204
             |
        male |
       Male  |   1.020216   .0676473     0.30   0.763     .8958838    1.161804
        age1 |   1.005665   .0090774     0.63   0.531       .98803    1.023615
        age2 |   .9767347   .0322805    -0.71   0.476     .9154716    1.042097
        age3 |   1.059904   .0931544     0.66   0.508     .8921847    1.259152
             |
         imd |
          4  |   .9512846    .079409    -0.60   0.550     .8077109    1.120379
5 most de..  |   .9033245   .1066532    -0.86   0.389     .7167118    1.138526
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_hes_eth16.ster not found)
file ./output/model/model1_hes_eth16.ster saved
(note: file ./output/model/model1_hes_eth16.dta not found)
file ./output/model/model1_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(54)      =       63.84
Log likelihood  =    -5848.676                  Prob > chi2      =      0.1689

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.025283   .2316657     0.11   0.912     .6584344    1.596524
Other White  |   1.303298   .2794584     1.24   0.217     .8561024    1.984092
White + C..  |   .8900723   .2147809    -0.48   0.629     .5546566    1.428323
White + A..  |   1.109105   .2460701     0.47   0.641     .7179958     1.71326
White + A..  |   1.060324   .2370525     0.26   0.793     .6841307    1.643382
Other mixed  |   1.443812   .3096666     1.71   0.087     .9483013     2.19824
     Indian  |   .9691156   .2166023    -0.14   0.888     .6253565    1.501839
  Pakistani  |   .9238357   .2127095    -0.34   0.731     .5883136     1.45071
Bangladeshi  |   1.079408   .2361543     0.35   0.727     .7030053    1.657344
Other Asian  |   1.013871   .2263683     0.06   0.951      .654536    1.570477
  Caribbean  |   1.016672   .2341605     0.07   0.943     .6473389    1.596725
    African  |   1.179407   .2540086     0.77   0.444      .773287    1.798816
Other Black  |   1.081656   .2363509     0.36   0.719     .7048464    1.659907
    Chinese  |   1.346156   .2885553     1.39   0.166     .8843743     2.04906
      Other  |   .9884448   .2308185    -0.05   0.960     .6254355    1.562148
    Unknown  |   1.118501   .1939742     0.65   0.518     .7961922    1.571283
             |
        male |
       Male  |   1.016154   .0677466     0.24   0.810     .8916824    1.158001
        age1 |   1.004008   .0093543     0.43   0.668     .9858401     1.02251
        age2 |   .9812381   .0330351    -0.56   0.574     .9185805     1.04817
        age3 |   1.050033   .0936501     0.55   0.584       .88163    1.250604
             |
         imd |
          4  |   .9543452   .0798289    -0.56   0.576      .810036    1.124363
5 most de..  |   .9134013   .1080892    -0.77   0.444     .7243242    1.151835
             |
   bmicat_sa |
Normal (..)  |   1.287341   .3135122     1.04   0.300     .7987233    2.074869
Overweig..)  |   1.222068   .2895061     0.85   0.397      .768152    1.944213
Obese I ..)  |   1.055184   .2488733     0.23   0.820     .6646078    1.675292
Obese II..)  |   1.505868   .3476542     1.77   0.076     .9577961    2.367558
Obese II..)  |   1.173803   .2702533     0.70   0.486     .7475099    1.843205
    Unknown  |   1.171192    .275815     0.67   0.502     .7381942     1.85817
             |
    hba1ccat |
  >=6.5-7.4  |   1.050617   .0921426     0.56   0.573     .8846899    1.247664
  >=7.5-7.9  |   .9996431    .137295    -0.00   0.998     .7637259    1.308436
    >=8-8.9  |   1.049652   .1302643     0.39   0.696     .8230182    1.338695
        >=9  |   .8684311   .1583532    -0.77   0.439     .6074687      1.2415
    Unknown  |   .3768831   .3779961    -0.97   0.331     .0527827    2.691051
             |
gp_consult~t |   .9950743   .0143697    -0.34   0.732     .9673051    1.023641
             |
smoke_nomiss |
     Former  |   .8060614   .2110165    -0.82   0.410     .4825413    1.346486
    Current  |    .981415   .1030203    -0.18   0.858      .798916    1.205603
             |
1.hyperten~n |   1.184425   .0946895     2.12   0.034     1.012646    1.385343
             |
      bp_cat |
High, sta..  |   .6430837    .647563    -0.44   0.661     .0893588    4.628049
    Unknown  |   .7187119    .727092    -0.33   0.744     .0989529    5.220129
             |
    1.asthma |   1.263748   .2007639     1.47   0.141     .9256256    1.725384
1.~y_disease |   1.003877   .0837035     0.05   0.963     .8525251    1.182099
1.~c_disease |   .9691699   .0814403    -0.37   0.709     .8220015    1.142687
             |
     dm_type |
       T1DM  |   1.312858   .2390456     1.49   0.135     .9188205    1.875879
       T2DM  |   1.025622   .0847209     0.31   0.759     .8723174     1.20587
 UNKNOWN_DM  |    1.03413    .236038     0.15   0.883     .6611346    1.617559
             |
    1.cancer |   .9062272   .0777102    -1.15   0.251     .7660293    1.072084
1.~r_disease |   1.000875   .0821707     0.01   0.992     .8521128    1.175608
    1.stroke |   1.110201   .0895665     1.30   0.195      .947829    1.300388
  1.dementia |   .8047652   .0706011    -2.48   0.013     .6776325    .9557496
1.other_ne~o |   1.162767   .0926873     1.89   0.059     .9945834    1.359391
             |
      egfr60 |
   eGFR <60  |   .6878936   .2657854    -0.97   0.333     .3225802    1.466915
      1.esrf |   1.231334   .0967116     2.65   0.008     1.055652    1.436253
1.immunosu~d |   .9952485   .0689161    -0.07   0.945     .8689403    1.139917
1.ra_sle_p~s |   1.157148   .0926989     1.82   0.068     .9890073    1.353875
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(54)      =       63.84
Log likelihood  =    -5848.676                  Prob > chi2      =      0.1689

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.025283   .2316657     0.11   0.912     .6584344    1.596524
Other White  |   1.303298   .2794584     1.24   0.217     .8561024    1.984092
White + C..  |   .8900723   .2147809    -0.48   0.629     .5546566    1.428323
White + A..  |   1.109105   .2460701     0.47   0.641     .7179958     1.71326
White + A..  |   1.060324   .2370525     0.26   0.793     .6841307    1.643382
Other mixed  |   1.443812   .3096666     1.71   0.087     .9483013     2.19824
     Indian  |   .9691156   .2166023    -0.14   0.888     .6253565    1.501839
  Pakistani  |   .9238357   .2127095    -0.34   0.731     .5883136     1.45071
Bangladeshi  |   1.079408   .2361543     0.35   0.727     .7030053    1.657344
Other Asian  |   1.013871   .2263683     0.06   0.951      .654536    1.570477
  Caribbean  |   1.016672   .2341605     0.07   0.943     .6473389    1.596725
    African  |   1.179407   .2540086     0.77   0.444      .773287    1.798816
Other Black  |   1.081656   .2363509     0.36   0.719     .7048464    1.659907
    Chinese  |   1.346156   .2885553     1.39   0.166     .8843743     2.04906
      Other  |   .9884448   .2308185    -0.05   0.960     .6254355    1.562148
    Unknown  |   1.118501   .1939742     0.65   0.518     .7961922    1.571283
             |
        male |
       Male  |   1.016154   .0677466     0.24   0.810     .8916824    1.158001
        age1 |   1.004008   .0093543     0.43   0.668     .9858401     1.02251
        age2 |   .9812381   .0330351    -0.56   0.574     .9185805     1.04817
        age3 |   1.050033   .0936501     0.55   0.584       .88163    1.250604
             |
         imd |
          4  |   .9543452   .0798289    -0.56   0.576      .810036    1.124363
5 most de..  |   .9134013   .1080892    -0.77   0.444     .7243242    1.151835
             |
   bmicat_sa |
Normal (..)  |   1.287341   .3135122     1.04   0.300     .7987233    2.074869
Overweig..)  |   1.222068   .2895061     0.85   0.397      .768152    1.944213
Obese I ..)  |   1.055184   .2488733     0.23   0.820     .6646078    1.675292
Obese II..)  |   1.505868   .3476542     1.77   0.076     .9577961    2.367558
Obese II..)  |   1.173803   .2702533     0.70   0.486     .7475099    1.843205
    Unknown  |   1.171192    .275815     0.67   0.502     .7381942     1.85817
             |
    hba1ccat |
  >=6.5-7.4  |   1.050617   .0921426     0.56   0.573     .8846899    1.247664
  >=7.5-7.9  |   .9996431    .137295    -0.00   0.998     .7637259    1.308436
    >=8-8.9  |   1.049652   .1302643     0.39   0.696     .8230182    1.338695
        >=9  |   .8684311   .1583532    -0.77   0.439     .6074687      1.2415
    Unknown  |   .3768831   .3779961    -0.97   0.331     .0527827    2.691051
             |
gp_consult~t |   .9950743   .0143697    -0.34   0.732     .9673051    1.023641
             |
smoke_nomiss |
     Former  |   .8060614   .2110165    -0.82   0.410     .4825413    1.346486
    Current  |    .981415   .1030203    -0.18   0.858      .798916    1.205603
             |
1.hyperten~n |   1.184425   .0946895     2.12   0.034     1.012646    1.385343
             |
      bp_cat |
High, sta..  |   .6430837    .647563    -0.44   0.661     .0893588    4.628049
    Unknown  |   .7187119    .727092    -0.33   0.744     .0989529    5.220129
             |
    1.asthma |   1.263748   .2007639     1.47   0.141     .9256256    1.725384
1.~y_disease |   1.003877   .0837035     0.05   0.963     .8525251    1.182099
1.~c_disease |   .9691699   .0814403    -0.37   0.709     .8220015    1.142687
             |
     dm_type |
       T1DM  |   1.312858   .2390456     1.49   0.135     .9188205    1.875879
       T2DM  |   1.025622   .0847209     0.31   0.759     .8723174     1.20587
 UNKNOWN_DM  |    1.03413    .236038     0.15   0.883     .6611346    1.617559
             |
    1.cancer |   .9062272   .0777102    -1.15   0.251     .7660293    1.072084
1.~r_disease |   1.000875   .0821707     0.01   0.992     .8521128    1.175608
    1.stroke |   1.110201   .0895665     1.30   0.195      .947829    1.300388
  1.dementia |   .8047652   .0706011    -2.48   0.013     .6776325    .9557496
1.other_ne~o |   1.162767   .0926873     1.89   0.059     .9945834    1.359391
             |
      egfr60 |
   eGFR <60  |   .6878936   .2657854    -0.97   0.333     .3225802    1.466915
      1.esrf |   1.231334   .0967116     2.65   0.008     1.055652    1.436253
1.immunosu~d |   .9952485   .0689161    -0.07   0.945     .8689403    1.139917
1.ra_sle_p~s |   1.157148   .0926989     1.82   0.068     .9890073    1.353875
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_hes_eth16.ster not found)
file ./output/model/model2_hes_eth16.ster saved
(note: file ./output/model/model2_hes_eth16.dta not found)
file ./output/model/model2_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(56)      =       64.58
Log likelihood  =   -5848.3065                  Prob > chi2      =      0.2018

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.023443   .2312709     0.10   0.918     .6572259    1.593722
Other White  |   1.301232   .2790255     1.23   0.219     .8547323    1.980977
White + C..  |   .8884855   .2144097    -0.49   0.624     .5536535    1.425813
White + A..  |   1.108809   .2460059     0.47   0.642     .7178029    1.712808
White + A..  |   1.060068   .2369899     0.26   0.794     .6839716    1.642968
Other mixed  |   1.441975   .3093045     1.71   0.088     .9470535    2.195538
     Indian  |   .9652067   .2157731    -0.16   0.874      .622778    1.495917
  Pakistani  |   .9222537    .212349    -0.35   0.725     .5873016    1.448237
Bangladeshi  |   1.076729   .2355872     0.34   0.735     .7012363    1.653288
Other Asian  |   1.011982   .2259555     0.05   0.957     .6533053    1.567578
  Caribbean  |   1.014303   .2336408     0.06   0.951     .6457979    1.593084
    African  |   1.177729   .2537103     0.76   0.448     .7721057    1.796445
Other Black  |   1.081062   .2362167     0.36   0.721     .7044649    1.658983
    Chinese  |   1.346176   .2885566     1.39   0.165     .8843909    2.049082
      Other  |   .9877367   .2306491    -0.05   0.958     .6249924    1.561017
    Unknown  |   1.115827    .193542     0.63   0.527     .7942448    1.567614
             |
        male |
       Male  |   1.016312   .0677775     0.24   0.808     .8917861    1.158226
        age1 |   1.004005   .0093573     0.43   0.668     .9858314    1.022514
        age2 |   .9809433   .0330391    -0.57   0.568     .9182789    1.047884
        age3 |   1.051161   .0937938     0.56   0.576     .8825062    1.252048
             |
         imd |
          4  |   .9551914   .0799257    -0.55   0.584      .810711     1.12542
5 most de..  |   .9155122   .1083878    -0.75   0.456     .7259222    1.154618
             |
   bmicat_sa |
Normal (..)  |   1.283175   .3125456     1.02   0.306     .7960807    2.068307
Overweig..)  |   1.219321    .288888     0.84   0.403     .7663852    1.939944
Obese I ..)  |   1.052495   .2482675     0.22   0.828     .6628795    1.671112
Obese II..)  |   1.502836   .3469977     1.76   0.078     .9558135    2.362925
Obese II..)  |   1.169793   .2693941     0.68   0.496     .7448759    1.837105
    Unknown  |   1.167432   .2749621     0.66   0.511     .7357837    1.852306
             |
    hba1ccat |
  >=6.5-7.4  |     1.0517   .0922498     0.57   0.566     .8855819    1.248978
  >=7.5-7.9  |   .9953387   .1368473    -0.03   0.973     .7602225     1.30317
    >=8-8.9  |    1.04676   .1300467     0.37   0.713     .8205325    1.335359
        >=9  |   .8671336   .1581448    -0.78   0.434     .6065225    1.239724
    Unknown  |   .3779264   .3790468    -0.97   0.332     .0529276    2.698561
             |
gp_consult~t |   .9953726   .0143816    -0.32   0.748     .9675806    1.023963
             |
smoke_nomiss |
     Former  |   .8061465   .2111341    -0.82   0.411     .4824805     1.34694
    Current  |   .9829353   .1031972    -0.16   0.870     .8001259    1.207512
             |
1.hyperten~n |   1.185837   .0948316     2.13   0.033     1.013804    1.387061
             |
      bp_cat |
High, sta..  |   .6407192   .6451927    -0.44   0.658     .0890273    4.611183
    Unknown  |   .7164144   .7247807    -0.33   0.742     .0986331    5.203627
             |
    1.asthma |   1.261987   .2005494     1.46   0.143     .9242425    1.723154
1.~y_disease |   1.004266   .0837557     0.05   0.959     .8528227    1.182603
1.~c_disease |   .9697136    .081499    -0.37   0.714      .822441    1.143358
             |
     dm_type |
       T1DM  |   1.310444     .23875     1.48   0.138     .9169333    1.872832
       T2DM  |   1.024293   .0846301     0.29   0.771     .8711549    1.204351
 UNKNOWN_DM  |   1.035908   .2364717     0.15   0.877     .6622365    1.620425
             |
    1.cancer |   .9078532   .0778769    -1.13   0.260     .7673586    1.074071
1.~r_disease |   1.000297   .0821453     0.00   0.997     .8515844     1.17498
    1.stroke |   1.110432   .0896028     1.30   0.194     .9479968    1.300699
  1.dementia |   .8043403   .0705742    -2.48   0.013     .6772577    .9552689
1.other_ne~o |   1.162206   .0926638     1.89   0.059     .9940678    1.358783
             |
      egfr60 |
   eGFR <60  |   .6885545   .2660526    -0.97   0.334     .3228792    1.468373
      1.esrf |   1.232713   .0968376     2.66   0.008     1.056804    1.437902
1.immunosu~d |   .9956323   .0689617    -0.06   0.950     .8692429    1.140399
1.ra_sle_p~s |   1.155606   .0925988     1.80   0.071     .9876497    1.352124
             |
hh_total_cat |
       6-10  |   .8742003   .1896628    -0.62   0.535     .5713969     1.33747
        11+  |   1.398935   1.042486     0.45   0.652     .3247002    6.027159
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_hes_eth16.ster not found)
file ./output/model/model3_hes_eth16.ster saved
(note: file ./output/model/model3_hes_eth16.dta not found)
file ./output/model/model3_hes_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
onscoviddeath
(1,191 observations deleted)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(15)      =       13.42
Log likelihood  =   -19.359573                  Prob > chi2      =      0.5697

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.06e-07   118.8128    -0.00   1.000            0           .
Other White  |   3.07e-07   119.0829    -0.00   1.000            0           .
White + C..  |   3.05e-07    125.065    -0.00   1.000            0           .
White + A..  |   5.32e+10   7.54e+10    17.45   0.000     3.32e+09    8.53e+11
White + A..  |   3.06e-07   122.2603    -0.00   1.000            0           .
Other mixed  |   3.07e-07   121.8104    -0.00   1.000            0           .
     Indian  |   3.06e-07   120.0691    -0.00   1.000            0           .
  Pakistani  |   3.06e-07   114.7921    -0.00   1.000            0           .
Bangladeshi  |   4.27e+10   6.05e+10    17.26   0.000     2.65e+09    6.88e+11
Other Asian  |   3.06e-07    115.978    -0.00   1.000            0           .
  Caribbean  |   3.06e-07   126.4014    -0.00   1.000            0           .
    African  |   3.06e-07   115.9547    -0.00   1.000            0           .
Other Black  |   3.06e-07   110.8463    -0.00   1.000            0           .
    Chinese  |   4.36e+10          .        .       .            .           .
      Other  |   4.78e+10   6.80e+10    17.28   0.000     2.94e+09    7.77e+11
    Unknown  |   3.07e-07   52.12309    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_onscoviddeath_eth16.ster not found)
file ./output/model/crude_onscoviddeath_eth16.ster saved
(note: file ./output/model/crude_onscoviddeath_eth16.dta not found)
file ./output/model/crude_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(7)       =       14.22
Log likelihood  =   -18.958543                  Prob > chi2      =      0.0473

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.00e-09          .        .       .            .           .
Other White  |   2.02e-09          .        .       .            .           .
White + C..  |   2.02e-09          .        .       .            .           .
White + A..  |   5.19e+10   7.42e+10    17.27   0.000     3.16e+09    8.53e+11
White + A..  |   2.06e-09          .        .       .            .           .
Other mixed  |   2.04e-09          .        .       .            .           .
     Indian  |   1.99e-09          .        .       .            .           .
  Pakistani  |   1.94e-09          .        .       .            .           .
Bangladeshi  |   4.04e+10   5.74e+10    17.17   0.000     2.48e+09    6.56e+11
Other Asian  |   2.04e-09          .        .       .            .           .
  Caribbean  |   2.06e-09          .        .       .            .           .
    African  |   2.15e-09          .        .       .            .           .
Other Black  |   2.09e-09          .        .       .            .           .
    Chinese  |   4.11e+10   5.91e+10    17.01   0.000     2.46e+09    6.87e+11
      Other  |   5.03e+10          .        .       .            .           .
    Unknown  |   7.29e-10          .        .       .            .           .
             |
        male |
       Male  |   1.146735   1.157873     0.14   0.892      .158487    8.297218
        age1 |   1.143814   .2337032     0.66   0.511     .7663704    1.707152
        age2 |   .7167767   .4509086    -0.53   0.597      .208887    2.459553
        age3 |   2.087585   3.303486     0.47   0.642        .0939     46.4112
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_onscoviddeath_eth16.ster not found)
file ./output/model/model0_onscoviddeath_eth16.ster saved
(note: file ./output/model/model0_onscoviddeath_eth16.dta not found)
file ./output/model/model0_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(8)       =       16.92
Log likelihood  =   -17.609585                  Prob > chi2      =      0.0309

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.75e-09          .        .       .            .           .
Other White  |   1.86e-09          .        .       .            .           .
White + C..  |   1.91e-09          .        .       .            .           .
White + A..  |   5.11e+10   7.28e+10    17.30   0.000     3.13e+09    8.34e+11
White + A..  |   1.80e-09          .        .       .            .           .
Other mixed  |   1.93e-09          .        .       .            .           .
     Indian  |   1.73e-09          .        .       .            .           .
  Pakistani  |   1.90e-09          .        .       .            .           .
Bangladeshi  |   3.65e+10   5.19e+10    17.08   0.000     2.24e+09    5.95e+11
Other Asian  |   1.87e-09          .        .       .            .           .
  Caribbean  |   1.72e-09          .        .       .            .           .
    African  |   1.96e-09          .        .       .            .           .
Other Black  |   1.89e-09          .        .       .            .           .
    Chinese  |   3.69e+10          .        .       .            .           .
      Other  |   4.82e+10   6.96e+10    17.04   0.000     2.85e+09    8.16e+11
    Unknown  |   6.69e-10          .        .       .            .           .
             |
        male |
       Male  |   1.240001   1.268587     0.21   0.833     .1669541    9.209724
        age1 |   1.151843   .2335177     0.70   0.486     .7741514    1.713803
        age2 |   .6915048   .4354401    -0.59   0.558      .201277    2.375725
        age3 |   2.312592    3.66844     0.53   0.597     .1032399    51.80251
             |
         imd |
          4  |   4.96e-20          .        .       .            .           .
5 most de..  |   2.788493   3.272826     0.87   0.382     .2794622    27.82378
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(8)       =       16.92
Log likelihood  =   -17.609585                  Prob > chi2      =      0.0309

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.75e-09          .        .       .            .           .
Other White  |   1.86e-09          .        .       .            .           .
White + C..  |   1.91e-09          .        .       .            .           .
White + A..  |   5.11e+10   7.28e+10    17.30   0.000     3.13e+09    8.34e+11
White + A..  |   1.80e-09          .        .       .            .           .
Other mixed  |   1.93e-09          .        .       .            .           .
     Indian  |   1.73e-09          .        .       .            .           .
  Pakistani  |   1.90e-09          .        .       .            .           .
Bangladeshi  |   3.65e+10   5.19e+10    17.08   0.000     2.24e+09    5.95e+11
Other Asian  |   1.87e-09          .        .       .            .           .
  Caribbean  |   1.72e-09          .        .       .            .           .
    African  |   1.96e-09          .        .       .            .           .
Other Black  |   1.89e-09          .        .       .            .           .
    Chinese  |   3.69e+10          .        .       .            .           .
      Other  |   4.82e+10   6.96e+10    17.04   0.000     2.85e+09    8.16e+11
    Unknown  |   6.69e-10          .        .       .            .           .
             |
        male |
       Male  |   1.240001   1.268587     0.21   0.833     .1669541    9.209724
        age1 |   1.151843   .2335177     0.70   0.486     .7741514    1.713803
        age2 |   .6915048   .4354401    -0.59   0.558      .201277    2.375725
        age3 |   2.312592    3.66844     0.53   0.597     .1032399    51.80251
             |
         imd |
          4  |   4.96e-20          .        .       .            .           .
5 most de..  |   2.788493   3.272826     0.87   0.382     .2794622    27.82378
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_onscoviddeath_eth16.ster not found)
file ./output/model/model1_onscoviddeath_eth16.ster saved
(note: file ./output/model/model1_onscoviddeath_eth16.dta not found)
file ./output/model/model1_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(37)      =       52.14
Log likelihood  =            0                  Prob > chi2      =      0.0505

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   8.64e+18          .        .       .            .           .
Other White  |   1.65e+30          .        .       .            .           .
White + C..  |   9.82e+26          .        .       .            .           .
White + A..  |   5.09e+26          .        .       .            .           .
White + A..  |   3.64e+36   3.09e+44     0.00   1.000            0           .
Other mixed  |   1.82e+15   9.10e+23     0.00   1.000            0           .
     Indian  |     .54585   1.30e+09    -0.00   1.000            0           .
  Pakistani  |   6.01e+08   1.24e+17     0.00   1.000            0           .
Bangladeshi  |   2.52e+37   2.51e+45     0.00   1.000            0           .
Other Asian  |   7.49e+24   1.68e+33     0.00   1.000            0           .
  Caribbean  |   5.95e+10          .        .       .            .           .
    African  |   4.32e+31   4.60e+39     0.00   1.000            0           .
Other Black  |   6.72e+11   9.07e+19     0.00   1.000            0           .
    Chinese  |   3.39e+20          .        .       .            .           .
      Other  |   6.47e+28          .        .       .            .           .
    Unknown  |   .0175313    1492087    -0.00   1.000            0           .
             |
        male |
       Male  |   1.05e+14   3.68e+21     0.00   1.000            0           .
        age1 |   32.99537          .        .       .            .           .
        age2 |   .0000616   381.4824    -0.00   1.000            0           .
        age3 |   3.90e+10   6.07e+17     0.00   1.000            0           .
             |
         imd |
          4  |   1.18e-13   .0000101    -0.00   1.000            0           .
5 most de..  |   .0001255   9849.415    -0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   2.14e-20   2.59e-12    -0.00   1.000            0           .
Overweig..)  |   5.37e-30          .        .       .            .           .
Obese I ..)  |   9.75e-21   7.49e-13    -0.00   1.000            0           .
Obese II..)  |   1.01e-18   8.89e-11    -0.00   1.000            0           .
Obese II..)  |   2.78e-26          .        .       .            .           .
    Unknown  |   2.66e-06          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   3.17e-12   .0002522    -0.00   1.000            0           .
  >=7.5-7.9  |   9.20e+19   1.15e+28     0.00   1.000            0           .
    >=8-8.9  |   9.83e-15          .        .       .            .           .
        >=9  |    1182510   2.54e+14     0.00   1.000            0           .
    Unknown  |   1.22e-06    3344.52    -0.00   1.000            0           .
             |
gp_consult~t |   .0184513   303228.5    -0.00   1.000            0           .
             |
smoke_nomiss |
     Former  |   4.26e+38          .        .       .            .           .
    Current  |   652.6294   1.34e+11     0.00   1.000            0           .
             |
1.hyperten~n |   2.51e-08          .        .       .            .           .
             |
      bp_cat |
High, sta..  |   9.10e-46          .        .       .            .           .
    Unknown  |   1.72e-28   1.49e-20    -0.00   1.000            0           .
             |
    1.asthma |   3.64e+17   1.91e+25     0.00   1.000            0           .
1.~y_disease |   .0030723   295168.8    -0.00   1.000            0           .
1.~c_disease |   1.17e-06   60.30857    -0.00   1.000            0           .
             |
     dm_type |
       T1DM  |   5.53e-11   .0124267    -0.00   1.000            0           .
       T2DM  |   4.86e-09   .3237037    -0.00   1.000            0           .
 UNKNOWN_DM  |   1.46e+21          .        .       .            .           .
             |
    1.cancer |   2.64e-09   .2706449    -0.00   1.000            0           .
1.~r_disease |   9.85e+24   3.40e+32     0.00   1.000            0           .
    1.stroke |   1738.762   1.31e+11     0.00   1.000            0           .
  1.dementia |   7.96e-14   7.48e-06    -0.00   1.000            0           .
1.other_ne~o |   2.13e-09   .1276721    -0.00   1.000            0           .
             |
      egfr60 |
   eGFR <60  |   1.14e-17          .        .       .            .           .
      1.esrf |   2.61e+20   2.86e+28     0.00   1.000            0           .
1.immunosu~d |   5.18e-21   4.60e-13    -0.00   1.000            0           .
1.ra_sle_p~s |   5.57e+07   2.13e+15     0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(37)      =       52.14
Log likelihood  =            0                  Prob > chi2      =      0.0505

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   8.64e+18          .        .       .            .           .
Other White  |   1.65e+30          .        .       .            .           .
White + C..  |   9.82e+26          .        .       .            .           .
White + A..  |   5.09e+26          .        .       .            .           .
White + A..  |   3.64e+36   3.09e+44     0.00   1.000            0           .
Other mixed  |   1.82e+15   9.10e+23     0.00   1.000            0           .
     Indian  |     .54585   1.30e+09    -0.00   1.000            0           .
  Pakistani  |   6.01e+08   1.24e+17     0.00   1.000            0           .
Bangladeshi  |   2.52e+37   2.51e+45     0.00   1.000            0           .
Other Asian  |   7.49e+24   1.68e+33     0.00   1.000            0           .
  Caribbean  |   5.95e+10          .        .       .            .           .
    African  |   4.32e+31   4.60e+39     0.00   1.000            0           .
Other Black  |   6.72e+11   9.07e+19     0.00   1.000            0           .
    Chinese  |   3.39e+20          .        .       .            .           .
      Other  |   6.47e+28          .        .       .            .           .
    Unknown  |   .0175313    1492087    -0.00   1.000            0           .
             |
        male |
       Male  |   1.05e+14   3.68e+21     0.00   1.000            0           .
        age1 |   32.99537          .        .       .            .           .
        age2 |   .0000616   381.4824    -0.00   1.000            0           .
        age3 |   3.90e+10   6.07e+17     0.00   1.000            0           .
             |
         imd |
          4  |   1.18e-13   .0000101    -0.00   1.000            0           .
5 most de..  |   .0001255   9849.415    -0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   2.14e-20   2.59e-12    -0.00   1.000            0           .
Overweig..)  |   5.37e-30          .        .       .            .           .
Obese I ..)  |   9.75e-21   7.49e-13    -0.00   1.000            0           .
Obese II..)  |   1.01e-18   8.89e-11    -0.00   1.000            0           .
Obese II..)  |   2.78e-26          .        .       .            .           .
    Unknown  |   2.66e-06          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   3.17e-12   .0002522    -0.00   1.000            0           .
  >=7.5-7.9  |   9.20e+19   1.15e+28     0.00   1.000            0           .
    >=8-8.9  |   9.83e-15          .        .       .            .           .
        >=9  |    1182510   2.54e+14     0.00   1.000            0           .
    Unknown  |   1.22e-06    3344.52    -0.00   1.000            0           .
             |
gp_consult~t |   .0184513   303228.5    -0.00   1.000            0           .
             |
smoke_nomiss |
     Former  |   4.26e+38          .        .       .            .           .
    Current  |   652.6294   1.34e+11     0.00   1.000            0           .
             |
1.hyperten~n |   2.51e-08          .        .       .            .           .
             |
      bp_cat |
High, sta..  |   9.10e-46          .        .       .            .           .
    Unknown  |   1.72e-28   1.49e-20    -0.00   1.000            0           .
             |
    1.asthma |   3.64e+17   1.91e+25     0.00   1.000            0           .
1.~y_disease |   .0030723   295168.8    -0.00   1.000            0           .
1.~c_disease |   1.17e-06   60.30857    -0.00   1.000            0           .
             |
     dm_type |
       T1DM  |   5.53e-11   .0124267    -0.00   1.000            0           .
       T2DM  |   4.86e-09   .3237037    -0.00   1.000            0           .
 UNKNOWN_DM  |   1.46e+21          .        .       .            .           .
             |
    1.cancer |   2.64e-09   .2706449    -0.00   1.000            0           .
1.~r_disease |   9.85e+24   3.40e+32     0.00   1.000            0           .
    1.stroke |   1738.762   1.31e+11     0.00   1.000            0           .
  1.dementia |   7.96e-14   7.48e-06    -0.00   1.000            0           .
1.other_ne~o |   2.13e-09   .1276721    -0.00   1.000            0           .
             |
      egfr60 |
   eGFR <60  |   1.14e-17          .        .       .            .           .
      1.esrf |   2.61e+20   2.86e+28     0.00   1.000            0           .
1.immunosu~d |   5.18e-21   4.60e-13    -0.00   1.000            0           .
1.ra_sle_p~s |   5.57e+07   2.13e+15     0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_onscoviddeath_eth16.ster not found)
file ./output/model/model2_onscoviddeath_eth16.ster saved
(note: file ./output/model/model2_onscoviddeath_eth16.dta not found)
file ./output/model/model2_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(47)      =       52.14
Log likelihood  =   -5.684e-14                  Prob > chi2      =      0.2808

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   4.20e+21   4.56e+29     0.00   1.000            0           .
Other White  |   1.18e+33          .        .       .            .           .
White + C..  |   2.26e+31   2.00e+39     0.00   1.000            0           .
White + A..  |   9.35e+27   7.68e+35     0.00   1.000            0           .
White + A..  |   2.18e+41   2.34e+49     0.00   1.000            0           .
Other mixed  |   1.45e+14   2.33e+22     0.00   1.000            0           .
     Indian  |   2.96e+08   6.87e+16     0.00   1.000            0           .
  Pakistani  |   8.09e+16          .        .       .            .           .
Bangladeshi  |   7.94e+37   2.74e+45     0.00   1.000            0           .
Other Asian  |   1.10e+26   1.98e+34     0.00   1.000            0           .
  Caribbean  |   3.02e+18   9.46e+26     0.00   1.000            0           .
    African  |   5.46e+36   2.24e+44     0.00   1.000            0           .
Other Black  |   1.49e+16          .        .       .            .           .
    Chinese  |   5.75e+24   4.10e+32     0.00   1.000            0           .
      Other  |   2.21e+28   1.27e+36     0.00   1.000            0           .
    Unknown  |    1018581   8.50e+13     0.00   1.000            0           .
             |
        male |
       Male  |   2.87e+13   1.16e+21     0.00   1.000            0           .
        age1 |   12.12851   7.13e+07     0.00   1.000            0           .
        age2 |   .0002065   2359.543    -0.00   1.000            0           .
        age3 |   1.73e+10   3.53e+17     0.00   1.000            0           .
             |
         imd |
          4  |   3.66e-12   .0002184    -0.00   1.000            0           .
5 most de..  |   .0014303   67916.61    -0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   3.90e-35   4.80e-27    -0.00   1.000            0           .
Overweig..)  |   6.61e-34   9.28e-26    -0.00   1.000            0           .
Obese I ..)  |   8.81e-31   1.05e-22    -0.00   1.000            0           .
Obese II..)  |   1.46e-31   8.99e-24    -0.00   1.000            0           .
Obese II..)  |   4.94e-29   4.98e-21    -0.00   1.000            0           .
    Unknown  |   1.81e-11   .0008829    -0.00   1.000            0           .
             |
    hba1ccat |
  >=6.5-7.4  |   .0062061          .        .       .            .           .
  >=7.5-7.9  |   5.95e+23   3.07e+31     0.00   1.000            0           .
    >=8-8.9  |   1.07e-27   3.54e-19    -0.00   1.000            0           .
        >=9  |   4.54e+08   7.32e+16     0.00   1.000            0           .
    Unknown  |   8.59e-15   .0000126    -0.00   1.000            0           .
             |
gp_consult~t |   .0529499     514033    -0.00   1.000            0           .
             |
smoke_nomiss |
     Former  |   2.88e+32   1.55e+40     0.00   1.000            0           .
    Current  |   2.22e-08          .        .       .            .           .
             |
1.hyperten~n |   .0246484    1993996    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   6.75e-50          .        .       .            .           .
    Unknown  |   4.83e-31   1.96e-23    -0.00   1.000            0           .
             |
    1.asthma |   2.87e+18   1.23e+26     0.00   1.000            0           .
1.~y_disease |    54.6446   1.67e+09     0.00   1.000            0           .
1.~c_disease |   .0041074   240842.6    -0.00   1.000            0           .
             |
     dm_type |
       T1DM  |   3.57e-12   .0063987    -0.00   1.000            0           .
       T2DM  |   1.32e-07   7.462974    -0.00   1.000            0           .
 UNKNOWN_DM  |   .0008671   91372.62    -0.00   1.000            0           .
             |
    1.cancer |   2.64e-12   .0001495    -0.00   1.000            0           .
1.~r_disease |   1.69e+18   6.22e+25     0.00   1.000            0           .
    1.stroke |   1.21e+07   9.53e+14     0.00   1.000            0           .
  1.dementia |   3.90e-11   .0032474    -0.00   1.000            0           .
1.other_ne~o |   3.81e-06    236.278    -0.00   1.000            0           .
             |
      egfr60 |
   eGFR <60  |   .0003214          .        .       .            .           .
      1.esrf |   9.02e+23   5.47e+31     0.00   1.000            0           .
1.immunosu~d |   3.96e-17   2.17e-09    -0.00   1.000            0           .
1.ra_sle_p~s |   .0348607          .        .       .            .           .
             |
hh_total_cat |
       6-10  |   16.31422   2.14e+09     0.00   1.000            0           .
        11+  |   8.00e+27          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_onscoviddeath_eth16.ster not found)
file ./output/model/model3_onscoviddeath_eth16.ster saved
(note: file ./output/model/model3_onscoviddeath_eth16.dta not found)
file ./output/model/model3_onscoviddeath_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
ons_noncoviddeath
(1,191 observations deleted)

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(16)      =       18.84
Log likelihood  =   -68.455997                  Prob > chi2      =      0.2769

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.116346   2.593423     0.61   0.541     .1916475    23.37061
Other White  |   2.63e-16   1.57e-08    -0.00   1.000            0           .
White + C..  |   2.338499   2.865732     0.69   0.488     .2117511     25.8255
White + A..  |   2.64e-16   1.67e-08    -0.00   1.000            0           .
White + A..  |   1.118808   1.584291     0.08   0.937     .0697284    17.95154
Other mixed  |   2.63e-16   1.72e-08    -0.00   1.000            0           .
     Indian  |   2.64e-16   1.64e-08    -0.00   1.000            0           .
  Pakistani  |   .9593344   1.357136    -0.03   0.977     .0599523    15.35092
Bangladeshi  |   2.63e-16   1.59e-08    -0.00   1.000            0           .
Other Asian  |   1.997596   2.449156     0.56   0.573     .1806719    22.08639
  Caribbean  |   2.64e-16   1.71e-08    -0.00   1.000            0           .
    African  |   .9491059    1.34268    -0.04   0.971     .0593114    15.18767
Other Black  |    .993331   1.406092    -0.00   0.996     .0619714    15.92198
    Chinese  |   2.64e-16   1.68e-08    -0.00   1.000            0           .
      Other  |   2.64e-16   1.76e-08    -0.00   1.000            0           .
    Unknown  |   .1933997   .2735923    -1.16   0.245     .0120867    3.094605
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_ons_noncoviddeath_eth16.ster not found)
file ./output/model/crude_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/crude_ons_noncoviddeath_eth16.dta not found)
file ./output/model/crude_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(20)      =       19.35
Log likelihood  =   -68.203151                  Prob > chi2      =      0.4993

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.103598   2.578394     0.61   0.544     .1903879    23.24268
Other White  |   2.59e-16   1.55e-08    -0.00   1.000            0           .
White + C..  |   2.343984   2.875698     0.69   0.487     .2116729    25.95639
White + A..  |   2.61e-16   1.64e-08    -0.00   1.000            0           .
White + A..  |    1.06447   1.509981     0.04   0.965     .0660206    17.16277
Other mixed  |   2.63e-16   1.71e-08    -0.00   1.000            0           .
     Indian  |   2.64e-16   1.64e-08    -0.00   1.000            0           .
  Pakistani  |   .9482649   1.342844    -0.04   0.970     .0590932    15.21674
Bangladeshi  |   2.60e-16   1.57e-08    -0.00   1.000            0           .
Other Asian  |   1.975808    2.42331     0.56   0.579     .1785477    21.86429
  Caribbean  |   2.64e-16   1.70e-08    -0.00   1.000            0           .
    African  |   .9559129     1.3527    -0.03   0.975     .0596889    15.30885
Other Black  |   .9731904   1.378226    -0.02   0.985     .0606361    15.61939
    Chinese  |   2.61e-16   1.67e-08    -0.00   1.000            0           .
      Other  |   2.65e-16   1.76e-08    -0.00   1.000            0           .
    Unknown  |   .1907051   .2698736    -1.17   0.242     .0119068    3.054414
             |
        male |
       Male  |   1.002545   .5807599     0.00   0.996     .3221183    3.120274
        age1 |   1.022533   .0853415     0.27   0.789     .8682311    1.204257
        age2 |   .9002164    .265802    -0.36   0.722     .5046814    1.605745
        age3 |    1.37684   1.055623     0.42   0.677     .3063849    6.187275
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_ons_noncoviddeath_eth16.ster not found)
file ./output/model/model0_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/model0_ons_noncoviddeath_eth16.dta not found)
file ./output/model/model0_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(22)      =       20.53
Log likelihood  =   -67.611273                  Prob > chi2      =      0.5498

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |    2.27478   2.800812     0.67   0.504     .2036581     25.4084
Other White  |   9.92e-17   9.74e-09    -0.00   1.000            0           .
White + C..  |   2.431014   2.984514     0.72   0.469     .2191707    26.96452
White + A..  |   9.75e-17   1.00e-08    -0.00   1.000            0           .
White + A..  |   1.116355   1.586192     0.08   0.938     .0689221    18.08199
Other mixed  |   9.99e-17   1.07e-08    -0.00   1.000            0           .
     Indian  |   1.03e-16   1.06e-08    -0.00   1.000            0           .
  Pakistani  |   .9459157   1.340509    -0.04   0.969     .0588258    15.21028
Bangladeshi  |   9.70e-17   9.65e-09    -0.00   1.000            0           .
Other Asian  |   2.028172   2.491139     0.58   0.565     .1826421    22.52208
  Caribbean  |   1.03e-16   1.09e-08    -0.00   1.000            0           .
    African  |   .9921723   1.405074    -0.01   0.996      .061823    15.92298
Other Black  |   1.011068   1.433068     0.01   0.994     .0628499    16.26509
    Chinese  |   9.79e-17   1.02e-08    -0.00   1.000            0           .
      Other  |   1.02e-16   1.11e-08    -0.00   1.000            0           .
    Unknown  |   .1967011   .2786143    -1.15   0.251       .01225    3.158481
             |
        male |
       Male  |   .9944376   .5761498    -0.01   0.992     .3194588    3.095567
        age1 |   1.025305   .0852358     0.30   0.764      .871146    1.206744
        age2 |   .8904742   .2619949    -0.39   0.693     .5002432    1.585118
        age3 |   1.415308   1.081285     0.45   0.649     .3166206    6.326491
             |
         imd |
          4  |   2.021119   1.273334     1.12   0.264      .587926    6.948019
5 most de..  |   1.022101   1.098493     0.02   0.984      .124358    8.400671
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(22)      =       20.53
Log likelihood  =   -67.611273                  Prob > chi2      =      0.5498

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |    2.27478   2.800812     0.67   0.504     .2036581     25.4084
Other White  |   9.92e-17   9.74e-09    -0.00   1.000            0           .
White + C..  |   2.431014   2.984514     0.72   0.469     .2191707    26.96452
White + A..  |   9.75e-17   1.00e-08    -0.00   1.000            0           .
White + A..  |   1.116355   1.586192     0.08   0.938     .0689221    18.08199
Other mixed  |   9.99e-17   1.07e-08    -0.00   1.000            0           .
     Indian  |   1.03e-16   1.06e-08    -0.00   1.000            0           .
  Pakistani  |   .9459157   1.340509    -0.04   0.969     .0588258    15.21028
Bangladeshi  |   9.70e-17   9.65e-09    -0.00   1.000            0           .
Other Asian  |   2.028172   2.491139     0.58   0.565     .1826421    22.52208
  Caribbean  |   1.03e-16   1.09e-08    -0.00   1.000            0           .
    African  |   .9921723   1.405074    -0.01   0.996      .061823    15.92298
Other Black  |   1.011068   1.433068     0.01   0.994     .0628499    16.26509
    Chinese  |   9.79e-17   1.02e-08    -0.00   1.000            0           .
      Other  |   1.02e-16   1.11e-08    -0.00   1.000            0           .
    Unknown  |   .1967011   .2786143    -1.15   0.251       .01225    3.158481
             |
        male |
       Male  |   .9944376   .5761498    -0.01   0.992     .3194588    3.095567
        age1 |   1.025305   .0852358     0.30   0.764      .871146    1.206744
        age2 |   .8904742   .2619949    -0.39   0.693     .5002432    1.585118
        age3 |   1.415308   1.081285     0.45   0.649     .3166206    6.326491
             |
         imd |
          4  |   2.021119   1.273334     1.12   0.264      .587926    6.948019
5 most de..  |   1.022101   1.098493     0.02   0.984      .124358    8.400671
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_ons_noncoviddeath_eth16.ster not found)
file ./output/model/model1_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/model1_ons_noncoviddeath_eth16.dta not found)
file ./output/model/model1_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(52)      =       60.42
Log likelihood  =   -47.667255                  Prob > chi2      =      0.1978

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.444122   4.682574     0.91   0.363     .2397719    49.47192
Other White  |   1.54e-17   3.58e-09    -0.00   1.000            0           .
White + C..  |   3.365553   4.536164     0.90   0.368     .2397667    47.24154
White + A..  |   2.91e-17   5.95e-09    -0.00   1.000            0           .
White + A..  |   1.778395   2.767017     0.37   0.711     .0842632    37.53345
Other mixed  |   1.18e-17   3.38e-09    -0.00   1.000            0           .
     Indian  |   1.49e-17   4.86e-09    -0.00   1.000            0           .
  Pakistani  |   .8737252   1.355618    -0.09   0.931     .0417545    18.28295
Bangladeshi  |   9.88e-18   2.73e-09    -0.00   1.000            0           .
Other Asian  |    3.48524   4.690762     0.93   0.354     .2492334    48.73705
  Caribbean  |   1.04e-17   3.00e-09    -0.00   1.000            0           .
    African  |   1.054901   1.597682     0.04   0.972     .0542049    20.52978
Other Black  |   2.393933   3.612623     0.58   0.563     .1243327    46.09338
    Chinese  |   1.48e-17   4.75e-09    -0.00   1.000            0           .
      Other  |   1.11e-17   3.92e-09    -0.00   1.000            0           .
    Unknown  |   .2293854   .3422563    -0.99   0.324     .0123175     4.27177
             |
        male |
       Male  |   1.373683   .8857823     0.49   0.622     .3881612    4.861394
        age1 |    1.00841   .0917277     0.09   0.927     .8437416    1.205215
        age2 |    .885981   .2835351    -0.38   0.705     .4731726    1.658934
        age3 |   1.511133    1.25751     0.50   0.620     .2957763    7.720438
             |
         imd |
          4  |    2.34373   1.626743     1.23   0.220     .6013166    9.135075
5 most de..  |   1.490755   1.681787     0.35   0.723     .1633533    13.60456
             |
   bmicat_sa |
Normal (..)  |   4.35e+08   6.60e+08    13.13   0.000     2.24e+07    8.48e+09
Overweig..)  |   2.94e+09   3.56e+09    18.04   0.000     2.75e+08    3.14e+10
Obese I ..)  |   2.48e+08   3.76e+08    12.77   0.000     1.28e+07    4.82e+09
Obese II..)  |   7.73e+08   1.02e+09    15.47   0.000     5.78e+07    1.03e+10
Obese II..)  |   3.71e+08   4.84e+08    15.11   0.000     2.87e+07    4.80e+09
    Unknown  |   2.76e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |    1.20511   1.044626     0.22   0.830     .2203834    6.589829
  >=7.5-7.9  |   6.91e-17   8.45e-09    -0.00   1.000            0           .
    >=8-8.9  |   3.937026   3.617231     1.49   0.136     .6502909    23.83575
        >=9  |   2.781021   3.446284     0.83   0.409      .245122    31.55196
    Unknown  |   1.41e-17   1.65e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.168432   .1492549     1.22   0.223     .9096437    1.500843
             |
smoke_nomiss |
     Former  |   3.79e-17   7.05e-09    -0.00   1.000            0           .
    Current  |   .6772336   .7443354    -0.35   0.723     .0785594      5.8382
             |
1.hyperten~n |   2.78e-17   1.98e-09    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   1.38e+08   1.55e+08    16.70   0.000     1.53e+07    1.24e+09
    Unknown  |   1.60e+08          .        .       .            .           .
             |
    1.asthma |   2.65e-17   5.35e-09    -0.00   1.000            0           .
1.~y_disease |   1.803803   1.342402     0.79   0.428     .4194875    7.756381
1.~c_disease |   .2413872    .273928    -1.25   0.210     .0261074    2.231847
             |
     dm_type |
       T1DM  |   9.22e-17   2.14e-08    -0.00   1.000            0           .
       T2DM  |   .2685053   .3038364    -1.16   0.245     .0292245    2.466944
 UNKNOWN_DM  |   15.64167   19.58889     2.20   0.028     1.343625    182.0908
             |
    1.cancer |   4.48e-17   3.27e-09    -0.00   1.000            0           .
1.~r_disease |   .6260036   .5344001    -0.55   0.583     .1174714    3.335966
    1.stroke |   .2598234    .307082    -1.14   0.254     .0256244    2.634527
  1.dementia |   .6512717   .5494172    -0.51   0.611     .1246473    3.402841
1.other_ne~o |   .3378348   .3728925    -0.98   0.326     .0388304     2.93925
             |
      egfr60 |
   eGFR <60  |   5.99e-17   3.23e-08    -0.00   1.000            0           .
      1.esrf |    .302387   .3372872    -1.07   0.284     .0339719    2.691576
1.immunosu~d |   .3403834   .2781527    -1.32   0.187     .0686101    1.688685
1.ra_sle_p~s |   .6321985   .5329961    -0.54   0.587      .121121    3.299798
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(52)      =       60.42
Log likelihood  =   -47.667255                  Prob > chi2      =      0.1978

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.444122   4.682574     0.91   0.363     .2397719    49.47192
Other White  |   1.54e-17   3.58e-09    -0.00   1.000            0           .
White + C..  |   3.365553   4.536164     0.90   0.368     .2397667    47.24154
White + A..  |   2.91e-17   5.95e-09    -0.00   1.000            0           .
White + A..  |   1.778395   2.767017     0.37   0.711     .0842632    37.53345
Other mixed  |   1.18e-17   3.38e-09    -0.00   1.000            0           .
     Indian  |   1.49e-17   4.86e-09    -0.00   1.000            0           .
  Pakistani  |   .8737252   1.355618    -0.09   0.931     .0417545    18.28295
Bangladeshi  |   9.88e-18   2.73e-09    -0.00   1.000            0           .
Other Asian  |    3.48524   4.690762     0.93   0.354     .2492334    48.73705
  Caribbean  |   1.04e-17   3.00e-09    -0.00   1.000            0           .
    African  |   1.054901   1.597682     0.04   0.972     .0542049    20.52978
Other Black  |   2.393933   3.612623     0.58   0.563     .1243327    46.09338
    Chinese  |   1.48e-17   4.75e-09    -0.00   1.000            0           .
      Other  |   1.11e-17   3.92e-09    -0.00   1.000            0           .
    Unknown  |   .2293854   .3422563    -0.99   0.324     .0123175     4.27177
             |
        male |
       Male  |   1.373683   .8857823     0.49   0.622     .3881612    4.861394
        age1 |    1.00841   .0917277     0.09   0.927     .8437416    1.205215
        age2 |    .885981   .2835351    -0.38   0.705     .4731726    1.658934
        age3 |   1.511133    1.25751     0.50   0.620     .2957763    7.720438
             |
         imd |
          4  |    2.34373   1.626743     1.23   0.220     .6013166    9.135075
5 most de..  |   1.490755   1.681787     0.35   0.723     .1633533    13.60456
             |
   bmicat_sa |
Normal (..)  |   4.35e+08   6.60e+08    13.13   0.000     2.24e+07    8.48e+09
Overweig..)  |   2.94e+09   3.56e+09    18.04   0.000     2.75e+08    3.14e+10
Obese I ..)  |   2.48e+08   3.76e+08    12.77   0.000     1.28e+07    4.82e+09
Obese II..)  |   7.73e+08   1.02e+09    15.47   0.000     5.78e+07    1.03e+10
Obese II..)  |   3.71e+08   4.84e+08    15.11   0.000     2.87e+07    4.80e+09
    Unknown  |   2.76e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |    1.20511   1.044626     0.22   0.830     .2203834    6.589829
  >=7.5-7.9  |   6.91e-17   8.45e-09    -0.00   1.000            0           .
    >=8-8.9  |   3.937026   3.617231     1.49   0.136     .6502909    23.83575
        >=9  |   2.781021   3.446284     0.83   0.409      .245122    31.55196
    Unknown  |   1.41e-17   1.65e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.168432   .1492549     1.22   0.223     .9096437    1.500843
             |
smoke_nomiss |
     Former  |   3.79e-17   7.05e-09    -0.00   1.000            0           .
    Current  |   .6772336   .7443354    -0.35   0.723     .0785594      5.8382
             |
1.hyperten~n |   2.78e-17   1.98e-09    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   1.38e+08   1.55e+08    16.70   0.000     1.53e+07    1.24e+09
    Unknown  |   1.60e+08          .        .       .            .           .
             |
    1.asthma |   2.65e-17   5.35e-09    -0.00   1.000            0           .
1.~y_disease |   1.803803   1.342402     0.79   0.428     .4194875    7.756381
1.~c_disease |   .2413872    .273928    -1.25   0.210     .0261074    2.231847
             |
     dm_type |
       T1DM  |   9.22e-17   2.14e-08    -0.00   1.000            0           .
       T2DM  |   .2685053   .3038364    -1.16   0.245     .0292245    2.466944
 UNKNOWN_DM  |   15.64167   19.58889     2.20   0.028     1.343625    182.0908
             |
    1.cancer |   4.48e-17   3.27e-09    -0.00   1.000            0           .
1.~r_disease |   .6260036   .5344001    -0.55   0.583     .1174714    3.335966
    1.stroke |   .2598234    .307082    -1.14   0.254     .0256244    2.634527
  1.dementia |   .6512717   .5494172    -0.51   0.611     .1246473    3.402841
1.other_ne~o |   .3378348   .3728925    -0.98   0.326     .0388304     2.93925
             |
      egfr60 |
   eGFR <60  |   5.99e-17   3.23e-08    -0.00   1.000            0           .
      1.esrf |    .302387   .3372872    -1.07   0.284     .0339719    2.691576
1.immunosu~d |   .3403834   .2781527    -1.32   0.187     .0686101    1.688685
1.ra_sle_p~s |   .6321985   .5329961    -0.54   0.587      .121121    3.299798
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_ons_noncoviddeath_eth16.ster not found)
file ./output/model/model2_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/model2_ons_noncoviddeath_eth16.dta not found)
file ./output/model/model2_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(36)      =       61.34
Log likelihood  =   -47.209495                  Prob > chi2      =      0.0053

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.598442   4.921725     0.94   0.349     .2465439    52.52122
Other White  |   3.89e-20          .        .       .            .           .
White + C..  |   3.557314   4.832235     0.93   0.350     .2482305    50.97877
White + A..  |   7.16e-20          .        .       .            .           .
White + A..  |   1.848086   2.888094     0.39   0.694     .0863989    39.53085
Other mixed  |   8.49e-20          .        .       .            .           .
     Indian  |   1.03e-19          .        .       .            .           .
  Pakistani  |   1.184371   1.850205     0.11   0.914     .0554313    25.30585
Bangladeshi  |   6.58e-20          .        .       .            .           .
Other Asian  |   3.630695   4.922216     0.95   0.342     .2546809    51.75867
  Caribbean  |   6.83e-20          .        .       .            .           .
    African  |   1.070669   1.626643     0.04   0.964      .054506    21.03131
Other Black  |    2.53482   3.832514     0.62   0.538     .1309108    49.08161
    Chinese  |   1.02e-19          .        .       .            .           .
      Other  |   7.56e-20          .        .       .            .           .
    Unknown  |   .2395739   .3587609    -0.95   0.340     .0127283    4.509309
             |
        male |
       Male  |   1.324713   .8519244     0.44   0.662     .3755891    4.672297
        age1 |   1.000818   .0900899     0.01   0.993     .8389445    1.193925
        age2 |   .9035536   .2857335    -0.32   0.748     .4861563    1.679314
        age3 |   1.436327   1.182999     0.44   0.660     .2858775    7.216499
             |
         imd |
          4  |   2.225664   1.547461     1.15   0.250     .5696861    8.695278
5 most de..  |   1.424388   1.612515     0.31   0.755     .1548829    13.09945
             |
   bmicat_sa |
Normal (..)  |   4.13e+08   6.30e+08    13.02   0.000     2.08e+07    8.19e+09
Overweig..)  |   2.92e+09   3.58e+09    17.79   0.000     2.64e+08    3.22e+10
Obese I ..)  |   2.45e+08   3.73e+08    12.71   0.000     1.25e+07    4.82e+09
Obese II..)  |   7.29e+08   9.69e+08    15.35   0.000     5.38e+07    9.87e+09
Obese II..)  |   3.42e+08   4.49e+08    15.00   0.000     2.62e+07    4.47e+09
    Unknown  |   2.49e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   1.138617   .9943115     0.15   0.882     .2056155    6.305215
  >=7.5-7.9  |   6.24e-20          .        .       .            .           .
    >=8-8.9  |   3.842491   3.528828     1.47   0.143     .6351774    23.24506
        >=9  |   2.687115    3.34531     0.79   0.427     .2342001    30.83083
    Unknown  |   6.56e-19          .        .       .            .           .
             |
gp_consult~t |   1.183809   .1517861     1.32   0.188     .9207508    1.522024
             |
smoke_nomiss |
     Former  |   7.81e-20          .        .       .            .           .
    Current  |   .6508356    .715747    -0.39   0.696     .0754006    5.617821
             |
1.hyperten~n |   9.06e-21          .        .       .            .           .
             |
      bp_cat |
High, sta..  |   1.44e+08   1.63e+08    16.66   0.000     1.58e+07    1.32e+09
    Unknown  |   1.65e+08          .        .       .            .           .
             |
    1.asthma |   6.47e-20          .        .       .            .           .
1.~y_disease |   1.727556   1.285734     0.73   0.463     .4017217     7.42915
1.~c_disease |   .2313528   .2629524    -1.29   0.198     .0249351    2.146538
             |
     dm_type |
       T1DM  |   2.26e-19          .        .       .            .           .
       T2DM  |   .2660093   .3024494    -1.16   0.244     .0286478    2.470034
 UNKNOWN_DM  |   15.63983    19.7039     2.18   0.029     1.323861    184.7658
             |
    1.cancer |   1.39e-20          .        .       .            .           .
1.~r_disease |    .620859    .535046    -0.55   0.580     .1146678    3.361587
    1.stroke |   .2630838   .3114268    -1.13   0.259     .0258511     2.67737
  1.dementia |   .6462979   .5450069    -0.52   0.605     .1237758    3.374658
1.other_ne~o |    .338743   .3728123    -0.98   0.325     .0391795    2.928749
             |
      egfr60 |
   eGFR <60  |   1.22e-18          .        .       .            .           .
      1.esrf |   .2919612   .3293431    -1.09   0.275     .0319991    2.663864
1.immunosu~d |   .3126474   .2615349    -1.39   0.165      .060675    1.611015
1.ra_sle_p~s |   .6325863   .5384909    -0.54   0.591     .1192702    3.355116
             |
hh_total_cat |
       6-10  |   1.38e+16          .        .       .            .           .
        11+  |   .0043716          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_ons_noncoviddeath_eth16.ster not found)
file ./output/model/model3_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/model3_ons_noncoviddeath_eth16.dta not found)
file ./output/model/model3_ons_noncoviddeath_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
onsdeath
(1,191 observations deleted)

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(16)      =       14.28
Log likelihood  =   -96.807751                  Prob > chi2      =      0.5778

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.105749   2.579991     0.61   0.543     .1907671    23.24395
Other White  |   1.42e-17   3.68e-09    -0.00   1.000            0           .
White + C..  |   2.326755   2.850917     0.69   0.491     .2107626    25.68666
White + A..  |   1.083347   1.533053     0.06   0.955     .0676435    17.35039
White + A..  |    1.11279   1.575191     0.08   0.940     .0694238    17.83683
Other mixed  |   1.42e-17   3.99e-09    -0.00   1.000            0           .
     Indian  |   1.42e-17   3.82e-09    -0.00   1.000            0           .
  Pakistani  |   .9596825   1.357527    -0.03   0.977     .0599865    15.35331
Bangladeshi  |   .9599515   1.358446    -0.03   0.977     .0599374     15.3745
Other Asian  |   1.993101   2.442753     0.56   0.574     .1804234    22.01738
  Caribbean  |   1.42e-17   3.99e-09    -0.00   1.000            0           .
    African  |   .9576344   1.354695    -0.03   0.976     .0598505    15.32257
Other Black  |   .9698628   1.372498    -0.02   0.983      .060553    15.53407
    Chinese  |   1.044955   1.478601     0.03   0.975     .0652613    16.73167
      Other  |   1.144056   1.619154     0.10   0.924     .0714106    18.32871
    Unknown  |   .1946118   .2752845    -1.16   0.247     .0121652    3.113295
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_onsdeath_eth16.ster not found)
file ./output/model/crude_onsdeath_eth16.ster saved
(note: file ./output/model/crude_onsdeath_eth16.dta not found)
file ./output/model/crude_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(20)      =       14.98
Log likelihood  =   -96.460511                  Prob > chi2      =      0.7778

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.081712   2.550797     0.60   0.550     .1885439    22.98416
Other White  |   7.56e-16   2.66e-08    -0.00   1.000            0           .
White + C..  |   2.326688   2.852687     0.69   0.491      .210428    25.72602
White + A..  |   1.064213   1.506178     0.04   0.965      .066424    17.05031
White + A..  |   1.064459   1.508278     0.04   0.965     .0662255    17.10933
Other mixed  |   7.73e-16   2.92e-08    -0.00   1.000            0           .
     Indian  |   7.74e-16   2.82e-08    -0.00   1.000            0           .
  Pakistani  |   .9364802   1.325751    -0.05   0.963     .0584082    15.01492
Bangladeshi  |   .9323664   1.320559    -0.05   0.961     .0580746    14.96881
Other Asian  |   1.974947   2.421001     0.56   0.579     .1786918    21.82761
  Caribbean  |   7.72e-16   2.93e-08    -0.00   1.000            0           .
    African  |   .9668327   1.367922    -0.02   0.981      .060399     15.4765
Other Black  |   .9558315   1.353181    -0.03   0.975      .059611    15.32627
    Chinese  |    1.02203   1.447239     0.02   0.988     .0636981     16.3984
      Other  |   1.159133   1.641208     0.10   0.917     .0722644    18.59271
    Unknown  |   .1905707   .2696268    -1.17   0.241     .0119054    3.050485
             |
        male |
       Male  |   1.015034   .5094021     0.03   0.976     .3795765    2.714327
        age1 |   1.044257   .0791984     0.57   0.568     .9000167    1.211613
        age2 |   .8614647   .2253005    -0.57   0.569     .5159661    1.438314
        age3 |   1.493984    1.01019     0.59   0.553     .3969971    5.622178
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_onsdeath_eth16.ster not found)
file ./output/model/model0_onsdeath_eth16.ster saved
(note: file ./output/model/model0_onsdeath_eth16.dta not found)
file ./output/model/model0_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(22)      =       15.33
Log likelihood  =   -96.281586                  Prob > chi2      =      0.8475

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.069573   2.542833     0.59   0.554     .1862218    23.00016
Other White  |   1.01e-16   9.66e-09    -0.00   1.000            0           .
White + C..  |   2.318027   2.843548     0.69   0.493     .2093827    25.66234
White + A..  |   1.041981   1.475552     0.03   0.977     .0649339    16.72047
White + A..  |   1.051085   1.491117     0.04   0.972     .0651754    16.95084
Other mixed  |   1.02e-16   1.05e-08    -0.00   1.000            0           .
     Indian  |   1.05e-16   1.04e-08    -0.00   1.000            0           .
  Pakistani  |   .9298697   1.316569    -0.05   0.959     .0579745    14.91446
Bangladeshi  |   .9226224   1.307514    -0.06   0.955     .0573754    14.83619
Other Asian  |   1.956214   2.400089     0.55   0.584     .1766335    21.66506
  Caribbean  |   1.04e-16   1.07e-08    -0.00   1.000            0           .
    African  |    .963228   1.363466    -0.03   0.979      .060095    15.43903
Other Black  |   .9608164   1.360654    -0.03   0.977      .059871    15.41929
    Chinese  |   1.008031    1.42818     0.01   0.995     .0627322    16.19785
      Other  |   1.164076   1.648284     0.11   0.915     .0725628    18.67447
    Unknown  |   .1897998   .2686694    -1.17   0.240     .0118409     3.04233
             |
        male |
       Male  |   1.016543    .510252     0.03   0.974     .3800728    2.718848
        age1 |   1.044581   .0792836     0.57   0.566     .9001942    1.212128
        age2 |   .8609335   .2251701    -0.57   0.567     .5156378    1.437456
        age3 |   1.495578   1.011052     0.60   0.552     .3975333    5.626583
             |
         imd |
          4  |   1.334257   .7912819     0.49   0.627      .417286    4.266238
5 most de..  |   1.430899   1.112917     0.46   0.645     .3115778    6.571305
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(22)      =       15.33
Log likelihood  =   -96.281586                  Prob > chi2      =      0.8475

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.069573   2.542833     0.59   0.554     .1862218    23.00016
Other White  |   1.01e-16   9.66e-09    -0.00   1.000            0           .
White + C..  |   2.318027   2.843548     0.69   0.493     .2093827    25.66234
White + A..  |   1.041981   1.475552     0.03   0.977     .0649339    16.72047
White + A..  |   1.051085   1.491117     0.04   0.972     .0651754    16.95084
Other mixed  |   1.02e-16   1.05e-08    -0.00   1.000            0           .
     Indian  |   1.05e-16   1.04e-08    -0.00   1.000            0           .
  Pakistani  |   .9298697   1.316569    -0.05   0.959     .0579745    14.91446
Bangladeshi  |   .9226224   1.307514    -0.06   0.955     .0573754    14.83619
Other Asian  |   1.956214   2.400089     0.55   0.584     .1766335    21.66506
  Caribbean  |   1.04e-16   1.07e-08    -0.00   1.000            0           .
    African  |    .963228   1.363466    -0.03   0.979      .060095    15.43903
Other Black  |   .9608164   1.360654    -0.03   0.977      .059871    15.41929
    Chinese  |   1.008031    1.42818     0.01   0.995     .0627322    16.19785
      Other  |   1.164076   1.648284     0.11   0.915     .0725628    18.67447
    Unknown  |   .1897998   .2686694    -1.17   0.240     .0118409     3.04233
             |
        male |
       Male  |   1.016543    .510252     0.03   0.974     .3800728    2.718848
        age1 |   1.044581   .0792836     0.57   0.566     .9001942    1.212128
        age2 |   .8609335   .2251701    -0.57   0.567     .5156378    1.437456
        age3 |   1.495578   1.011052     0.60   0.552     .3975333    5.626583
             |
         imd |
          4  |   1.334257   .7912819     0.49   0.627      .417286    4.266238
5 most de..  |   1.430899   1.112917     0.46   0.645     .3115778    6.571305
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_onsdeath_eth16.ster not found)
file ./output/model/model1_onsdeath_eth16.ster saved
(note: file ./output/model/model1_onsdeath_eth16.dta not found)
file ./output/model/model1_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(51)      =       52.24
Log likelihood  =   -77.826812                  Prob > chi2      =      0.4254

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.870663   3.654854     0.83   0.408     .2367305    34.81049
Other White  |   2.87e-19   5.38e-10    -0.00   1.000            0           .
White + C..  |   3.720329   4.713404     1.04   0.300     .3105751    44.56521
White + A..  |   1.391448   2.030946     0.23   0.821      .079627    24.31497
White + A..  |   1.791003   2.652004     0.39   0.694     .0983312    32.62132
Other mixed  |   2.68e-19   5.92e-10    -0.00   1.000            0           .
     Indian  |   3.35e-19   7.06e-10    -0.00   1.000            0           .
  Pakistani  |   1.238488   1.799233     0.15   0.883     .0718281    21.35447
Bangladeshi  |   1.238748   1.803636     0.15   0.883     .0713872     21.4954
Other Asian  |   3.264316   4.174154     0.93   0.355      .266282    40.01682
  Caribbean  |   2.75e-19   6.16e-10    -0.00   1.000            0           .
    African  |   1.040686   1.523012     0.03   0.978     .0591034    18.32427
Other Black  |    1.72164    2.52677     0.37   0.711     .0969781    30.56404
    Chinese  |    1.40783   2.031648     0.24   0.813     .0832101    23.81905
      Other  |   1.345228   1.973319     0.20   0.840     .0758867    23.84658
    Unknown  |   .2334192   .3354562    -1.01   0.311     .0139585     3.90331
             |
        male |
       Male  |   1.043799   .5516464     0.08   0.935     .3704741     2.94087
        age1 |   1.039333   .0835985     0.48   0.631     .8877451    1.216804
        age2 |    .868375   .2385735    -0.51   0.607      .506818    1.487862
        age3 |   1.477413   1.045639     0.55   0.581     .3690322    5.914795
             |
         imd |
          4  |   1.230504   .7566364     0.34   0.736     .3687051    4.106639
5 most de..  |   1.444496   1.172486     0.45   0.650     .2943083    7.089734
             |
   bmicat_sa |
Normal (..)  |   .2608298   .3775759    -0.93   0.353     .0152814    4.451972
Overweig..)  |   1.033128   1.181775     0.03   0.977     .1097694    9.723604
Obese I ..)  |   .1323161   .1916876    -1.40   0.163     .0077352    2.263375
Obese II..)  |    .433434   .5213107    -0.70   0.487     .0410341    4.578272
Obese II..)  |   .3387412   .4056993    -0.90   0.366       .03239    3.542619
    Unknown  |   .2998163   .3832589    -0.94   0.346     .0244768    3.672456
             |
    hba1ccat |
  >=6.5-7.4  |   .9394966   .7510286    -0.08   0.938     .1960872    4.501334
  >=7.5-7.9  |   2.882618   2.459636     1.24   0.215     .5413606    15.34926
    >=8-8.9  |    2.47654   2.056872     1.09   0.275     .4862798     12.6126
        >=9  |   2.324162    2.59905     0.75   0.451     .2596508    20.80382
    Unknown  |   7.32e-19          .        .       .            .           .
             |
gp_consult~t |   1.131479   .1229465     1.14   0.256     .9144392    1.400032
             |
smoke_nomiss |
     Former  |   2.575962   2.905416     0.84   0.402     .2824055    23.49664
    Current  |   1.139204   .9128286     0.16   0.871     .2368894    5.478449
             |
1.hyperten~n |   3.28e-19   2.65e-10    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   4.17e+07   3.32e+07    21.99   0.000      8720950    1.99e+08
    Unknown  |   6.60e+07          .        .       .            .           .
             |
    1.asthma |   1.860652   2.023916     0.57   0.568     .2206858    15.68757
1.~y_disease |   1.450321   .8862685     0.61   0.543     .4378326    4.804189
1.~c_disease |   .5385246   .4190098    -0.80   0.426     .1171956    2.474571
             |
     dm_type |
       T1DM  |   4.28e-19   1.16e-09    -0.00   1.000            0           .
       T2DM  |   .5033067    .393933    -0.88   0.380      .108544    2.333778
 UNKNOWN_DM  |   4.838179   5.523996     1.38   0.167     .5162043    45.34634
             |
    1.cancer |   4.58e-19   3.37e-10    -0.00   1.000            0           .
1.~r_disease |   1.542876   .9370282     0.71   0.475     .4692176    5.073265
    1.stroke |   .6252895   .4863955    -0.60   0.546     .1361303    2.872152
  1.dementia |   .7410175   .4933797    -0.45   0.653     .2009494    2.732563
1.other_ne~o |   .2291189   .2396304    -1.41   0.159     .0294991    1.779564
             |
      egfr60 |
   eGFR <60  |   3.34e-19          .        .       .            .           .
      1.esrf |   1.372593   .8262625     0.53   0.599     .4218348    4.466232
1.immunosu~d |   .2512129   .1941861    -1.79   0.074     .0552164     1.14292
1.ra_sle_p~s |   .9740214   .6540922    -0.04   0.969     .2611888    3.632307
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(51)      =       52.24
Log likelihood  =   -77.826812                  Prob > chi2      =      0.4254

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.870663   3.654854     0.83   0.408     .2367305    34.81049
Other White  |   2.87e-19   5.38e-10    -0.00   1.000            0           .
White + C..  |   3.720329   4.713404     1.04   0.300     .3105751    44.56521
White + A..  |   1.391448   2.030946     0.23   0.821      .079627    24.31497
White + A..  |   1.791003   2.652004     0.39   0.694     .0983312    32.62132
Other mixed  |   2.68e-19   5.92e-10    -0.00   1.000            0           .
     Indian  |   3.35e-19   7.06e-10    -0.00   1.000            0           .
  Pakistani  |   1.238488   1.799233     0.15   0.883     .0718281    21.35447
Bangladeshi  |   1.238748   1.803636     0.15   0.883     .0713872     21.4954
Other Asian  |   3.264316   4.174154     0.93   0.355      .266282    40.01682
  Caribbean  |   2.75e-19   6.16e-10    -0.00   1.000            0           .
    African  |   1.040686   1.523012     0.03   0.978     .0591034    18.32427
Other Black  |    1.72164    2.52677     0.37   0.711     .0969781    30.56404
    Chinese  |    1.40783   2.031648     0.24   0.813     .0832101    23.81905
      Other  |   1.345228   1.973319     0.20   0.840     .0758867    23.84658
    Unknown  |   .2334192   .3354562    -1.01   0.311     .0139585     3.90331
             |
        male |
       Male  |   1.043799   .5516464     0.08   0.935     .3704741     2.94087
        age1 |   1.039333   .0835985     0.48   0.631     .8877451    1.216804
        age2 |    .868375   .2385735    -0.51   0.607      .506818    1.487862
        age3 |   1.477413   1.045639     0.55   0.581     .3690322    5.914795
             |
         imd |
          4  |   1.230504   .7566364     0.34   0.736     .3687051    4.106639
5 most de..  |   1.444496   1.172486     0.45   0.650     .2943083    7.089734
             |
   bmicat_sa |
Normal (..)  |   .2608298   .3775759    -0.93   0.353     .0152814    4.451972
Overweig..)  |   1.033128   1.181775     0.03   0.977     .1097694    9.723604
Obese I ..)  |   .1323161   .1916876    -1.40   0.163     .0077352    2.263375
Obese II..)  |    .433434   .5213107    -0.70   0.487     .0410341    4.578272
Obese II..)  |   .3387412   .4056993    -0.90   0.366       .03239    3.542619
    Unknown  |   .2998163   .3832589    -0.94   0.346     .0244768    3.672456
             |
    hba1ccat |
  >=6.5-7.4  |   .9394966   .7510286    -0.08   0.938     .1960872    4.501334
  >=7.5-7.9  |   2.882618   2.459636     1.24   0.215     .5413606    15.34926
    >=8-8.9  |    2.47654   2.056872     1.09   0.275     .4862798     12.6126
        >=9  |   2.324162    2.59905     0.75   0.451     .2596508    20.80382
    Unknown  |   7.32e-19          .        .       .            .           .
             |
gp_consult~t |   1.131479   .1229465     1.14   0.256     .9144392    1.400032
             |
smoke_nomiss |
     Former  |   2.575962   2.905416     0.84   0.402     .2824055    23.49664
    Current  |   1.139204   .9128286     0.16   0.871     .2368894    5.478449
             |
1.hyperten~n |   3.28e-19   2.65e-10    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   4.17e+07   3.32e+07    21.99   0.000      8720950    1.99e+08
    Unknown  |   6.60e+07          .        .       .            .           .
             |
    1.asthma |   1.860652   2.023916     0.57   0.568     .2206858    15.68757
1.~y_disease |   1.450321   .8862685     0.61   0.543     .4378326    4.804189
1.~c_disease |   .5385246   .4190098    -0.80   0.426     .1171956    2.474571
             |
     dm_type |
       T1DM  |   4.28e-19   1.16e-09    -0.00   1.000            0           .
       T2DM  |   .5033067    .393933    -0.88   0.380      .108544    2.333778
 UNKNOWN_DM  |   4.838179   5.523996     1.38   0.167     .5162043    45.34634
             |
    1.cancer |   4.58e-19   3.37e-10    -0.00   1.000            0           .
1.~r_disease |   1.542876   .9370282     0.71   0.475     .4692176    5.073265
    1.stroke |   .6252895   .4863955    -0.60   0.546     .1361303    2.872152
  1.dementia |   .7410175   .4933797    -0.45   0.653     .2009494    2.732563
1.other_ne~o |   .2291189   .2396304    -1.41   0.159     .0294991    1.779564
             |
      egfr60 |
   eGFR <60  |   3.34e-19          .        .       .            .           .
      1.esrf |   1.372593   .8262625     0.53   0.599     .4218348    4.466232
1.immunosu~d |   .2512129   .1941861    -1.79   0.074     .0552164     1.14292
1.ra_sle_p~s |   .9740214   .6540922    -0.04   0.969     .2611888    3.632307
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_onsdeath_eth16.ster not found)
file ./output/model/model2_onsdeath_eth16.ster saved
(note: file ./output/model/model2_onsdeath_eth16.dta not found)
file ./output/model/model2_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(54)      =       53.03
Log likelihood  =   -77.435258                  Prob > chi2      =      0.5120

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.880089   3.676575     0.83   0.407     .2359421    35.15656
Other White  |   3.08e-16   1.74e-08    -0.00   1.000            0           .
White + C..  |   3.796572   4.816204     1.05   0.293     .3159263    45.62443
White + A..  |   1.377708   2.011731     0.22   0.826     .0787465    24.10365
White + A..  |   1.783449   2.644063     0.39   0.696     .0975679    32.59977
Other mixed  |   2.98e-16   2.00e-08    -0.00   1.000            0           .
     Indian  |   3.88e-16   2.45e-08    -0.00   1.000            0           .
  Pakistani  |    1.30114   1.893036     0.18   0.856      .075146    22.52901
Bangladeshi  |    1.23829   1.804522     0.15   0.883     .0711858     21.5403
Other Asian  |   3.268537     4.1813     0.93   0.355     .2663469     40.1106
  Caribbean  |   3.03e-16   2.05e-08    -0.00   1.000            0           .
    African  |    1.02204   1.496924     0.01   0.988      .057911    18.03743
Other Black  |   1.763068   2.593446     0.39   0.700     .0986654    31.50455
    Chinese  |   1.462229   2.114389     0.26   0.793     .0859359    24.88033
      Other  |    1.33034   1.951308     0.19   0.846     .0750659    23.57669
    Unknown  |   .2363005   .3399256    -1.00   0.316     .0140924    3.962276
             |
        male |
       Male  |   1.039255   .5491243     0.07   0.942     .3689452    2.927401
        age1 |   1.038024   .0829913     0.47   0.641     .8874679    1.214121
        age2 |   .8711109   .2379655    -0.51   0.613     .5099723    1.487991
        age3 |   1.465213   1.032104     0.54   0.588     .3683912     5.82763
             |
         imd |
          4  |   1.203016   .7406983     0.30   0.764      .359903    4.021214
5 most de..  |   1.416575   1.150132     0.43   0.668     .2884966    6.955665
             |
   bmicat_sa |
Normal (..)  |   .2776183   .4024158    -0.88   0.377     .0162034     4.75652
Overweig..)  |   1.054379   1.206014     0.05   0.963     .1120419    9.922323
Obese I ..)  |    .137531   .1990075    -1.37   0.170      .008067    2.344715
Obese II..)  |   .4485825    .539113    -0.67   0.505     .0425457    4.729647
Obese II..)  |   .3384089   .4051668    -0.90   0.365     .0323835    3.536386
    Unknown  |   .2987295   .3819855    -0.94   0.345     .0243695    3.661928
             |
    hba1ccat |
  >=6.5-7.4  |   .9441213   .7550964    -0.07   0.943     .1969008    4.526976
  >=7.5-7.9  |   2.949374   2.523094     1.26   0.206     .5515113    15.77267
    >=8-8.9  |   2.430944   2.019737     1.07   0.285     .4770441    12.38772
        >=9  |   2.322846   2.597333     0.75   0.451     .2595576    20.78773
    Unknown  |   2.82e-16   6.66e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.137454    .124147     1.18   0.238     .9183952    1.408763
             |
smoke_nomiss |
     Former  |   2.530667    2.85593     0.82   0.411     .2770957    23.11214
    Current  |   1.113381    .892535     0.13   0.893     .2313575    5.358019
             |
1.hyperten~n |   3.50e-16   8.56e-09    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   4.41e+07   3.55e+07    21.87   0.000      9099641    2.13e+08
    Unknown  |   7.15e+07          .        .       .            .           .
             |
    1.asthma |   1.819356   1.980809     0.55   0.583     .2153671    15.36937
1.~y_disease |   1.411149   .8620896     0.56   0.573     .4261503    4.672864
1.~c_disease |   .5248949   .4091664    -0.83   0.408     .1139051    2.418808
             |
     dm_type |
       T1DM  |   4.69e-16   3.83e-08    -0.00   1.000            0           .
       T2DM  |   .5023054   .3936788    -0.88   0.380     .1081045    2.333951
 UNKNOWN_DM  |   4.681748   5.342951     1.35   0.176     .5000247    43.83537
             |
    1.cancer |   4.93e-16   1.10e-08    -0.00   1.000            0           .
1.~r_disease |   1.545343   .9402424     0.72   0.474     .4689463    5.092448
    1.stroke |   .6197307   .4815991    -0.62   0.538     .1351219    2.842369
  1.dementia |   .7567034   .5049586    -0.42   0.676     .2046007    2.798622
1.other_ne~o |   .2281023   .2385997    -1.41   0.158       .02936    1.772164
             |
      egfr60 |
   eGFR <60  |   3.61e-16   4.30e-08    -0.00   1.000            0           .
      1.esrf |   1.365786   .8244914     0.52   0.606     .4183439    4.458944
1.immunosu~d |    .246637   .1909541    -1.81   0.071     .0540793    1.124826
1.ra_sle_p~s |   .9855045   .6607501    -0.02   0.983     .2648222    3.667438
             |
hh_total_cat |
       6-10  |   2.50e+15          .        .       .            .           .
        11+  |   .7488791   2.89e+08    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_onsdeath_eth16.ster not found)
file ./output/model/model3_onsdeath_eth16.ster saved
(note: file ./output/model/model3_onsdeath_eth16.dta not found)
file ./output/model/model3_onsdeath_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)

. 
. file close tablecontent

. 
. ************************************************create forestplot dataset
. dsconcat `hr'

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. split idstr, p(_)
variables created as string: 
idstr1  idstr2  idstr3  idstr4

. ren idstr1 model

. ren idstr2 outcome

. drop idstr idstr3

. tab model

      model |      Freq.     Percent        Cum.
------------+-----------------------------------
      crude |        119        7.83        7.83
     model0 |        154       10.14       17.97
     model1 |        175       11.52       29.49
     model2 |        525       34.56       64.06
     model3 |        546       35.94      100.00
------------+-----------------------------------
      Total |      1,519      100.00

. 
. *save dataset for later
. outsheet using ./output/FP_multivariable_eth16.txt, replace
(note: file ./output/FP_multivariable_eth16.txt not found)

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/04a_eth_an_multivariable_eth16.log
  log type:  text
 closed on:   6 Jan 2021, 12:16:15
-------------------------------------------------------------------------------
