-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04a_eth_an_multivariable_eth16.log
  log type:  text
 opened on:   6 Jan 2021, 13:52:30

. 
. cap file close tablecontent

. file open tablecontent using ./output/table2_eth16.txt, write text replace
(note: file ./output/table2_eth16.txt not found)

. file write tablecontent ("Table 2: Association between ethnicity in 16 catego
> ries and COVID-19 outcomes - No care homes") _n

. file write tablecontent _tab ("Denominator") _tab ("Event") _tab ("Total pers
> on-weeks") _tab ("Rate per 1,000") _tab ("Crude") _tab _tab ("Age/Sex Adjuste
> d") _tab _tab ("Age/Sex/IMD Adjusted") _tab _tab      ("plus co-morbidities")
>  _tab _tab       ("plus hh siz")  _tab _tab  _n

. file write tablecontent _tab _tab _tab _tab _tab   ("HR") _tab ("95% CI") _ta
> b ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% C
> I") _tab ("HR") _tab ("95% CI") _tab _tab _n

. 
. 
. 
. foreach i of global outcomes {
  2. use ./output/analysis_dataset_STSET_`i'.dta, clear
  3. drop if carehome==1
  4. safetab ethnicity_16 `i', missing row
  5. } //end outcomes
(11,899 observations deleted)

**TABLE OF ethnicity_16 tested REDACTED DUE TO SMALL N**

(11,899 observations deleted)

**TABLE OF ethnicity_16 positivetest REDACTED DUE TO SMALL N**

(11,899 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |  outcome
                  |    icu
Eth 16 categories |         0 |     Total
------------------+-----------+----------
          British |     3,161 |     3,161 
                  |    100.00 |    100.00 
------------------+-----------+----------
            Irish |     3,153 |     3,153 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Other White |     3,156 |     3,156 
                  |    100.00 |    100.00 
------------------+-----------+----------
White + Caribbean |     3,207 |     3,207 
                  |    100.00 |    100.00 
------------------+-----------+----------
  White + African |     3,248 |     3,248 
                  |    100.00 |    100.00 
------------------+-----------+----------
    White + Asian |     3,169 |     3,169 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Other mixed |     3,101 |     3,101 
                  |    100.00 |    100.00 
------------------+-----------+----------
           Indian |     3,116 |     3,116 
                  |    100.00 |    100.00 
------------------+-----------+----------
        Pakistani |     3,253 |     3,253 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Bangladeshi |     3,138 |     3,138 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Other Asian |     3,120 |     3,120 
                  |    100.00 |    100.00 
------------------+-----------+----------
        Caribbean |     3,061 |     3,061 
                  |    100.00 |    100.00 
------------------+-----------+----------
          African |     3,082 |     3,082 
                  |    100.00 |    100.00 
------------------+-----------+----------
      Other Black |     3,029 |     3,029 
                  |    100.00 |    100.00 
------------------+-----------+----------
          Chinese |     3,091 |     3,091 
                  |    100.00 |    100.00 
------------------+-----------+----------
            Other |     3,161 |     3,161 
                  |    100.00 |    100.00 
------------------+-----------+----------
          Unknown |    16,658 |    16,658 
                  |    100.00 |    100.00 
------------------+-----------+----------
            Total |    66,904 |    66,904 
                  |    100.00 |    100.00 
(11,899 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |      outcome hes
Eth 16 categories |         0          1 |     Total
------------------+----------------------+----------
          British |     2,754        407 |     3,161 
                  |     87.12      12.88 |    100.00 
------------------+----------------------+----------
            Irish |     2,717        436 |     3,153 
                  |     86.17      13.83 |    100.00 
------------------+----------------------+----------
      Other White |     2,718        438 |     3,156 
                  |     86.12      13.88 |    100.00 
------------------+----------------------+----------
White + Caribbean |     2,781        426 |     3,207 
                  |     86.72      13.28 |    100.00 
------------------+----------------------+----------
  White + African |     2,784        464 |     3,248 
                  |     85.71      14.29 |    100.00 
------------------+----------------------+----------
    White + Asian |     2,720        449 |     3,169 
                  |     85.83      14.17 |    100.00 
------------------+----------------------+----------
      Other mixed |     2,700        401 |     3,101 
                  |     87.07      12.93 |    100.00 
------------------+----------------------+----------
           Indian |     2,692        424 |     3,116 
                  |     86.39      13.61 |    100.00 
------------------+----------------------+----------
        Pakistani |     2,776        477 |     3,253 
                  |     85.34      14.66 |    100.00 
------------------+----------------------+----------
      Bangladeshi |     2,697        441 |     3,138 
                  |     85.95      14.05 |    100.00 
------------------+----------------------+----------
      Other Asian |     2,705        415 |     3,120 
                  |     86.70      13.30 |    100.00 
------------------+----------------------+----------
        Caribbean |     2,676        385 |     3,061 
                  |     87.42      12.58 |    100.00 
------------------+----------------------+----------
          African |     2,657        425 |     3,082 
                  |     86.21      13.79 |    100.00 
------------------+----------------------+----------
      Other Black |     2,633        396 |     3,029 
                  |     86.93      13.07 |    100.00 
------------------+----------------------+----------
          Chinese |     2,694        397 |     3,091 
                  |     87.16      12.84 |    100.00 
------------------+----------------------+----------
            Other |     2,770        391 |     3,161 
                  |     87.63      12.37 |    100.00 
------------------+----------------------+----------
          Unknown |    14,336      2,322 |    16,658 
                  |     86.06      13.94 |    100.00 
------------------+----------------------+----------
            Total |    57,810      9,094 |    66,904 
                  |     86.41      13.59 |    100.00 
(11,899 observations deleted)

**TABLE OF ethnicity_16 onscoviddeath REDACTED DUE TO SMALL N**

(11,899 observations deleted)

**TABLE OF ethnicity_16 ons_noncoviddeath REDACTED DUE TO SMALL N**

(11,899 observations deleted)

**TABLE OF ethnicity_16 onsdeath REDACTED DUE TO SMALL N**


. 
. foreach i of global outcomes {
  2.         di "`i'"
  3.         
. * Open Stata dataset
. use ./output/analysis_dataset_STSET_`i'.dta, clear
  4. drop if carehome==1
  5. 
. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.ethnicity_16, strata(stp) nolog
  6. estimates save ./output/model/crude_`i'_eth16, replace 
  7. eststo model1
  8. parmest, label eform format(estimate p lb ub) saving(./output/model/crude_
> `i'_eth16, replace) idstr(crude_`i'_eth16) 
  9. local hr "`hr' ./output/model/crude_`i'_eth16 "
 10. 
. 
. /* Multivariable models */ 
. *Age and gender
. stcox i.ethnicity_16 i.male age1 age2 age3, strata(stp) nolog
 11. estimates save ./output/model/model0_`i'_eth16, replace 
 12. eststo model2
 13. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model0_`i
> '_eth16, replace) idstr(model0_`i'_eth16)
 14. local hr "`hr' ./output/model/model0_`i'_eth16 "
 15.  
. 
. * Age, Gender, IMD
. 
. stcox i.ethnicity_16 i.male age1 age2 age3 i.imd, strata(stp) nolog
 16. if _rc==0{
 17. estimates
 18. estimates save ./output/model/model1_`i'_eth16, replace 
 19. eststo model3
 20. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model1_`i
> '_eth16, replace) idstr(model1_`i'_eth16) 
 21. local hr "`hr' ./output/model/model1_`i'_eth16 "
 22. }
 23. else di "WARNING MODEL1 DID NOT FIT (OUTCOME `i')"
 24. 
. * Age, Gender, IMD and Comorbidities 
. stcox i.ethnicity_16 i.male age1 age2 age3      i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis, strata(stp) nolog           
 25. if _rc==0{
 26. estimates
 27. estimates save ./output/model/model2_`i'_eth16, replace 
 28. eststo model4
 29. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model2_`i
> '_eth16, replace) idstr(model2_`i'_eth16) 
 30. local hr "`hr' ./output/model/model2_`i'_eth16 "
 31. }
 32. else di "WARNING MODEL2 DID NOT FIT (OUTCOME `i')"
 33. 
.                                                                              
>    
. * Age, Gender, IMD and Comorbidities  and household size 
. stcox i.ethnicity_16 i.male age1 age2 age3      i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis                      ///
>                                                                              
>    i.hh_total_cat, strata(stp) nolog               
 34. estimates save ./output/model/model3_`i'_eth16, replace
 35. eststo model5
 36. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model3_`i
> '_eth16, replace) idstr(model3_`i'_eth16) 
 37. local hr "`hr' ./output/model/model3_`i'_eth16 "
 38. 
. 
. 
. /* Estout================================================================*/ 
. esttab model1 model2 model3 model4 model5 using ./output/estout_table2_eth16.
> txt, b(a2) ci(2) label wide compress eform ///
>         title ("`i'") ///
>         varlabels(`e(labels)') ///
>         stats(N_sub) ///
>         append 
 39. eststo clear
 40. 
.                                                                              
>    
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("`i'") _n
 41. 
. * eth16 labelled columns
. 
. local lab1: label ethnicity_16 1
 42. local lab2: label ethnicity_16 2
 43. local lab3: label ethnicity_16 3
 44. local lab4: label ethnicity_16 4
 45. local lab5: label ethnicity_16 5
 46. local lab6: label ethnicity_16 6
 47. local lab7: label ethnicity_16 7
 48. local lab8: label ethnicity_16 8
 49. local lab9: label ethnicity_16 9
 50. local lab10: label ethnicity_16 10
 51. local lab11: label ethnicity_16 11
 52. local lab12: label ethnicity_16 12
 53. local lab13: label ethnicity_16 13
 54. local lab14: label ethnicity_16 14
 55. local lab15: label ethnicity_16 15
 56. local lab16: label ethnicity_16 16
 57. local lab17: label ethnicity_16 17
 58. 
. /* counts */
.  
. * First row, eth16 = 1 (White British) reference cat
.         qui safecount if ethnicity_16==1
 59.         local denominator = r(N)
 60.         qui safecount if ethnicity_16 == 1 & `i' == 1
 61.         local event = r(N)
 62.     bysort eth16: egen total_follow_up = total(_t)
 63.         qui su total_follow_up if ethnicity_16 == 1
 64.         local person_week = r(mean)/7
 65.         local rate = 1000*(`event'/`person_week')
 66.         
.         file write tablecontent  ("`lab1'") _tab (`denominator') _tab (`event
> ') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab
 67.         file write tablecontent ("1.00") _tab _tab ("1.00") _tab _tab ("1.
> 00")  _tab _tab ("1.00") _tab _tab ("1.00") _n
 68.         
. * Subsequent ethnic groups
. forvalues eth=2/17 {
 69.         qui safecount if ethnicity_16==`eth'
 70.         local denominator = r(N)
 71.         qui safecount if ethnicity_16 == `eth' & `i' == 1
 72.         local event = r(N)
 73.         qui su total_follow_up if ethnicity_16 == `eth'
 74.         local person_week = r(mean)/7
 75.         local rate = 1000*(`event'/`person_week')
 76.         file write tablecontent  ("`lab`eth''") _tab (`denominator') _tab 
> (`event') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab  
 77.         cap estimates use ./output/model/crude_`i'_eth16 
 78.          cap lincom `eth'.ethnicity_16, eform
 79.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 80.         cap estimates clear
 81.         cap estimates use ./output/model/model0_`i'_eth16 
 82.          cap lincom `eth'.ethnicity_16, eform
 83.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 84.         cap estimates clear
 85.         cap estimates use ./output/model/model1_`i'_eth16 
 86.          cap lincom `eth'.ethnicity_16, eform
 87.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 88.         cap estimates clear
 89.         cap estimates use ./output/model/model2_`i'_eth16 
 90.          cap lincom `eth'.ethnicity_16, eform
 91.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 92.         cap estimates clear
 93.         cap estimates use ./output/model/model3_`i'_eth16 
 94.          cap lincom `eth'.ethnicity_16, eform
 95.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _n
 96. }  //end ethnic group
 97. 
. 
. } //end outcomes
tested
(11,899 observations deleted)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(16)      =       10.10
Log likelihood  =   -1333.3594                  Prob > chi2      =      0.8612

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.403322     .82174     0.58   0.563     .4453701    4.421743
Other White  |   1.198404   .7257133     0.30   0.765      .365716    3.927014
White + C..  |   .9852736   .6231729    -0.02   0.981     .2852219     3.40354
White + A..  |   .9749042   .6166057    -0.04   0.968      .282225    3.367661
White + A..  |   1.201083   .7273395     0.30   0.762     .3665315    3.935817
Other mixed  |   1.639845   .9349185     0.87   0.386     .5364268     5.01297
     Indian  |   1.014981   .6419477     0.02   0.981     .2938299    3.506062
  Pakistani  |   1.362091   .7975811     0.53   0.598     .4322941    4.291733
Bangladeshi  |   2.618581   1.378099     1.83   0.067     .9334659    7.345708
Other Asian  |   2.011382   1.101738     1.28   0.202     .6874595    5.884937
  Caribbean  |   1.858511   1.036683     1.11   0.267     .6228198    5.545846
    African  |   1.230447   .7450876     0.34   0.732     .3755123    4.031823
Other Black  |   1.461017   .8555394     0.65   0.517     .4636717    4.603627
    Chinese  |   1.021961   .6463544     0.03   0.973     .2958551    3.530119
      Other  |   1.595508   .9096657     0.82   0.413     .5219074    4.877581
    Unknown  |   1.515712   .7189966     0.88   0.381     .5981898    3.840561
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/crude_tested_eth16.ster saved
file ./output/model/crude_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(20)      =       16.05
Log likelihood  =    -1330.384                  Prob > chi2      =      0.7133

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.400593     .82015     0.58   0.565     .4444995    4.413193
Other White  |   1.201488   .7275795     0.30   0.762     .3666583     3.93711
White + C..  |   .9837143   .6222053    -0.03   0.979     .2847599     3.39828
White + A..  |   .9782818   .6187468    -0.03   0.972        .2832    3.379361
White + A..  |   1.197491   .7251796     0.30   0.766     .3654263    3.924144
Other mixed  |   1.630713   .9297511     0.86   0.391     .5334149    4.985287
     Indian  |   1.012689   .6405118     0.02   0.984     .2931588    3.498238
  Pakistani  |   1.364963   .7992853     0.53   0.595     .4331918     4.30092
Bangladeshi  |   2.601216   1.369011     1.82   0.069     .9272395    7.297279
Other Asian  |    2.01863   1.105731     1.28   0.200     .6899215    5.906274
  Caribbean  |   1.850345   1.032156     1.10   0.270     .6200647    5.521644
    African  |   1.227521   .7433479     0.34   0.735     .3746001    4.022441
Other Black  |   1.451799   .8501476     0.64   0.524     .4607426    4.574619
    Chinese  |   1.019733   .6449609     0.03   0.975     .2952011    3.522529
      Other  |   1.596552   .9102675     0.82   0.412     .5222446    4.880812
    Unknown  |   1.516645   .7194471     0.88   0.380     .5985516    3.842964
             |
        male |
       Male  |   1.337656   .2185756     1.78   0.075     .9710832    1.842606
        age1 |   .9685935   .0211023    -1.46   0.143     .9281044    1.010849
        age2 |   1.142589   .0928161     1.64   0.101     .9744153    1.339787
        age3 |   .6979448   .1516037    -1.66   0.098     .4559611    1.068352
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/model0_tested_eth16.ster saved
file ./output/model/model0_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(22)      =       16.20
Log likelihood  =   -1330.3117                  Prob > chi2      =      0.8060

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.400354   .8200089     0.58   0.565     .4444241    4.412433
Other White  |   1.201234   .7274251     0.30   0.762     .3665807    3.936275
White + C..  |   .9845259   .6227226    -0.02   0.980     .2849926    3.401111
White + A..  |   .9785454   .6189164    -0.03   0.973     .2832747    3.380292
White + A..  |   1.197742   .7253395     0.30   0.766     .3654979    3.925018
Other mixed  |   1.629106   .9288534     0.86   0.392     .5328768    4.980485
     Indian  |   1.012243   .6402314     0.02   0.985     .2930286    3.496708
  Pakistani  |   1.365354   .7995166     0.53   0.595     .4333147    4.302167
Bangladeshi  |   2.600025   1.368396     1.82   0.069     .9268073       7.294
Other Asian  |   2.017687   1.105227     1.28   0.200     .6895912    5.903587
  Caribbean  |   1.850024   1.031986     1.10   0.270     .6199516    5.520738
    African  |   1.227604   .7434027     0.34   0.735     .3746231    4.022742
Other Black  |   1.452118    .850336     0.64   0.524     .4608424    4.575634
    Chinese  |   1.020033   .6451722     0.03   0.975     .2952761    3.523711
      Other  |   1.595244   .9095286     0.82   0.413     .5218122    4.876855
    Unknown  |   1.516104    .719192     0.88   0.380      .598337    3.841601
             |
        male |
       Male  |   1.337428   .2185409     1.78   0.075     .9709141    1.842299
        age1 |   .9686088   .0211034    -1.46   0.143     .9281176    1.010867
        age2 |   1.142551    .092817     1.64   0.101     .9743764    1.339752
        age3 |   .6979947   .1516224    -1.66   0.098     .4559836    1.068452
             |
         imd |
          4  |   .9635118   .1988955    -0.18   0.857      .642903    1.444005
5 most de..  |   .9040368   .2568329    -0.36   0.723     .5180402    1.577643
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(22)      =       16.20
Log likelihood  =   -1330.3117                  Prob > chi2      =      0.8060

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.400354   .8200089     0.58   0.565     .4444241    4.412433
Other White  |   1.201234   .7274251     0.30   0.762     .3665807    3.936275
White + C..  |   .9845259   .6227226    -0.02   0.980     .2849926    3.401111
White + A..  |   .9785454   .6189164    -0.03   0.973     .2832747    3.380292
White + A..  |   1.197742   .7253395     0.30   0.766     .3654979    3.925018
Other mixed  |   1.629106   .9288534     0.86   0.392     .5328768    4.980485
     Indian  |   1.012243   .6402314     0.02   0.985     .2930286    3.496708
  Pakistani  |   1.365354   .7995166     0.53   0.595     .4333147    4.302167
Bangladeshi  |   2.600025   1.368396     1.82   0.069     .9268073       7.294
Other Asian  |   2.017687   1.105227     1.28   0.200     .6895912    5.903587
  Caribbean  |   1.850024   1.031986     1.10   0.270     .6199516    5.520738
    African  |   1.227604   .7434027     0.34   0.735     .3746231    4.022742
Other Black  |   1.452118    .850336     0.64   0.524     .4608424    4.575634
    Chinese  |   1.020033   .6451722     0.03   0.975     .2952761    3.523711
      Other  |   1.595244   .9095286     0.82   0.413     .5218122    4.876855
    Unknown  |   1.516104    .719192     0.88   0.380      .598337    3.841601
             |
        male |
       Male  |   1.337428   .2185409     1.78   0.075     .9709141    1.842299
        age1 |   .9686088   .0211034    -1.46   0.143     .9281176    1.010867
        age2 |   1.142551    .092817     1.64   0.101     .9743764    1.339752
        age3 |   .6979947   .1516224    -1.66   0.098     .4559836    1.068452
             |
         imd |
          4  |   .9635118   .1988955    -0.18   0.857      .642903    1.444005
5 most de..  |   .9040368   .2568329    -0.36   0.723     .5180402    1.577643
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/model1_tested_eth16.ster saved
file ./output/model/model1_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(54)      =       42.78
Log likelihood  =   -1317.0197                  Prob > chi2      =      0.8642

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.381053   .8088623     0.55   0.581     .4382019    4.352577
Other White  |   1.210609   .7332893     0.32   0.752     .3693302    3.968196
White + C..  |    .987629   .6248166    -0.02   0.984     .2858164    3.412719
White + A..  |   .9786515   .6190721    -0.03   0.973     .2832551    3.381258
White + A..  |   1.202499   .7283269     0.30   0.761     .3668856    3.941292
Other mixed  |   1.634631   .9322462     0.86   0.389     .5345286     4.99883
     Indian  |   .9979294   .6312862    -0.00   0.997     .2888239    3.447995
  Pakistani  |   1.358578   .7956821     0.52   0.601     .4310813     4.28164
Bangladeshi  |   2.594933   1.366008     1.81   0.070     .9247877    7.281322
Other Asian  |   1.996758   1.094002     1.26   0.207     .6822782    5.843721
  Caribbean  |   1.876497   1.046947     1.13   0.259     .6286951    5.600872
    African  |   1.229935   .7449391     0.34   0.733     .3752596    4.031182
Other Black  |   1.469695   .8608572     0.66   0.511     .4662787     4.63243
    Chinese  |   1.020272   .6455068     0.03   0.975     .2952414    3.525779
      Other  |   1.606114   .9160487     0.83   0.406     .5251615    4.912018
    Unknown  |   1.529561   .7256923     0.90   0.370     .6035575    3.876278
             |
        male |
       Male  |   1.346776   .2218196     1.81   0.071     .9752115    1.859909
        age1 |   .9727781   .0218866    -1.23   0.220     .9308132    1.016635
        age2 |      1.129   .0932969     1.47   0.142     .9601813      1.3275
        age3 |   .7176494   .1579508    -1.51   0.132     .4661948    1.104733
             |
         imd |
          4  |    .966535   .1995894    -0.16   0.869     .6448289    1.448741
5 most de..  |   .9033262   .2567148    -0.36   0.721     .5175389     1.57669
             |
   bmicat_sa |
Normal (..)  |   1.736198   1.312857     0.73   0.466     .3944099    7.642765
Overweig..)  |   1.515574    1.12994     0.56   0.577     .3515294    6.534204
Obese I ..)  |   2.111819   1.538311     1.03   0.305     .5065434    8.804341
Obese II..)  |   1.616563   1.188237     0.65   0.513     .3827601    6.827455
Obese II..)  |   1.403938   1.026676     0.46   0.643     .3348719    5.885961
    Unknown  |   1.901658   1.393814     0.88   0.381     .4521132    7.998666
             |
    hba1ccat |
  >=6.5-7.4  |   .9558616   .2154391    -0.20   0.841     .6145327    1.486774
  >=7.5-7.9  |   .9391752   .3280556    -0.18   0.857     .4736095    1.862399
    >=8-8.9  |   1.580516   .4072686     1.78   0.076     .9538077     2.61901
        >=9  |    1.06766   .4186835     0.17   0.867     .4950329    2.302672
    Unknown  |   1.14e-17   4.23e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9241878   .0343725    -2.12   0.034     .8592158    .9940728
             |
smoke_nomiss |
     Former  |   1.000841   .5846576     0.00   0.999     .3185094    3.144911
    Current  |   .9140711   .2357015    -0.35   0.728     .5514295      1.5152
             |
1.hyperten~n |   .9434936   .1948764    -0.28   0.778     .6293979    1.414336
             |
      bp_cat |
High, sta..  |   3.74e-10   .2491355    -0.00   1.000            0           .
High, sta..  |   3.28e+07    8664627    65.44   0.000     1.95e+07    5.50e+07
    Unknown  |   3.49e+07          .        .       .            .           .
             |
    1.asthma |   1.137788   .4405603     0.33   0.739     .5326841    2.430262
1.~y_disease |   1.157849   .2255353     0.75   0.452     .7904019    1.696118
1.~c_disease |   .7516856   .1673094    -1.28   0.200     .4859332    1.162775
             |
     dm_type |
       T1DM  |   .6768542    .396079    -0.67   0.505     .2149771    2.131072
       T2DM  |   1.175074   .2274688     0.83   0.405     .8040649    1.717273
 UNKNOWN_DM  |   .3263361   .3278242    -1.11   0.265     .0455598    2.337482
             |
    1.cancer |   1.026647   .2067857     0.13   0.896     .6917889    1.523593
1.~r_disease |   1.223335   .2358761     1.05   0.296     .8383432    1.785126
    1.stroke |   .9019634   .1887987    -0.49   0.622     .5984332    1.359447
  1.dementia |   .9972649   .2033229    -0.01   0.989      .668755    1.487147
1.other_ne~o |   1.255196   .2396282     1.19   0.234     .8633949    1.824793
             |
      egfr60 |
   eGFR <60  |   1.243573   .9047134     0.30   0.764     .2988222    5.175234
      1.esrf |   .7591357   .1689406    -1.24   0.216     .4907838    1.174218
1.immunosu~d |   1.304121   .2143745     1.62   0.106     .9449204    1.799867
1.ra_sle_p~s |   .8972039   .1878308    -0.52   0.604     .5952385    1.352357
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(54)      =       42.78
Log likelihood  =   -1317.0197                  Prob > chi2      =      0.8642

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.381053   .8088623     0.55   0.581     .4382019    4.352577
Other White  |   1.210609   .7332893     0.32   0.752     .3693302    3.968196
White + C..  |    .987629   .6248166    -0.02   0.984     .2858164    3.412719
White + A..  |   .9786515   .6190721    -0.03   0.973     .2832551    3.381258
White + A..  |   1.202499   .7283269     0.30   0.761     .3668856    3.941292
Other mixed  |   1.634631   .9322462     0.86   0.389     .5345286     4.99883
     Indian  |   .9979294   .6312862    -0.00   0.997     .2888239    3.447995
  Pakistani  |   1.358578   .7956821     0.52   0.601     .4310813     4.28164
Bangladeshi  |   2.594933   1.366008     1.81   0.070     .9247877    7.281322
Other Asian  |   1.996758   1.094002     1.26   0.207     .6822782    5.843721
  Caribbean  |   1.876497   1.046947     1.13   0.259     .6286951    5.600872
    African  |   1.229935   .7449391     0.34   0.733     .3752596    4.031182
Other Black  |   1.469695   .8608572     0.66   0.511     .4662787     4.63243
    Chinese  |   1.020272   .6455068     0.03   0.975     .2952414    3.525779
      Other  |   1.606114   .9160487     0.83   0.406     .5251615    4.912018
    Unknown  |   1.529561   .7256923     0.90   0.370     .6035575    3.876278
             |
        male |
       Male  |   1.346776   .2218196     1.81   0.071     .9752115    1.859909
        age1 |   .9727781   .0218866    -1.23   0.220     .9308132    1.016635
        age2 |      1.129   .0932969     1.47   0.142     .9601813      1.3275
        age3 |   .7176494   .1579508    -1.51   0.132     .4661948    1.104733
             |
         imd |
          4  |    .966535   .1995894    -0.16   0.869     .6448289    1.448741
5 most de..  |   .9033262   .2567148    -0.36   0.721     .5175389     1.57669
             |
   bmicat_sa |
Normal (..)  |   1.736198   1.312857     0.73   0.466     .3944099    7.642765
Overweig..)  |   1.515574    1.12994     0.56   0.577     .3515294    6.534204
Obese I ..)  |   2.111819   1.538311     1.03   0.305     .5065434    8.804341
Obese II..)  |   1.616563   1.188237     0.65   0.513     .3827601    6.827455
Obese II..)  |   1.403938   1.026676     0.46   0.643     .3348719    5.885961
    Unknown  |   1.901658   1.393814     0.88   0.381     .4521132    7.998666
             |
    hba1ccat |
  >=6.5-7.4  |   .9558616   .2154391    -0.20   0.841     .6145327    1.486774
  >=7.5-7.9  |   .9391752   .3280556    -0.18   0.857     .4736095    1.862399
    >=8-8.9  |   1.580516   .4072686     1.78   0.076     .9538077     2.61901
        >=9  |    1.06766   .4186835     0.17   0.867     .4950329    2.302672
    Unknown  |   1.14e-17   4.23e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9241878   .0343725    -2.12   0.034     .8592158    .9940728
             |
smoke_nomiss |
     Former  |   1.000841   .5846576     0.00   0.999     .3185094    3.144911
    Current  |   .9140711   .2357015    -0.35   0.728     .5514295      1.5152
             |
1.hyperten~n |   .9434936   .1948764    -0.28   0.778     .6293979    1.414336
             |
      bp_cat |
High, sta..  |   3.74e-10   .2491355    -0.00   1.000            0           .
High, sta..  |   3.28e+07    8664627    65.44   0.000     1.95e+07    5.50e+07
    Unknown  |   3.49e+07          .        .       .            .           .
             |
    1.asthma |   1.137788   .4405603     0.33   0.739     .5326841    2.430262
1.~y_disease |   1.157849   .2255353     0.75   0.452     .7904019    1.696118
1.~c_disease |   .7516856   .1673094    -1.28   0.200     .4859332    1.162775
             |
     dm_type |
       T1DM  |   .6768542    .396079    -0.67   0.505     .2149771    2.131072
       T2DM  |   1.175074   .2274688     0.83   0.405     .8040649    1.717273
 UNKNOWN_DM  |   .3263361   .3278242    -1.11   0.265     .0455598    2.337482
             |
    1.cancer |   1.026647   .2067857     0.13   0.896     .6917889    1.523593
1.~r_disease |   1.223335   .2358761     1.05   0.296     .8383432    1.785126
    1.stroke |   .9019634   .1887987    -0.49   0.622     .5984332    1.359447
  1.dementia |   .9972649   .2033229    -0.01   0.989      .668755    1.487147
1.other_ne~o |   1.255196   .2396282     1.19   0.234     .8633949    1.824793
             |
      egfr60 |
   eGFR <60  |   1.243573   .9047134     0.30   0.764     .2988222    5.175234
      1.esrf |   .7591357   .1689406    -1.24   0.216     .4907838    1.174218
1.immunosu~d |   1.304121   .2143745     1.62   0.106     .9449204    1.799867
1.ra_sle_p~s |   .8972039   .1878308    -0.52   0.604     .5952385    1.352357
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/model2_tested_eth16.ster saved
file ./output/model/model2_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(56)      =       44.76
Log likelihood  =   -1316.0308                  Prob > chi2      =      0.8596

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.378883   .8075903     0.55   0.583     .4375141    4.345731
Other White  |   1.207276    .731275     0.31   0.756     .3683106      3.9573
White + C..  |   .9851916   .6232749    -0.02   0.981     .2851108    3.404299
White + A..  |    .974482    .616453    -0.04   0.967     .2820379    3.366977
White + A..  |   1.200311   .7270013     0.30   0.763     .3662181    3.934118
Other mixed  |   1.631042   .9302054     0.86   0.391     .5333512    4.987891
     Indian  |   .9938043    .628693    -0.01   0.992     .2876207    3.433852
  Pakistani  |   1.349546   .7904351     0.51   0.609     .4281888    4.253439
Bangladeshi  |   2.585447   1.361024     1.80   0.071     .9214004    7.254754
Other Asian  |   1.991879   1.091356     1.26   0.209     .6805927    5.829599
  Caribbean  |   1.870478   1.043599     1.12   0.262     .6266722    5.582965
    African  |   1.227085   .7432087     0.34   0.735     .3743928    4.021814
Other Black  |   1.466613   .8590432     0.65   0.513     .4653064    4.622662
    Chinese  |   1.016895   .6433999     0.03   0.979     .2942471     3.51431
      Other  |   1.598453   .9117082     0.82   0.411      .522638    4.888762
    Unknown  |   1.521139   .7217361     0.88   0.377     .6002034    3.855132
             |
        male |
       Male  |   1.347218   .2218937     1.81   0.070       .97553    1.860523
        age1 |   .9727598   .0218861    -1.23   0.220     .9307959    1.016616
        age2 |   1.128894   .0933017     1.47   0.142     .9600694    1.327407
        age3 |   .7177628   .1580135    -1.51   0.132     .4662204    1.105021
             |
         imd |
          4  |   .9671777   .1997301    -0.16   0.872     .6452473    1.449727
5 most de..  |   .9045068   .2570516    -0.35   0.724     .5182139    1.578754
             |
   bmicat_sa |
Normal (..)  |   1.732214   1.309845     0.73   0.467     .3935048    7.625232
Overweig..)  |   1.509495   1.125405     0.55   0.581     .3501211    6.507967
Obese I ..)  |   2.107008   1.534792     1.02   0.306     .5053964    8.784164
Obese II..)  |   1.612152   1.184987     0.65   0.516     .3817189    6.808763
Obese II..)  |   1.401915   1.025191     0.46   0.644     .3343919    5.877432
    Unknown  |   1.897435   1.390638     0.87   0.382     .4511466    7.980244
             |
    hba1ccat |
  >=6.5-7.4  |    .957152   .2157366    -0.19   0.846     .6153539    1.488802
  >=7.5-7.9  |   .9414703   .3288679    -0.17   0.863     .4747564    1.866992
    >=8-8.9  |    1.58002   .4071523     1.78   0.076     .9534941    2.618225
        >=9  |   1.065663   .4179104     0.16   0.871     .4940974    2.298407
    Unknown  |   3.45e-14   2.34e-07    -0.00   1.000            0           .
             |
gp_consult~t |   .9242931    .034378    -2.12   0.034     .8593108    .9941896
             |
smoke_nomiss |
     Former  |   .9935839   .5804813    -0.01   0.991     .3161602    3.122496
    Current  |   .9121725   .2352255    -0.36   0.721     .5502681    1.512097
             |
1.hyperten~n |   .9435243   .1948894    -0.28   0.778     .6294097    1.414402
             |
      bp_cat |
High, sta..  |   1.09e-06   13.38229    -0.00   1.000            0           .
High, sta..  |   3.26e+07    8613519    65.41   0.000     1.94e+07    5.47e+07
    Unknown  |   3.47e+07          .        .       .            .           .
             |
    1.asthma |    1.13688   .4402206     0.33   0.740     .5322475    2.428373
1.~y_disease |   1.159397   .2258453     0.76   0.448     .7914472     1.69841
1.~c_disease |   .7506186   .1670737    -1.29   0.197     .4852413     1.16113
             |
     dm_type |
       T1DM  |   .6783158   .3969321    -0.66   0.507     .2154426     2.13566
       T2DM  |   1.175614   .2275769     0.84   0.403     .8044298    1.718072
 UNKNOWN_DM  |   .3259576   .3274437    -1.12   0.264     .0455071    2.334766
             |
    1.cancer |   1.026261   .2067063     0.13   0.898     .6915304    1.523015
1.~r_disease |   1.222882   .2357954     1.04   0.297     .8380238    1.784484
    1.stroke |   .9020724   .1888223    -0.49   0.622     .5985045    1.359613
  1.dementia |   .9989272   .2036631    -0.01   0.996     .6698681     1.48963
1.other_ne~o |   1.257474   .2400686     1.20   0.230     .8649546    1.828121
             |
      egfr60 |
   eGFR <60  |   1.255532    .913521     0.31   0.754     .3016453    5.225878
      1.esrf |   .7600183   .1691402    -1.23   0.218     .4913504    1.175593
1.immunosu~d |   1.303407   .2142562     1.61   0.107     .9444045    1.798879
1.ra_sle_p~s |   .8988676   .1881843    -0.51   0.611     .5963354     1.35488
             |
hh_total_cat |
       6-10  |   .5742564   .2394102    -1.33   0.183     .2536506    1.300097
        11+  |   2.17e-14   2.31e-07    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/model3_tested_eth16.ster saved
file ./output/model/model3_tested_eth16.dta saved
(note: file ./output/estout_table2_eth16.txt not found)
(output written to ./output/estout_table2_eth16.txt)
positivetest
(11,899 observations deleted)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(16)      =       20.89
Log likelihood  =   -1301.6176                  Prob > chi2      =      0.1829

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .4417907   .2654942    -1.36   0.174     .1360463    1.434651
Other White  |   1.223125    .549815     0.45   0.654     .5068057    2.951889
White + C..  |   .8656452   .4206593    -0.30   0.767     .3339639     2.24378
White + A..  |   .2166067   .1693331    -1.96   0.050     .0467996     1.00254
White + A..  |   .4380309   .2632454    -1.37   0.170     .1348821    1.422509
Other mixed  |    .788838   .3975731    -0.47   0.638     .2937539    2.118322
     Indian  |   .8945232   .4346791    -0.23   0.819     .3451151    2.318565
  Pakistani  |   .5361588   .2990644    -1.12   0.264     .1796805    1.599874
Bangladeshi  |   1.109627   .5098904     0.23   0.821      .450855     2.73097
Other Asian  |   .5619416   .3134525    -1.03   0.301     .1883166    1.676848
  Caribbean  |   .4527287   .2720698    -1.32   0.187     .1394131    1.470186
    African  |   .5702468   .3180743    -1.01   0.314      .191107    1.701567
Other Black  |   1.503848   .6521843     0.94   0.347     .6427727    3.518443
    Chinese  |   1.016457   .4791746     0.03   0.972     .4034765    2.560704
      Other  |   .8832606    .429234    -0.26   0.798     .3407489    2.289514
    Unknown  |    .773711   .2875833    -0.69   0.490     .3734159    1.603115
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_positivetest_eth16.ster not found)
file ./output/model/crude_positivetest_eth16.ster saved
(note: file ./output/model/crude_positivetest_eth16.dta not found)
file ./output/model/crude_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(20)      =       23.16
Log likelihood  =   -1300.4818                  Prob > chi2      =      0.2810

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .4419854   .2656124    -1.36   0.174     .1361056    1.435291
Other White  |   1.221724   .5491964     0.45   0.656     .5062163    2.948561
White + C..  |   .8671998   .4214253    -0.29   0.769     .3345557    2.247864
White + A..  |   .2163658   .1691459    -1.96   0.050      .046747    1.001436
White + A..  |   .4377458   .2630812    -1.37   0.169       .13479    1.421629
Other mixed  |   .7902189   .3982802    -0.47   0.640       .29426    2.122089
     Indian  |   .8958942   .4353529    -0.23   0.821     .3456383    2.322157
  Pakistani  |   .5350889   .2984723    -1.12   0.262      .179319    1.596709
Bangladeshi  |   1.113793   .5118359     0.23   0.815     .4525232    2.741374
Other Asian  |    .560651   .3127372    -1.04   0.300     .1878811    1.673024
  Caribbean  |   .4541765    .272949    -1.31   0.189     .1398535    1.474946
    African  |   .5711816   .3186164    -1.00   0.315     .1914067    1.704477
Other Black  |   1.508229   .6541088     0.95   0.343     .6446243    3.528805
    Chinese  |   1.017138   .4795184     0.04   0.971     .4037294    2.562533
      Other  |   .8809873   .4281372    -0.26   0.794     .3398659    2.283662
    Unknown  |   .7733523   .2874539    -0.69   0.489     .3732391    1.602388
             |
        male |
       Male  |   .8570718   .1411774    -0.94   0.349     .6205928    1.183662
        age1 |   1.014617   .0224382     0.66   0.512     .9715783    1.059562
        age2 |   .9324992   .0754841    -0.86   0.388     .7956925    1.092828
        age3 |   1.200777   .2593818     0.85   0.397     .7863085    1.833715
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_positivetest_eth16.ster not found)
file ./output/model/model0_positivetest_eth16.ster saved
(note: file ./output/model/model0_positivetest_eth16.dta not found)
file ./output/model/model0_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(22)      =       23.93
Log likelihood  =   -1300.0973                  Prob > chi2      =      0.3510

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .4411556   .2651165    -1.36   0.173     .1358484    1.432614
Other White  |   1.219348   .5481404     0.44   0.659     .5052221    2.942884
White + C..  |   .8663297   .4210062    -0.30   0.768     .3342172    2.245627
White + A..  |   .2154462   .1684307    -1.96   0.050     .0465468     .997213
White + A..  |   .4376927   .2630515    -1.37   0.169     .1347723    1.421471
Other mixed  |   .7900986   .3982288    -0.47   0.640     .2942084    2.121815
     Indian  |   .8948443   .4348474    -0.23   0.819     .3452297     2.31946
  Pakistani  |   .5336569   .2976793    -1.13   0.260     .1788353     1.59247
Bangladeshi  |   1.111838    .510949     0.23   0.818     .4517194    2.736618
Other Asian  |   .5603188   .3125537    -1.04   0.299     .1877687    1.672043
  Caribbean  |   .4521418   .2717356    -1.32   0.187     .1392213    1.468398
    African  |   .5716168   .3188583    -1.00   0.316     .1915531    1.705771
Other Black  |   1.505099   .6527641     0.94   0.346     .6432764     3.52154
    Chinese  |   1.018918   .4803588     0.04   0.968     .4044346    2.567023
      Other  |   .8800811   .4277027    -0.26   0.793     .3395118    2.281343
    Unknown  |    .772296   .2870664    -0.70   0.487     .3727244     1.60022
             |
        male |
       Male  |   .8566814   .1411134    -0.94   0.348     .6203098    1.183123
        age1 |   1.014624   .0224364     0.66   0.511     .9715888    1.059566
        age2 |   .9324078   .0754688    -0.86   0.387     .7956278    1.092702
        age3 |   1.201087   .2594277     0.85   0.396      .786538    1.834125
             |
         imd |
          4  |   .8368829   .1830302    -0.81   0.416     .5451335    1.284773
5 most de..  |   1.040008     .27881     0.15   0.884     .6149542    1.758857
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(22)      =       23.93
Log likelihood  =   -1300.0973                  Prob > chi2      =      0.3510

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .4411556   .2651165    -1.36   0.173     .1358484    1.432614
Other White  |   1.219348   .5481404     0.44   0.659     .5052221    2.942884
White + C..  |   .8663297   .4210062    -0.30   0.768     .3342172    2.245627
White + A..  |   .2154462   .1684307    -1.96   0.050     .0465468     .997213
White + A..  |   .4376927   .2630515    -1.37   0.169     .1347723    1.421471
Other mixed  |   .7900986   .3982288    -0.47   0.640     .2942084    2.121815
     Indian  |   .8948443   .4348474    -0.23   0.819     .3452297     2.31946
  Pakistani  |   .5336569   .2976793    -1.13   0.260     .1788353     1.59247
Bangladeshi  |   1.111838    .510949     0.23   0.818     .4517194    2.736618
Other Asian  |   .5603188   .3125537    -1.04   0.299     .1877687    1.672043
  Caribbean  |   .4521418   .2717356    -1.32   0.187     .1392213    1.468398
    African  |   .5716168   .3188583    -1.00   0.316     .1915531    1.705771
Other Black  |   1.505099   .6527641     0.94   0.346     .6432764     3.52154
    Chinese  |   1.018918   .4803588     0.04   0.968     .4044346    2.567023
      Other  |   .8800811   .4277027    -0.26   0.793     .3395118    2.281343
    Unknown  |    .772296   .2870664    -0.70   0.487     .3727244     1.60022
             |
        male |
       Male  |   .8566814   .1411134    -0.94   0.348     .6203098    1.183123
        age1 |   1.014624   .0224364     0.66   0.511     .9715888    1.059566
        age2 |   .9324078   .0754688    -0.86   0.387     .7956278    1.092702
        age3 |   1.201087   .2594277     0.85   0.396      .786538    1.834125
             |
         imd |
          4  |   .8368829   .1830302    -0.81   0.416     .5451335    1.284773
5 most de..  |   1.040008     .27881     0.15   0.884     .6149542    1.758857
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_positivetest_eth16.ster not found)
file ./output/model/model1_positivetest_eth16.ster saved
(note: file ./output/model/model1_positivetest_eth16.dta not found)
file ./output/model/model1_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(54)      =       67.12
Log likelihood  =   -1278.5013                  Prob > chi2      =      0.1083

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .4423269   .2659015    -1.36   0.175     .1361601    1.436934
Other White  |    1.20583   .5423877     0.42   0.677     .4993579    2.911792
White + C..  |   .8813363   .4284937    -0.26   0.795     .3398592    2.285516
White + A..  |   .2177983   .1703001    -1.95   0.051      .047042    1.008377
White + A..  |   .4345877   .2612478    -1.39   0.166     .1337786    1.411784
Other mixed  |   .7803063   .3934033    -0.49   0.623     .2904818    2.096097
     Indian  |    .896788   .4359697    -0.22   0.823     .3458453    2.325401
  Pakistani  |    .529192   .2952857    -1.14   0.254     .1772753    1.579713
Bangladeshi  |   1.120406   .5151881     0.25   0.805     .4549605    2.759162
Other Asian  |   .5659754   .3158098    -1.02   0.308     .1895981    1.689512
  Caribbean  |   .4508894   .2710635    -1.32   0.185      .138787    1.464844
    African  |   .5706799   .3184313    -1.01   0.315     .1911764    1.703535
Other Black  |   1.493092   .6479831     0.92   0.356     .6377869    3.495403
    Chinese  |   1.013433   .4780378     0.03   0.977     .4020517    2.554512
      Other  |   .8916501   .4335871    -0.24   0.814     .3437767    2.312664
    Unknown  |   .7766047    .288778    -0.68   0.497     .3746998    1.609595
             |
        male |
       Male  |    .874345   .1452029    -0.81   0.419     .6314274    1.210716
        age1 |   1.030122   .0229774     1.33   0.183     .9860577    1.076156
        age2 |   .8935466   .0725555    -1.39   0.166     .7620791    1.047694
        age3 |    1.32462   .2867137     1.30   0.194     .8666603    2.024574
             |
         imd |
          4  |   .8377809   .1832994    -0.81   0.419     .5456256    1.286371
5 most de..  |   1.043982   .2800376     0.16   0.873      .617116    1.766116
             |
   bmicat_sa |
Normal (..)  |    .289626   .1332407    -2.69   0.007     .1175567    .7135554
Overweig..)  |   .2165912   .0974689    -3.40   0.001      .089658    .5232301
Obese I ..)  |   .4474085   .1702946    -2.11   0.035     .2121857    .9433921
Obese II..)  |   .3121306   .1245388    -2.92   0.004     .1427941    .6822795
Obese II..)  |   .3293112   .1258371    -2.91   0.004     .1557196    .6964173
    Unknown  |   .6176904   .2312643    -1.29   0.198     .2965375    1.286655
             |
    hba1ccat |
  >=6.5-7.4  |   .7597202   .1785346    -1.17   0.242     .4793149    1.204166
  >=7.5-7.9  |   .5638447   .2369156    -1.36   0.173     .2474587    1.284743
    >=8-8.9  |    .864477   .2743229    -0.46   0.646     .4641339     1.61014
        >=9  |   .9766525   .3818305    -0.06   0.952     .4538953    2.101476
    Unknown  |   2.40e-16   1.99e-08    -0.00   1.000            0           .
             |
gp_consult~t |    1.01129   .0357153     0.32   0.751      .943657     1.08377
             |
smoke_nomiss |
     Former  |   .3498207   .3512648    -1.05   0.296     .0488799    2.503576
    Current  |   .9758435   .2455999    -0.10   0.923      .595868    1.598123
             |
1.hyperten~n |   .8828032   .1878733    -0.59   0.558     .5817226    1.339713
             |
      bp_cat |
High, sta..  |   1.79e+08          .        .       .            .           .
High, sta..  |   2.95e+07   2.97e+07    17.08   0.000      4097258    2.12e+08
    Unknown  |   2.97e+07   3.08e+07    16.61   0.000      3898254    2.26e+08
             |
    1.asthma |   1.365533    .496746     0.86   0.392     .6693552    2.785785
1.~y_disease |    1.14236   .2256027     0.67   0.500     .7757121    1.682307
1.~c_disease |   .8804683   .1874715    -0.60   0.550     .5800611    1.336453
             |
     dm_type |
       T1DM  |    1.85086   .6786726     1.68   0.093     .9021013    3.797448
       T2DM  |   .9933464   .2076686    -0.03   0.975     .6593999    1.496417
 UNKNOWN_DM  |   1.008335   .5908977     0.01   0.989     .3197346    3.179949
             |
    1.cancer |   1.138248    .224713     0.66   0.512     .7730235    1.676028
1.~r_disease |   .9475089   .1988356    -0.26   0.797     .6279975    1.429581
    1.stroke |    1.00005   .2044482     0.00   1.000     .6698907    1.492931
  1.dementia |   .8566705   .1850557    -0.72   0.474     .5609699    1.308242
1.other_ne~o |   .5934593   .1458351    -2.12   0.034     .3666224     .960645
             |
      egfr60 |
   eGFR <60  |    1.76932   1.070549     0.94   0.346     .5404755    5.792108
      1.esrf |   1.061681   .2144744     0.30   0.767     .7145608    1.577424
1.immunosu~d |   .7392744    .133781    -1.67   0.095     .5185254    1.054002
1.ra_sle_p~s |    1.03402   .2088653     0.17   0.868      .695972    1.536265
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(54)      =       67.12
Log likelihood  =   -1278.5013                  Prob > chi2      =      0.1083

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .4423269   .2659015    -1.36   0.175     .1361601    1.436934
Other White  |    1.20583   .5423877     0.42   0.677     .4993579    2.911792
White + C..  |   .8813363   .4284937    -0.26   0.795     .3398592    2.285516
White + A..  |   .2177983   .1703001    -1.95   0.051      .047042    1.008377
White + A..  |   .4345877   .2612478    -1.39   0.166     .1337786    1.411784
Other mixed  |   .7803063   .3934033    -0.49   0.623     .2904818    2.096097
     Indian  |    .896788   .4359697    -0.22   0.823     .3458453    2.325401
  Pakistani  |    .529192   .2952857    -1.14   0.254     .1772753    1.579713
Bangladeshi  |   1.120406   .5151881     0.25   0.805     .4549605    2.759162
Other Asian  |   .5659754   .3158098    -1.02   0.308     .1895981    1.689512
  Caribbean  |   .4508894   .2710635    -1.32   0.185      .138787    1.464844
    African  |   .5706799   .3184313    -1.01   0.315     .1911764    1.703535
Other Black  |   1.493092   .6479831     0.92   0.356     .6377869    3.495403
    Chinese  |   1.013433   .4780378     0.03   0.977     .4020517    2.554512
      Other  |   .8916501   .4335871    -0.24   0.814     .3437767    2.312664
    Unknown  |   .7766047    .288778    -0.68   0.497     .3746998    1.609595
             |
        male |
       Male  |    .874345   .1452029    -0.81   0.419     .6314274    1.210716
        age1 |   1.030122   .0229774     1.33   0.183     .9860577    1.076156
        age2 |   .8935466   .0725555    -1.39   0.166     .7620791    1.047694
        age3 |    1.32462   .2867137     1.30   0.194     .8666603    2.024574
             |
         imd |
          4  |   .8377809   .1832994    -0.81   0.419     .5456256    1.286371
5 most de..  |   1.043982   .2800376     0.16   0.873      .617116    1.766116
             |
   bmicat_sa |
Normal (..)  |    .289626   .1332407    -2.69   0.007     .1175567    .7135554
Overweig..)  |   .2165912   .0974689    -3.40   0.001      .089658    .5232301
Obese I ..)  |   .4474085   .1702946    -2.11   0.035     .2121857    .9433921
Obese II..)  |   .3121306   .1245388    -2.92   0.004     .1427941    .6822795
Obese II..)  |   .3293112   .1258371    -2.91   0.004     .1557196    .6964173
    Unknown  |   .6176904   .2312643    -1.29   0.198     .2965375    1.286655
             |
    hba1ccat |
  >=6.5-7.4  |   .7597202   .1785346    -1.17   0.242     .4793149    1.204166
  >=7.5-7.9  |   .5638447   .2369156    -1.36   0.173     .2474587    1.284743
    >=8-8.9  |    .864477   .2743229    -0.46   0.646     .4641339     1.61014
        >=9  |   .9766525   .3818305    -0.06   0.952     .4538953    2.101476
    Unknown  |   2.40e-16   1.99e-08    -0.00   1.000            0           .
             |
gp_consult~t |    1.01129   .0357153     0.32   0.751      .943657     1.08377
             |
smoke_nomiss |
     Former  |   .3498207   .3512648    -1.05   0.296     .0488799    2.503576
    Current  |   .9758435   .2455999    -0.10   0.923      .595868    1.598123
             |
1.hyperten~n |   .8828032   .1878733    -0.59   0.558     .5817226    1.339713
             |
      bp_cat |
High, sta..  |   1.79e+08          .        .       .            .           .
High, sta..  |   2.95e+07   2.97e+07    17.08   0.000      4097258    2.12e+08
    Unknown  |   2.97e+07   3.08e+07    16.61   0.000      3898254    2.26e+08
             |
    1.asthma |   1.365533    .496746     0.86   0.392     .6693552    2.785785
1.~y_disease |    1.14236   .2256027     0.67   0.500     .7757121    1.682307
1.~c_disease |   .8804683   .1874715    -0.60   0.550     .5800611    1.336453
             |
     dm_type |
       T1DM  |    1.85086   .6786726     1.68   0.093     .9021013    3.797448
       T2DM  |   .9933464   .2076686    -0.03   0.975     .6593999    1.496417
 UNKNOWN_DM  |   1.008335   .5908977     0.01   0.989     .3197346    3.179949
             |
    1.cancer |   1.138248    .224713     0.66   0.512     .7730235    1.676028
1.~r_disease |   .9475089   .1988356    -0.26   0.797     .6279975    1.429581
    1.stroke |    1.00005   .2044482     0.00   1.000     .6698907    1.492931
  1.dementia |   .8566705   .1850557    -0.72   0.474     .5609699    1.308242
1.other_ne~o |   .5934593   .1458351    -2.12   0.034     .3666224     .960645
             |
      egfr60 |
   eGFR <60  |    1.76932   1.070549     0.94   0.346     .5404755    5.792108
      1.esrf |   1.061681   .2144744     0.30   0.767     .7145608    1.577424
1.immunosu~d |   .7392744    .133781    -1.67   0.095     .5185254    1.054002
1.ra_sle_p~s |    1.03402   .2088653     0.17   0.868      .695972    1.536265
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_positivetest_eth16.ster not found)
file ./output/model/model2_positivetest_eth16.ster saved
(note: file ./output/model/model2_positivetest_eth16.dta not found)
file ./output/model/model2_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(56)      =       67.67
Log likelihood  =   -1278.2277                  Prob > chi2      =      0.1365

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .4425547   .2660436    -1.36   0.175     .1362271    1.437706
Other White  |   1.204865   .5419645     0.41   0.679     .4989492    2.909513
White + C..  |   .8822698   .4289692    -0.26   0.797     .3402028    2.288047
White + A..  |   .2180656   .1705132    -1.95   0.051      .047098    1.009652
White + A..  |   .4354159    .261746    -1.38   0.167     .1340333    1.414477
Other mixed  |   .7795987   .3930537    -0.49   0.621     .2902132    2.094233
     Indian  |   .8972378    .436215    -0.22   0.824     .3459985    2.326702
  Pakistani  |    .529477   .2954539    -1.14   0.254     .1773648    1.580617
Bangladeshi  |   1.119247   .5146713     0.24   0.806     .4544774    2.756386
Other Asian  |   .5661779   .3159297    -1.02   0.308     .1896613    1.690157
  Caribbean  |   .4508401   .2710372    -1.33   0.185     .1387698    1.464705
    African  |   .5704655   .3183134    -1.01   0.314     .1911034    1.702905
Other Black  |   1.495137   .6488904     0.93   0.354     .6386442    3.500281
    Chinese  |   1.016592   .4795582     0.03   0.972     .4032814    2.562625
      Other  |   .8923588   .4339705    -0.23   0.815     .3440207    2.314699
    Unknown  |   .7767958   .2888734    -0.68   0.497     .3747689     1.61009
             |
        male |
       Male  |   .8746957    .145263    -0.81   0.420      .631678    1.211207
        age1 |   1.030216   .0229784     1.33   0.182     .9861495    1.076252
        age2 |   .8933565   .0725396    -1.39   0.165     .7619178     1.04747
        age3 |    1.32527   .2868525     1.30   0.193     .8670877    2.025562
             |
         imd |
          4  |   .8383684   .1834283    -0.81   0.420     .5460077    1.287274
5 most de..  |   1.045667   .2804874     0.17   0.868     .6181143    1.768959
             |
   bmicat_sa |
Normal (..)  |   .2884677   .1327101    -2.70   0.007     .1170848    .7107125
Overweig..)  |   .2156772   .0970583    -3.41   0.001     .0892791    .5210255
Obese I ..)  |    .445751   .1696664    -2.12   0.034     .2113972    .9399084
Obese II..)  |   .3113712   .1242355    -2.92   0.003      .142447     .680618
Obese II..)  |   .3279081   .1253075    -2.92   0.004     .1550501    .6934771
    Unknown  |    .615942   .2306078    -1.29   0.196     .2956999    1.283005
             |
    hba1ccat |
  >=6.5-7.4  |   .7594608   .1784769    -1.17   0.242     .4791472    1.203765
  >=7.5-7.9  |   .5629209    .236533    -1.37   0.171     .2470485    1.282663
    >=8-8.9  |    .863853   .2741261    -0.46   0.645     .4637976    1.608982
        >=9  |   .9766996   .3818478    -0.06   0.952     .4539182    2.101573
    Unknown  |   6.62e-16   3.32e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.011332   .0357115     0.32   0.750     .9437058    1.083804
             |
smoke_nomiss |
     Former  |   .3504305   .3518801    -1.04   0.296     .0489643    2.507983
    Current  |   .9770585   .2459103    -0.09   0.927     .5966045    1.600128
             |
1.hyperten~n |   .8819118   .1876854    -0.59   0.555     .5811328    1.338366
             |
      bp_cat |
High, sta..  |   1.79e+08          .        .       .            .           .
High, sta..  |   2.95e+07   2.97e+07    17.08   0.000      4099860    2.12e+08
    Unknown  |   2.97e+07   3.08e+07    16.61   0.000      3901011    2.26e+08
             |
    1.asthma |   1.363584   .4960486     0.85   0.394     .6683892    2.781855
1.~y_disease |   1.141751   .2254814     0.67   0.502     .7753004    1.681408
1.~c_disease |   .8808371   .1875559    -0.60   0.551     .5802966     1.33703
             |
     dm_type |
       T1DM  |   1.850477   .6785293     1.68   0.093     .9019175     3.79665
       T2DM  |   .9930635   .2076125    -0.03   0.973     .6592082       1.496
 UNKNOWN_DM  |   1.006454   .5897989     0.01   0.991     .3191356     3.17404
             |
    1.cancer |   1.137649   .2246002     0.65   0.514     .7726095    1.675161
1.~r_disease |   .9464638   .1986193    -0.26   0.793     .6273009    1.428013
    1.stroke |   .9995966   .2043623    -0.00   0.998     .6695779    1.492274
  1.dementia |   .8573366   .1852042    -0.71   0.476     .5614001    1.309273
1.other_ne~o |   .5932339   .1457808    -2.12   0.034     .3664818    .9602836
             |
      egfr60 |
   eGFR <60  |   1.762833    1.06672     0.94   0.349     .5384366    5.771488
      1.esrf |   1.060946   .2143355     0.29   0.770      .714054    1.576361
1.immunosu~d |   .7397355   .1338634    -1.67   0.096     .5188503    1.054656
1.ra_sle_p~s |   1.033877   .2088375     0.16   0.869      .695874    1.536055
             |
hh_total_cat |
       6-10  |    1.13741   .6638339     0.22   0.825     .3623474    3.570337
        11+  |   6.94e-16   5.63e-08    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_positivetest_eth16.ster not found)
file ./output/model/model3_positivetest_eth16.ster saved
(note: file ./output/model/model3_positivetest_eth16.dta not found)
file ./output/model/model3_positivetest_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
icu
(11,899 observations deleted)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =            0
Time at risk    =     12042720
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_icu_eth16.ster not found)
file ./output/model/crude_icu_eth16.ster saved
(note: file ./output/model/crude_icu_eth16.dta not found)
file ./output/model/crude_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =            0
Time at risk    =     12042720
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_icu_eth16.ster not found)
file ./output/model/model0_icu_eth16.ster saved
(note: file ./output/model/model0_icu_eth16.dta not found)
file ./output/model/model0_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =            0
Time at risk    =     12042720
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =            0
Time at risk    =     12042720
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_icu_eth16.ster not found)
file ./output/model/model1_icu_eth16.ster saved
(note: file ./output/model/model1_icu_eth16.dta not found)
file ./output/model/model1_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =            0
Time at risk    =     12042720
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
   bmicat_sa |
Normal (..)  |          1  (omitted)
Overweig..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    hba1ccat |
  >=6.5-7.4  |          1  (omitted)
  >=7.5-7.9  |          1  (omitted)
    >=8-8.9  |          1  (omitted)
        >=9  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
gp_consult~t |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |          1  (omitted)
             |
1.hyperten~n |          1  (omitted)
             |
      bp_cat |
High, sta..  |          1  (omitted)
High, sta..  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    1.asthma |          1  (omitted)
1.~y_disease |          1  (omitted)
1.~c_disease |          1  (omitted)
             |
     dm_type |
       T1DM  |          1  (omitted)
       T2DM  |          1  (omitted)
 UNKNOWN_DM  |          1  (omitted)
             |
    1.cancer |          1  (omitted)
1.~r_disease |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
1.other_ne~o |          1  (omitted)
             |
      egfr60 |
   eGFR <60  |          1  (omitted)
      1.esrf |          1  (omitted)
1.immunosu~d |          1  (omitted)
1.ra_sle_p~s |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =            0
Time at risk    =     12042720
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
   bmicat_sa |
Normal (..)  |          1  (omitted)
Overweig..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    hba1ccat |
  >=6.5-7.4  |          1  (omitted)
  >=7.5-7.9  |          1  (omitted)
    >=8-8.9  |          1  (omitted)
        >=9  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
gp_consult~t |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |          1  (omitted)
             |
1.hyperten~n |          1  (omitted)
             |
      bp_cat |
High, sta..  |          1  (omitted)
High, sta..  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    1.asthma |          1  (omitted)
1.~y_disease |          1  (omitted)
1.~c_disease |          1  (omitted)
             |
     dm_type |
       T1DM  |          1  (omitted)
       T2DM  |          1  (omitted)
 UNKNOWN_DM  |          1  (omitted)
             |
    1.cancer |          1  (omitted)
1.~r_disease |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
1.other_ne~o |          1  (omitted)
             |
      egfr60 |
   eGFR <60  |          1  (omitted)
      1.esrf |          1  (omitted)
1.immunosu~d |          1  (omitted)
1.ra_sle_p~s |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_icu_eth16.ster not found)
file ./output/model/model2_icu_eth16.ster saved
(note: file ./output/model/model2_icu_eth16.dta not found)
file ./output/model/model2_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =            0
Time at risk    =     12042720
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |          1  (omitted)
Other White  |          1  (omitted)
White + C..  |          1  (omitted)
White + A..  |          1  (omitted)
White + A..  |          1  (omitted)
Other mixed  |          1  (omitted)
     Indian  |          1  (omitted)
  Pakistani  |          1  (omitted)
Bangladeshi  |          1  (omitted)
Other Asian  |          1  (omitted)
  Caribbean  |          1  (omitted)
    African  |          1  (omitted)
Other Black  |          1  (omitted)
    Chinese  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
   bmicat_sa |
Normal (..)  |          1  (omitted)
Overweig..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    hba1ccat |
  >=6.5-7.4  |          1  (omitted)
  >=7.5-7.9  |          1  (omitted)
    >=8-8.9  |          1  (omitted)
        >=9  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
gp_consult~t |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |          1  (omitted)
             |
1.hyperten~n |          1  (omitted)
             |
      bp_cat |
High, sta..  |          1  (omitted)
High, sta..  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    1.asthma |          1  (omitted)
1.~y_disease |          1  (omitted)
1.~c_disease |          1  (omitted)
             |
     dm_type |
       T1DM  |          1  (omitted)
       T2DM  |          1  (omitted)
 UNKNOWN_DM  |          1  (omitted)
             |
    1.cancer |          1  (omitted)
1.~r_disease |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
1.other_ne~o |          1  (omitted)
             |
      egfr60 |
   eGFR <60  |          1  (omitted)
      1.esrf |          1  (omitted)
1.immunosu~d |          1  (omitted)
1.ra_sle_p~s |          1  (omitted)
             |
hh_total_cat |
       6-10  |          1  (omitted)
        11+  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_icu_eth16.ster not found)
file ./output/model/model3_icu_eth16.ster saved
(note: file ./output/model/model3_icu_eth16.dta not found)
file ./output/model/model3_icu_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
hes
(11,899 observations deleted)

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(16)      =       19.77
Log likelihood  =   -79455.334                  Prob > chi2      =      0.2307

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.079039   .0743767     1.10   0.270     .9426818    1.235121
Other White  |   1.089003   .0749819     1.24   0.216     .9515265    1.246343
White + C..  |   1.037002   .0718849     0.52   0.600     .9052626    1.187914
White + A..  |   1.113948   .0756563     1.59   0.112       .97511    1.272554
White + A..  |   1.112871   .0761753     1.56   0.118     .9731517     1.27265
Other mixed  |   1.009207   .0710136     0.13   0.896     .8791944    1.158446
     Indian  |   1.064701   .0738868     0.90   0.366     .9293028    1.219828
  Pakistani  |   1.148864   .0775285     2.06   0.040     1.006531    1.311324
Bangladeshi  |   1.101506   .0757195     1.41   0.160     .9626616    1.260376
Other Asian  |   1.039421   .0725165     0.55   0.579     .9065804    1.191726
  Caribbean  |   .9758098   .0693793    -0.34   0.731     .8488782    1.121721
    African  |   1.075177   .0745707     1.05   0.296     .9385203    1.231733
Other Black  |   1.020311   .0720246     0.28   0.776      .888476    1.171709
    Chinese  |   .9973978   .0703581    -0.04   0.971     .8686069    1.145285
      Other  |   .9604142   .0680179    -0.57   0.568     .8359404    1.103423
    Unknown  |   1.091198   .0586421     1.62   0.104     .9821081    1.212406
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_hes_eth16.ster not found)
file ./output/model/crude_hes_eth16.ster saved
(note: file ./output/model/crude_hes_eth16.dta not found)
file ./output/model/crude_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(20)      =       28.59
Log likelihood  =   -79450.925                  Prob > chi2      =      0.0962

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.079541   .0744114     1.11   0.267     .9431194    1.235695
Other White  |   1.088678   .0749603     1.23   0.217     .9512408    1.245972
White + C..  |   1.037928   .0719522     0.54   0.591     .9060653    1.188982
White + A..  |   1.113399     .07562     1.58   0.114     .9746273    1.271928
White + A..  |   1.112964   .0761822     1.56   0.118     .9732327    1.272758
Other mixed  |   1.010261   .0710892     0.15   0.885     .8801105    1.159659
     Indian  |   1.065794   .0739647     0.92   0.359     .9302528    1.221084
  Pakistani  |   1.149808    .077595     2.07   0.039     1.007354    1.312408
Bangladeshi  |   1.103037   .0758268     1.43   0.154     .9639963    1.262132
Other Asian  |   1.039238   .0725053     0.55   0.581      .906418     1.19152
  Caribbean  |   .9771463   .0694765    -0.33   0.745     .8500372    1.123262
    African  |   1.076871    .074694     1.07   0.286     .9399885    1.233686
Other Black  |   1.020549   .0720425     0.29   0.773     .8886815    1.171985
    Chinese  |   .9969529   .0703287    -0.04   0.965     .8682159    1.144779
      Other  |   .9604352   .0680195    -0.57   0.569     .8359585    1.103447
    Unknown  |   1.091775   .0586741     1.63   0.102      .982625    1.213049
             |
        male |
       Male  |    1.01125   .0212171     0.53   0.594     .9705082    1.053701
        age1 |   1.005489   .0028716     1.92   0.055     .9998768    1.011133
        age2 |   .9746381   .0101462    -2.47   0.014     .9549534    .9947287
        age3 |   1.071169   .0296316     2.49   0.013     1.014639    1.130849
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_hes_eth16.ster not found)
file ./output/model/model0_hes_eth16.ster saved
(note: file ./output/model/model0_hes_eth16.dta not found)
file ./output/model/model0_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(22)      =       30.46
Log likelihood  =   -79449.989                  Prob > chi2      =      0.1077

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.079812   .0744305     1.11   0.265      .943356    1.236007
Other White  |   1.088863   .0749731     1.24   0.216      .951402    1.246184
White + C..  |   1.037859   .0719477     0.54   0.592     .9060047    1.188903
White + A..  |   1.113933   .0756576     1.59   0.112     .9750929    1.272542
White + A..  |   1.112718   .0761654     1.56   0.119     .9730168    1.272476
Other mixed  |   1.010165    .071083     0.14   0.886     .8800251     1.15955
     Indian  |   1.065834   .0739677     0.92   0.358     .9302876    1.221131
  Pakistani  |    1.15001   .0776091     2.07   0.038      1.00753    1.312639
Bangladeshi  |   1.103154   .0758348     1.43   0.153     .9640987    1.262266
Other Asian  |    1.03911   .0724967     0.55   0.582     .9063064    1.191375
  Caribbean  |   .9777628   .0695221    -0.32   0.752     .8505706    1.123975
    African  |   1.076535   .0746713     1.06   0.288     .9396943    1.233303
Other Black  |   1.020864   .0720658     0.29   0.770     .8889537    1.172349
    Chinese  |   .9963791   .0702896    -0.05   0.959     .8677138    1.144123
      Other  |   .9606715   .0680367    -0.57   0.571     .8361632     1.10372
    Unknown  |   1.091925   .0586826     1.64   0.102     .9827592    1.213217
             |
        male |
       Male  |   1.011396   .0212205     0.54   0.589     .9706478    1.053854
        age1 |   1.005486   .0028717     1.92   0.055     .9998736     1.01113
        age2 |   .9746791    .010147    -2.46   0.014      .954993    .9947711
        age3 |   1.071038   .0296287     2.48   0.013     1.014513    1.130713
             |
         imd |
          4  |   1.036691   .0272564     1.37   0.171     .9846221    1.091512
5 most de..  |   1.005742   .0356374     0.16   0.872     .9382646    1.078073
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(22)      =       30.46
Log likelihood  =   -79449.989                  Prob > chi2      =      0.1077

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.079812   .0744305     1.11   0.265      .943356    1.236007
Other White  |   1.088863   .0749731     1.24   0.216      .951402    1.246184
White + C..  |   1.037859   .0719477     0.54   0.592     .9060047    1.188903
White + A..  |   1.113933   .0756576     1.59   0.112     .9750929    1.272542
White + A..  |   1.112718   .0761654     1.56   0.119     .9730168    1.272476
Other mixed  |   1.010165    .071083     0.14   0.886     .8800251     1.15955
     Indian  |   1.065834   .0739677     0.92   0.358     .9302876    1.221131
  Pakistani  |    1.15001   .0776091     2.07   0.038      1.00753    1.312639
Bangladeshi  |   1.103154   .0758348     1.43   0.153     .9640987    1.262266
Other Asian  |    1.03911   .0724967     0.55   0.582     .9063064    1.191375
  Caribbean  |   .9777628   .0695221    -0.32   0.752     .8505706    1.123975
    African  |   1.076535   .0746713     1.06   0.288     .9396943    1.233303
Other Black  |   1.020864   .0720658     0.29   0.770     .8889537    1.172349
    Chinese  |   .9963791   .0702896    -0.05   0.959     .8677138    1.144123
      Other  |   .9606715   .0680367    -0.57   0.571     .8361632     1.10372
    Unknown  |   1.091925   .0586826     1.64   0.102     .9827592    1.213217
             |
        male |
       Male  |   1.011396   .0212205     0.54   0.589     .9706478    1.053854
        age1 |   1.005486   .0028717     1.92   0.055     .9998736     1.01113
        age2 |   .9746791    .010147    -2.46   0.014      .954993    .9947711
        age3 |   1.071038   .0296287     2.48   0.013     1.014513    1.130713
             |
         imd |
          4  |   1.036691   .0272564     1.37   0.171     .9846221    1.091512
5 most de..  |   1.005742   .0356374     0.16   0.872     .9382646    1.078073
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_hes_eth16.ster not found)
file ./output/model/model1_hes_eth16.ster saved
(note: file ./output/model/model1_hes_eth16.dta not found)
file ./output/model/model1_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(54)      =       69.07
Log likelihood  =   -79430.683                  Prob > chi2      =      0.0812

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.082022   .0746055     1.14   0.253     .9452477    1.238587
Other White  |       1.09   .0750729     1.25   0.211     .9523587    1.247534
White + C..  |   1.035949   .0718364     0.51   0.611     .9043009    1.186762
White + A..  |   1.114624   .0757223     1.60   0.110     .9756668    1.273371
White + A..  |   1.113752   .0762479     1.57   0.116     .9739014    1.273685
Other mixed  |   1.009366   .0710403     0.13   0.895     .8793061    1.158663
     Indian  |   1.065019   .0739306     0.91   0.364     .9295426     1.22024
  Pakistani  |   1.149518   .0775934     2.06   0.039     1.007068    1.312117
Bangladeshi  |   1.099008   .0755709     1.37   0.170     .9604391    1.257569
Other Asian  |   1.039796   .0725633     0.56   0.576     .9068724    1.192203
  Caribbean  |     .97681   .0694715    -0.33   0.741     .8497124    1.122918
    African  |   1.076596   .0746949     1.06   0.287     .9397146    1.233416
Other Black  |   1.020294   .0720478     0.28   0.776     .8884196    1.171744
    Chinese  |   .9961547   .0702952    -0.05   0.956     .8674818    1.143913
      Other  |   .9610441   .0680914    -0.56   0.575     .8364393    1.104211
    Unknown  |    1.09129    .058663     1.63   0.104     .9821624    1.212543
             |
        male |
       Male  |   1.010267   .0213126     0.48   0.628     .9693473    1.052915
        age1 |   1.005721    .002963     1.94   0.053     .9999303    1.011545
        age2 |   .9740564   .0103301    -2.48   0.013     .9540188    .9945148
        age3 |   1.072884   .0301265     2.51   0.012     1.015432    1.133586
             |
         imd |
          4  |   1.036551   .0272568     1.37   0.172     .9844823    1.091374
5 most de..  |   1.005478   .0356351     0.15   0.878     .9380047    1.077804
             |
   bmicat_sa |
Normal (..)  |   1.106813   .0892761     1.26   0.208      .944965     1.29638
Overweig..)  |   1.119253   .0874878     1.44   0.149     .9602693    1.304558
Obese I ..)  |   1.106429   .0851222     1.31   0.189     .9515616      1.2865
Obese II..)  |   1.117989    .085997     1.45   0.147     .9615286    1.299909
Obese II..)  |   1.061744   .0807581     0.79   0.431     .9146946    1.232434
    Unknown  |   1.106536   .0856815     1.31   0.191     .9507259    1.287882
             |
    hba1ccat |
  >=6.5-7.4  |   1.004764   .0281545     0.17   0.865     .9510706     1.06149
  >=7.5-7.9  |   .9441508   .0417668    -1.30   0.194     .8657379    1.029666
    >=8-8.9  |    .933605   .0380597    -1.69   0.092     .8619117    1.011262
        >=9  |   .9816128   .0508297    -0.36   0.720     .8868772    1.086468
    Unknown  |    .804684   .1449642    -1.21   0.228     .5653026    1.145433
             |
gp_consult~t |    .997505     .00456    -0.55   0.585     .9886075    1.006483
             |
smoke_nomiss |
     Former  |   .9411935   .0734181    -0.78   0.437      .807757    1.096673
    Current  |   1.017816    .032514     0.55   0.580     .9560438     1.08358
             |
1.hyperten~n |   1.042056    .027044     1.59   0.112     .9903764    1.096433
             |
      bp_cat |
High, sta..  |   6.32e+07          .        .       .            .           .
High, sta..  |   6.61e+07   2.00e+07    59.65   0.000     3.66e+07    1.19e+08
    Unknown  |   6.69e+07   2.03e+07    59.38   0.000     3.69e+07    1.21e+08
             |
    1.asthma |   .8942453   .0498757    -2.00   0.045     .8016444     .997543
1.~y_disease |   1.001313   .0263086     0.05   0.960     .9510539    1.054227
1.~c_disease |    1.04188    .027018     1.58   0.114     .9902493    1.096204
             |
     dm_type |
       T1DM  |   .8673564   .0574473    -2.15   0.032     .7617637    .9875858
       T2DM  |   1.017788   .0267115     0.67   0.502     .9667581    1.071512
 UNKNOWN_DM  |   .9884558     .07408    -0.15   0.877      .853422    1.144856
             |
    1.cancer |   .9736861   .0257186    -1.01   0.313     .9245611    1.025421
1.~r_disease |   .9749551   .0258836    -0.96   0.339     .9255215    1.027029
    1.stroke |   1.008766   .0264366     0.33   0.739     .9582595    1.061935
  1.dementia |   1.057868    .027428     2.17   0.030     1.005453    1.113015
1.other_ne~o |   .9798926   .0258936    -0.77   0.442     .9304339     1.03198
             |
      egfr60 |
   eGFR <60  |   .9509072   .0947617    -0.51   0.613     .7821905    1.156016
      1.esrf |   .9778988    .025881    -0.84   0.398     .9284661    1.029963
1.immunosu~d |    1.02776   .0224072     1.26   0.209     .9847676    1.072629
1.ra_sle_p~s |   1.018598   .0265509     0.71   0.480     .9678661    1.071989
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(54)      =       69.07
Log likelihood  =   -79430.683                  Prob > chi2      =      0.0812

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.082022   .0746055     1.14   0.253     .9452477    1.238587
Other White  |       1.09   .0750729     1.25   0.211     .9523587    1.247534
White + C..  |   1.035949   .0718364     0.51   0.611     .9043009    1.186762
White + A..  |   1.114624   .0757223     1.60   0.110     .9756668    1.273371
White + A..  |   1.113752   .0762479     1.57   0.116     .9739014    1.273685
Other mixed  |   1.009366   .0710403     0.13   0.895     .8793061    1.158663
     Indian  |   1.065019   .0739306     0.91   0.364     .9295426     1.22024
  Pakistani  |   1.149518   .0775934     2.06   0.039     1.007068    1.312117
Bangladeshi  |   1.099008   .0755709     1.37   0.170     .9604391    1.257569
Other Asian  |   1.039796   .0725633     0.56   0.576     .9068724    1.192203
  Caribbean  |     .97681   .0694715    -0.33   0.741     .8497124    1.122918
    African  |   1.076596   .0746949     1.06   0.287     .9397146    1.233416
Other Black  |   1.020294   .0720478     0.28   0.776     .8884196    1.171744
    Chinese  |   .9961547   .0702952    -0.05   0.956     .8674818    1.143913
      Other  |   .9610441   .0680914    -0.56   0.575     .8364393    1.104211
    Unknown  |    1.09129    .058663     1.63   0.104     .9821624    1.212543
             |
        male |
       Male  |   1.010267   .0213126     0.48   0.628     .9693473    1.052915
        age1 |   1.005721    .002963     1.94   0.053     .9999303    1.011545
        age2 |   .9740564   .0103301    -2.48   0.013     .9540188    .9945148
        age3 |   1.072884   .0301265     2.51   0.012     1.015432    1.133586
             |
         imd |
          4  |   1.036551   .0272568     1.37   0.172     .9844823    1.091374
5 most de..  |   1.005478   .0356351     0.15   0.878     .9380047    1.077804
             |
   bmicat_sa |
Normal (..)  |   1.106813   .0892761     1.26   0.208      .944965     1.29638
Overweig..)  |   1.119253   .0874878     1.44   0.149     .9602693    1.304558
Obese I ..)  |   1.106429   .0851222     1.31   0.189     .9515616      1.2865
Obese II..)  |   1.117989    .085997     1.45   0.147     .9615286    1.299909
Obese II..)  |   1.061744   .0807581     0.79   0.431     .9146946    1.232434
    Unknown  |   1.106536   .0856815     1.31   0.191     .9507259    1.287882
             |
    hba1ccat |
  >=6.5-7.4  |   1.004764   .0281545     0.17   0.865     .9510706     1.06149
  >=7.5-7.9  |   .9441508   .0417668    -1.30   0.194     .8657379    1.029666
    >=8-8.9  |    .933605   .0380597    -1.69   0.092     .8619117    1.011262
        >=9  |   .9816128   .0508297    -0.36   0.720     .8868772    1.086468
    Unknown  |    .804684   .1449642    -1.21   0.228     .5653026    1.145433
             |
gp_consult~t |    .997505     .00456    -0.55   0.585     .9886075    1.006483
             |
smoke_nomiss |
     Former  |   .9411935   .0734181    -0.78   0.437      .807757    1.096673
    Current  |   1.017816    .032514     0.55   0.580     .9560438     1.08358
             |
1.hyperten~n |   1.042056    .027044     1.59   0.112     .9903764    1.096433
             |
      bp_cat |
High, sta..  |   6.32e+07          .        .       .            .           .
High, sta..  |   6.61e+07   2.00e+07    59.65   0.000     3.66e+07    1.19e+08
    Unknown  |   6.69e+07   2.03e+07    59.38   0.000     3.69e+07    1.21e+08
             |
    1.asthma |   .8942453   .0498757    -2.00   0.045     .8016444     .997543
1.~y_disease |   1.001313   .0263086     0.05   0.960     .9510539    1.054227
1.~c_disease |    1.04188    .027018     1.58   0.114     .9902493    1.096204
             |
     dm_type |
       T1DM  |   .8673564   .0574473    -2.15   0.032     .7617637    .9875858
       T2DM  |   1.017788   .0267115     0.67   0.502     .9667581    1.071512
 UNKNOWN_DM  |   .9884558     .07408    -0.15   0.877      .853422    1.144856
             |
    1.cancer |   .9736861   .0257186    -1.01   0.313     .9245611    1.025421
1.~r_disease |   .9749551   .0258836    -0.96   0.339     .9255215    1.027029
    1.stroke |   1.008766   .0264366     0.33   0.739     .9582595    1.061935
  1.dementia |   1.057868    .027428     2.17   0.030     1.005453    1.113015
1.other_ne~o |   .9798926   .0258936    -0.77   0.442     .9304339     1.03198
             |
      egfr60 |
   eGFR <60  |   .9509072   .0947617    -0.51   0.613     .7821905    1.156016
      1.esrf |   .9778988    .025881    -0.84   0.398     .9284661    1.029963
1.immunosu~d |    1.02776   .0224072     1.26   0.209     .9847676    1.072629
1.ra_sle_p~s |   1.018598   .0265509     0.71   0.480     .9678661    1.071989
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_hes_eth16.ster not found)
file ./output/model/model2_hes_eth16.ster saved
(note: file ./output/model/model2_hes_eth16.dta not found)
file ./output/model/model2_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(56)      =       69.90
Log likelihood  =   -79430.272                  Prob > chi2      =      0.1003

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.082334   .0746289     1.15   0.251     .9455167    1.238948
Other White  |    1.09017   .0750853     1.25   0.210      .952506     1.24773
White + C..  |   1.036145   .0718511     0.51   0.609     .9044697    1.186989
White + A..  |   1.114163   .0756943     1.59   0.112     .9752585    1.272852
White + A..  |   1.113837   .0762543     1.57   0.115     .9739748    1.273784
Other mixed  |   1.009613   .0710584     0.14   0.892     .8795201    1.158948
     Indian  |   1.064891   .0739236     0.91   0.365     .9294273    1.220098
  Pakistani  |   1.149798   .0776148     2.07   0.039     1.007309    1.312442
Bangladeshi  |   1.099438   .0756028     1.38   0.168     .9608108    1.258066
Other Asian  |   1.039725   .0725594     0.56   0.577     .9068084    1.192124
  Caribbean  |   .9769381   .0694816    -0.33   0.743     .8498223    1.123068
    African  |   1.076664   .0747002     1.06   0.287     .9397724    1.233495
Other Black  |   1.020226   .0720441     0.28   0.777     .8883586    1.171669
    Chinese  |   .9957699   .0702701    -0.06   0.952     .8671433    1.143476
      Other  |   .9611604    .068102    -0.56   0.576     .8365365     1.10435
    Unknown  |   1.091384   .0586712     1.63   0.104     .9822416    1.212654
             |
        male |
       Male  |   1.010325   .0213139     0.49   0.626     .9694026    1.052975
        age1 |   1.005709    .002963     1.93   0.053     .9999187    1.011534
        age2 |   .9740933   .0103307    -2.47   0.013     .9540546     .994553
        age3 |   1.072774    .030124     2.50   0.012     1.015327    1.133471
             |
         imd |
          4  |   1.036502   .0272556     1.36   0.173     .9844353    1.091322
5 most de..  |   1.005272   .0356292     0.15   0.882     .9378107    1.077587
             |
   bmicat_sa |
Normal (..)  |   1.107218   .0893105     1.26   0.207     .9453086    1.296859
Overweig..)  |   1.119763     .08753     1.45   0.148     .9607027    1.305158
Obese I ..)  |   1.106892   .0851598     1.32   0.187      .951957    1.287044
Obese II..)  |   1.118107   .0860066     1.45   0.147      .961629    1.300047
Obese II..)  |   1.062146   .0807902     0.79   0.428     .9150383    1.232905
    Unknown  |   1.106783   .0857012     1.31   0.190     .9509367     1.28817
             |
    hba1ccat |
  >=6.5-7.4  |   1.004868   .0281578     0.17   0.862      .951168      1.0616
  >=7.5-7.9  |   .9443186   .0417759    -1.30   0.195     .8658888    1.029852
    >=8-8.9  |   .9337419   .0380657    -1.68   0.093     .8620374    1.011411
        >=9  |   .9816336   .0508308    -0.36   0.720     .8868958    1.086491
    Unknown  |    .804291   .1448961    -1.21   0.227     .5650229    1.144881
             |
gp_consult~t |   .9974885   .0045601    -0.55   0.582     .9885908    1.006466
             |
smoke_nomiss |
     Former  |   .9403659   .0733611    -0.79   0.431     .8070339    1.095726
    Current  |   1.017705    .032511     0.55   0.583     .9559385    1.083463
             |
1.hyperten~n |   1.042148   .0270467     1.59   0.112     .9904633     1.09653
             |
      bp_cat |
High, sta..  |   6.32e+07          .        .       .            .           .
High, sta..  |   6.61e+07   1.99e+07    59.65   0.000     3.66e+07    1.19e+08
    Unknown  |   6.69e+07   2.03e+07    59.38   0.000     3.69e+07    1.21e+08
             |
    1.asthma |   .8945167   .0498918    -2.00   0.046     .8018858     .997848
1.~y_disease |   1.001372   .0263107     0.05   0.958     .9511093    1.054291
1.~c_disease |   1.041903   .0270186     1.58   0.113     .9902706    1.096227
             |
     dm_type |
       T1DM  |   .8672823   .0574425    -2.15   0.032     .7616985    .9875018
       T2DM  |   1.017807    .026712     0.67   0.501     .9667756    1.071531
 UNKNOWN_DM  |   .9887055   .0740994    -0.15   0.880     .8536363    1.145146
             |
    1.cancer |   .9736723   .0257183    -1.01   0.312     .9245479    1.025407
1.~r_disease |   .9750116   .0258852    -0.95   0.340     .9255749    1.027089
    1.stroke |   1.008781    .026437     0.33   0.739      .958274    1.061951
  1.dementia |   1.057766   .0274259     2.17   0.030     1.005355    1.112909
1.other_ne~o |   .9798969   .0258942    -0.77   0.442      .930437    1.031986
             |
      egfr60 |
   eGFR <60  |   .9514549   .0948204    -0.50   0.618     .7826343    1.156691
      1.esrf |    .977914   .0258819    -0.84   0.399     .9284796     1.02998
1.immunosu~d |   1.027581   .0224043     1.25   0.212     .9845947    1.072445
1.ra_sle_p~s |   1.018641   .0265521     0.71   0.479     .9679069    1.072035
             |
hh_total_cat |
       6-10  |   .9903822    .069337    -0.14   0.890     .8633958    1.136046
        11+  |    1.22604   .2939412     0.85   0.395     .7663557    1.961457
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_hes_eth16.ster not found)
file ./output/model/model3_hes_eth16.ster saved
(note: file ./output/model/model3_hes_eth16.dta not found)
file ./output/model/model3_hes_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
onscoviddeath
(11,899 observations deleted)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(12)      =       14.45
Log likelihood  =   -230.45742                  Prob > chi2      =      0.2728

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.003568   3.468426     0.95   0.341     .3123898    28.87873
Other White  |   .9910304   1.401597    -0.01   0.995     .0619794    15.84624
White + C..  |   .9833709   1.390752    -0.01   0.991     .0615019    15.72338
White + A..  |   .9759725   1.380284    -0.02   0.986     .0610398    15.60495
White + A..  |   2.004644   2.455386     0.57   0.570     .1817373    22.11212
Other mixed  |   1.033289   1.461372     0.02   0.982     .0646211    16.52225
     Indian  |   2.027549   2.483304     0.58   0.564     .1838383    22.36181
  Pakistani  |   7.84e-20          .        .       .            .           .
Bangladeshi  |   2.007883   2.459293     0.57   0.569     .1820415    22.14657
Other Asian  |   7.84e-20          .        .       .            .           .
  Caribbean  |   7.84e-20          .        .       .            .           .
    African  |   2.064615   2.528663     0.59   0.554     .1872058    22.76978
Other Black  |   2.105051    2.57832     0.61   0.543     .1908489    23.21859
    Chinese  |     1.0162   1.437142     0.01   0.991     .0635598    16.24709
      Other  |   7.84e-20          .        .       .            .           .
    Unknown  |   1.508647   1.600217     0.39   0.698     .1886779    12.06298
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_onscoviddeath_eth16.ster not found)
file ./output/model/crude_onscoviddeath_eth16.ster saved
(note: file ./output/model/crude_onscoviddeath_eth16.dta not found)
file ./output/model/crude_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(20)      =       24.66
Log likelihood  =   -225.35077                  Prob > chi2      =      0.2146

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.062651   3.537067     0.97   0.332     .3184502    29.45462
Other White  |   .9951451   1.407409    -0.00   0.997     .0622377     15.9118
White + C..  |   .9871122   1.396136    -0.01   0.993     .0617245    15.78613
White + A..  |   .9890644   1.398867    -0.01   0.994     .0618503    15.81638
White + A..  |   2.054943   2.517551     0.59   0.557     .1861985    22.67897
Other mixed  |    1.03305   1.461155     0.02   0.982     .0645912    16.52224
     Indian  |   2.056755   2.519339     0.59   0.556     .1864393    22.68964
  Pakistani  |   2.36e-16   1.52e-08    -0.00   1.000            0           .
Bangladeshi  |   2.067134   2.532247     0.59   0.553     .1873454    22.80836
Other Asian  |   2.31e-16   1.50e-08    -0.00   1.000            0           .
  Caribbean  |   2.37e-16   1.57e-08    -0.00   1.000            0           .
    African  |   2.049859   2.511045     0.59   0.558     .1857871    22.61687
Other Black  |   2.082698   2.551093     0.60   0.549     .1887951    22.97533
    Chinese  |   .9827365   1.389902    -0.01   0.990     .0614564    15.71474
      Other  |   2.36e-16   1.54e-08    -0.00   1.000            0           .
    Unknown  |    1.53244   1.625553     0.40   0.687     .1916292    12.25477
             |
        male |
       Male  |   1.519052   .5952166     1.07   0.286     .7047626     3.27418
        age1 |   .9527653    .042988    -1.07   0.284     .8721284    1.040858
        age2 |   .9762329   .1788088    -0.13   0.896     .6817822    1.397852
        age3 |   1.298755   .6431716     0.53   0.598     .4920322    3.428157
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_onscoviddeath_eth16.ster not found)
file ./output/model/model0_onscoviddeath_eth16.ster saved
(note: file ./output/model/model0_onscoviddeath_eth16.dta not found)
file ./output/model/model0_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(18)      =       27.08
Log likelihood  =   -224.14121                  Prob > chi2      =      0.0774

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.063131   3.537769     0.97   0.332     .3184702    29.46201
Other White  |   1.000937    1.41561     0.00   0.999     .0625987    16.00472
White + C..  |   .9725862   1.375646    -0.02   0.984     .0608094    15.55554
White + A..  |   .9968221   1.409826    -0.00   0.998      .062337    15.94005
White + A..  |   2.003598   2.454729     0.57   0.571     .1815316    22.11408
Other mixed  |   1.019542   1.442087     0.01   0.989     .0637421    16.30735
     Indian  |   2.054604    2.51675     0.59   0.557     .1862363     22.6669
  Pakistani  |   7.91e-20          .        .       .            .           .
Bangladeshi  |   2.051942   2.513589     0.59   0.557     .1859773    22.63968
Other Asian  |   7.71e-20          .        .       .            .           .
  Caribbean  |   7.98e-20          .        .       .            .           .
    African  |   2.040742   2.500008     0.58   0.560     .1849376     22.5191
Other Black  |   2.081409   2.549686     0.60   0.550     .1886478    22.96482
    Chinese  |   .9597986   1.357623    -0.03   0.977      .060002    15.35304
      Other  |   7.86e-20          .        .       .            .           .
    Unknown  |   1.530101   1.623053     0.40   0.688     .1913413    12.23577
             |
        male |
       Male  |   1.521578   .5963058     1.07   0.284     .7058439    3.280045
        age1 |   .9532583   .0430245    -1.06   0.289      .872554    1.041427
        age2 |   .9755342   .1789103    -0.14   0.893     .6809801    1.397496
        age3 |   1.299804   .6447011     0.53   0.597     .4916802    3.436155
             |
         imd |
          4  |   1.898891   .7918658     1.54   0.124     .8385644    4.299954
5 most de..  |   .8669071   .6503329    -0.19   0.849     .1992607    3.771582
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(18)      =       27.08
Log likelihood  =   -224.14121                  Prob > chi2      =      0.0774

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.063131   3.537769     0.97   0.332     .3184702    29.46201
Other White  |   1.000937    1.41561     0.00   0.999     .0625987    16.00472
White + C..  |   .9725862   1.375646    -0.02   0.984     .0608094    15.55554
White + A..  |   .9968221   1.409826    -0.00   0.998      .062337    15.94005
White + A..  |   2.003598   2.454729     0.57   0.571     .1815316    22.11408
Other mixed  |   1.019542   1.442087     0.01   0.989     .0637421    16.30735
     Indian  |   2.054604    2.51675     0.59   0.557     .1862363     22.6669
  Pakistani  |   7.91e-20          .        .       .            .           .
Bangladeshi  |   2.051942   2.513589     0.59   0.557     .1859773    22.63968
Other Asian  |   7.71e-20          .        .       .            .           .
  Caribbean  |   7.98e-20          .        .       .            .           .
    African  |   2.040742   2.500008     0.58   0.560     .1849376     22.5191
Other Black  |   2.081409   2.549686     0.60   0.550     .1886478    22.96482
    Chinese  |   .9597986   1.357623    -0.03   0.977      .060002    15.35304
      Other  |   7.86e-20          .        .       .            .           .
    Unknown  |   1.530101   1.623053     0.40   0.688     .1913413    12.23577
             |
        male |
       Male  |   1.521578   .5963058     1.07   0.284     .7058439    3.280045
        age1 |   .9532583   .0430245    -1.06   0.289      .872554    1.041427
        age2 |   .9755342   .1789103    -0.14   0.893     .6809801    1.397496
        age3 |   1.299804   .6447011     0.53   0.597     .4916802    3.436155
             |
         imd |
          4  |   1.898891   .7918658     1.54   0.124     .8385644    4.299954
5 most de..  |   .8669071   .6503329    -0.19   0.849     .1992607    3.771582
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_onscoviddeath_eth16.ster not found)
file ./output/model/model1_onscoviddeath_eth16.ster saved
(note: file ./output/model/model1_onscoviddeath_eth16.dta not found)
file ./output/model/model1_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(53)      =       49.89
Log likelihood  =   -212.73804                  Prob > chi2      =      0.5960

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.227068    3.73178     1.01   0.311     .3345638      31.127
Other White  |   1.012546   1.433133     0.01   0.993     .0631894    16.22501
White + C..  |   1.056919   1.496712     0.04   0.969     .0658639    16.96037
White + A..  |   1.056317   1.495502     0.04   0.969     .0658702    16.93946
White + A..  |   2.087281   2.560507     0.60   0.549     .1885368    23.10818
Other mixed  |   1.002615   1.419643     0.00   0.999     .0625005    16.08365
     Indian  |   2.143786   2.628949     0.62   0.534     .1937954     23.7148
  Pakistani  |   1.66e-18   1.30e-09    -0.00   1.000            0           .
Bangladeshi  |   2.087946   2.561918     0.60   0.549     .1884916    23.12845
Other Asian  |   1.55e-18   1.22e-09    -0.00   1.000            0           .
  Caribbean  |   1.57e-18   1.30e-09    -0.00   1.000            0           .
    African  |   2.160696   2.651014     0.63   0.530      .195089    23.93066
Other Black  |   2.157125   2.645759     0.63   0.531      .194921    23.87217
    Chinese  |   .9525393   1.348801    -0.03   0.973     .0593713    15.28233
      Other  |   1.61e-18   1.25e-09    -0.00   1.000            0           .
    Unknown  |   1.571836   1.669202     0.43   0.670     .1961006    12.59899
             |
        male |
       Male  |   1.450617    .569968     0.95   0.344     .6715894      3.1333
        age1 |   .9431342   .0460711    -1.20   0.231     .8570244    1.037896
        age2 |   1.006552   .1935101     0.03   0.973     .6905452    1.467169
        age3 |   1.213654   .6258747     0.38   0.707     .4417076    3.334685
             |
         imd |
          4  |    1.88567   .7880947     1.52   0.129     .8312188    4.277755
5 most de..  |   .8499491   .6386443    -0.22   0.829      .194898    3.706622
             |
   bmicat_sa |
Normal (..)  |   .5204012   .6395144    -0.53   0.595     .0468067    5.785874
Overweig..)  |    .546295   .6330404    -0.52   0.602     .0563722    5.294071
Obese I ..)  |   .6719138   .7384818    -0.36   0.718     .0779438    5.792228
Obese II..)  |   .9341915   1.002751    -0.06   0.949     .1139635    7.657837
Obese II..)  |    .407394    .457276    -0.80   0.424      .045143    3.676534
    Unknown  |   .4590501    .514585    -0.69   0.487     .0510131    4.130838
             |
    hba1ccat |
  >=6.5-7.4  |   .5862743     .36632    -0.85   0.393     .1722849    1.995053
  >=7.5-7.9  |   1.674497   1.049341     0.82   0.411     .4903091     5.71872
    >=8-8.9  |   .8929057   .6667416    -0.15   0.879     .2066355    3.858392
        >=9  |   .8151472   .8396723    -0.20   0.843     .1082492    6.138291
    Unknown  |   1.40e-18   3.82e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9884464   .0835877    -0.14   0.891     .8374742    1.166634
             |
smoke_nomiss |
     Former  |   1.627948   1.668407     0.48   0.634     .2184159     12.1338
    Current  |    .573227   .4227868    -0.75   0.451     .1350573    2.432961
             |
1.hyperten~n |   .9261627   .4600135    -0.15   0.877     .3498695    2.451707
             |
      bp_cat |
High, sta..  |   1.13e-10          .        .       .            .           .
High, sta..  |   7.27e+07   3.95e+07    33.29   0.000     2.50e+07    2.11e+08
    Unknown  |   1.18e+08          .        .       .            .           .
             |
    1.asthma |   1.874765   1.384726     0.85   0.395     .4407965    7.973615
1.~y_disease |   .9072764   .4509111    -0.20   0.845      .342529    2.403156
1.~c_disease |   .6922289   .3761369    -0.68   0.498     .2386337    2.008019
             |
     dm_type |
       T1DM  |   3.174277   2.390105     1.53   0.125     .7256442    13.88564
       T2DM  |   1.677807   .7621985     1.14   0.255     .6887407     4.08722
 UNKNOWN_DM  |   4.688998   3.535545     2.05   0.040     1.069712    20.55386
             |
    1.cancer |   .4829544   .2963995    -1.19   0.236     .1450459    1.608077
1.~r_disease |   .5099992   .3127559    -1.10   0.272     .1533106    1.696551
    1.stroke |   1.134381   .5266286     0.27   0.786     .4566615    2.817886
  1.dementia |    .333449   .2452954    -1.49   0.135     .0788604    1.409937
1.other_ne~o |   1.699014   .7183248     1.25   0.210     .7418538     3.89113
             |
      egfr60 |
   eGFR <60  |   1.37e-18   1.97e-09    -0.00   1.000            0           .
      1.esrf |   1.434247   .6320927     0.82   0.413     .6046271    3.402204
1.immunosu~d |   .9430459   .3860126    -0.14   0.886     .4227801    2.103542
1.ra_sle_p~s |    1.63391    .691077     1.16   0.246     .7131894    3.743273
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(53)      =       49.89
Log likelihood  =   -212.73804                  Prob > chi2      =      0.5960

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.227068    3.73178     1.01   0.311     .3345638      31.127
Other White  |   1.012546   1.433133     0.01   0.993     .0631894    16.22501
White + C..  |   1.056919   1.496712     0.04   0.969     .0658639    16.96037
White + A..  |   1.056317   1.495502     0.04   0.969     .0658702    16.93946
White + A..  |   2.087281   2.560507     0.60   0.549     .1885368    23.10818
Other mixed  |   1.002615   1.419643     0.00   0.999     .0625005    16.08365
     Indian  |   2.143786   2.628949     0.62   0.534     .1937954     23.7148
  Pakistani  |   1.66e-18   1.30e-09    -0.00   1.000            0           .
Bangladeshi  |   2.087946   2.561918     0.60   0.549     .1884916    23.12845
Other Asian  |   1.55e-18   1.22e-09    -0.00   1.000            0           .
  Caribbean  |   1.57e-18   1.30e-09    -0.00   1.000            0           .
    African  |   2.160696   2.651014     0.63   0.530      .195089    23.93066
Other Black  |   2.157125   2.645759     0.63   0.531      .194921    23.87217
    Chinese  |   .9525393   1.348801    -0.03   0.973     .0593713    15.28233
      Other  |   1.61e-18   1.25e-09    -0.00   1.000            0           .
    Unknown  |   1.571836   1.669202     0.43   0.670     .1961006    12.59899
             |
        male |
       Male  |   1.450617    .569968     0.95   0.344     .6715894      3.1333
        age1 |   .9431342   .0460711    -1.20   0.231     .8570244    1.037896
        age2 |   1.006552   .1935101     0.03   0.973     .6905452    1.467169
        age3 |   1.213654   .6258747     0.38   0.707     .4417076    3.334685
             |
         imd |
          4  |    1.88567   .7880947     1.52   0.129     .8312188    4.277755
5 most de..  |   .8499491   .6386443    -0.22   0.829      .194898    3.706622
             |
   bmicat_sa |
Normal (..)  |   .5204012   .6395144    -0.53   0.595     .0468067    5.785874
Overweig..)  |    .546295   .6330404    -0.52   0.602     .0563722    5.294071
Obese I ..)  |   .6719138   .7384818    -0.36   0.718     .0779438    5.792228
Obese II..)  |   .9341915   1.002751    -0.06   0.949     .1139635    7.657837
Obese II..)  |    .407394    .457276    -0.80   0.424      .045143    3.676534
    Unknown  |   .4590501    .514585    -0.69   0.487     .0510131    4.130838
             |
    hba1ccat |
  >=6.5-7.4  |   .5862743     .36632    -0.85   0.393     .1722849    1.995053
  >=7.5-7.9  |   1.674497   1.049341     0.82   0.411     .4903091     5.71872
    >=8-8.9  |   .8929057   .6667416    -0.15   0.879     .2066355    3.858392
        >=9  |   .8151472   .8396723    -0.20   0.843     .1082492    6.138291
    Unknown  |   1.40e-18   3.82e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9884464   .0835877    -0.14   0.891     .8374742    1.166634
             |
smoke_nomiss |
     Former  |   1.627948   1.668407     0.48   0.634     .2184159     12.1338
    Current  |    .573227   .4227868    -0.75   0.451     .1350573    2.432961
             |
1.hyperten~n |   .9261627   .4600135    -0.15   0.877     .3498695    2.451707
             |
      bp_cat |
High, sta..  |   1.13e-10          .        .       .            .           .
High, sta..  |   7.27e+07   3.95e+07    33.29   0.000     2.50e+07    2.11e+08
    Unknown  |   1.18e+08          .        .       .            .           .
             |
    1.asthma |   1.874765   1.384726     0.85   0.395     .4407965    7.973615
1.~y_disease |   .9072764   .4509111    -0.20   0.845      .342529    2.403156
1.~c_disease |   .6922289   .3761369    -0.68   0.498     .2386337    2.008019
             |
     dm_type |
       T1DM  |   3.174277   2.390105     1.53   0.125     .7256442    13.88564
       T2DM  |   1.677807   .7621985     1.14   0.255     .6887407     4.08722
 UNKNOWN_DM  |   4.688998   3.535545     2.05   0.040     1.069712    20.55386
             |
    1.cancer |   .4829544   .2963995    -1.19   0.236     .1450459    1.608077
1.~r_disease |   .5099992   .3127559    -1.10   0.272     .1533106    1.696551
    1.stroke |   1.134381   .5266286     0.27   0.786     .4566615    2.817886
  1.dementia |    .333449   .2452954    -1.49   0.135     .0788604    1.409937
1.other_ne~o |   1.699014   .7183248     1.25   0.210     .7418538     3.89113
             |
      egfr60 |
   eGFR <60  |   1.37e-18   1.97e-09    -0.00   1.000            0           .
      1.esrf |   1.434247   .6320927     0.82   0.413     .6046271    3.402204
1.immunosu~d |   .9430459   .3860126    -0.14   0.886     .4227801    2.103542
1.ra_sle_p~s |    1.63391    .691077     1.16   0.246     .7131894    3.743273
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_onscoviddeath_eth16.ster not found)
file ./output/model/model2_onscoviddeath_eth16.ster saved
(note: file ./output/model/model2_onscoviddeath_eth16.dta not found)
file ./output/model/model2_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(56)      =       51.90
Log likelihood  =   -211.73123                  Prob > chi2      =      0.6306

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.129987   3.621008     0.99   0.324     .3241958    30.21883
Other White  |   .9872624   1.397544    -0.01   0.993     .0615875    15.82604
White + C..  |   1.028653   1.456804     0.02   0.984     .0640879    16.51057
White + A..  |   1.041816   1.474973     0.03   0.977     .0649657    16.70696
White + A..  |   2.050208   2.515161     0.59   0.558     .1851647    22.70062
Other mixed  |   .9885207   1.399586    -0.01   0.993     .0616342    15.85439
     Indian  |   2.092946   2.566796     0.60   0.547     .1891654    23.15658
  Pakistani  |   8.40e-17   9.16e-09    -0.00   1.000            0           .
Bangladeshi  |   2.059599   2.526748     0.59   0.556     .1860011    22.80604
Other Asian  |   8.15e-17   8.75e-09    -0.00   1.000            0           .
  Caribbean  |   7.69e-17   9.02e-09    -0.00   1.000            0           .
    African  |   2.109794   2.589452     0.61   0.543     .1903353    23.38625
Other Black  |   2.083504     2.5559     0.60   0.550      .188191    23.06694
    Chinese  |   .9212093   1.304973    -0.06   0.954     .0573532    14.79651
      Other  |   8.89e-17   9.12e-09    -0.00   1.000            0           .
    Unknown  |   1.506462   1.600954     0.39   0.700     .1876573    12.09346
             |
        male |
       Male  |   1.453119    .571098     0.95   0.342     .6726137    3.139326
        age1 |   .9426107   .0460574    -1.21   0.226     .8565277    1.037345
        age2 |   1.008768    .193676     0.05   0.964     .6924158    1.469656
        age3 |   1.205317   .6204261     0.36   0.717     .4394937    3.305595
             |
         imd |
          4  |   1.869677   .7819464     1.50   0.135     .8237062    4.243856
5 most de..  |   .8466682   .6362738    -0.22   0.825     .1941032    3.693124
             |
   bmicat_sa |
Normal (..)  |   .5280748   .6494413    -0.52   0.604     .0474093    5.882029
Overweig..)  |   .5443066   .6310463    -0.52   0.600     .0561043    5.280694
Obese I ..)  |   .6792653    .746892    -0.35   0.725     .0787215    5.861185
Obese II..)  |   .9357931   1.004974    -0.06   0.951     .1140384    7.679069
Obese II..)  |   .4116175   .4621616    -0.79   0.429     .0455796    3.717214
    Unknown  |   .4626193   .5189425    -0.69   0.492     .0513322    4.169249
             |
    hba1ccat |
  >=6.5-7.4  |   .5933997   .3708275    -0.84   0.404     .1743469     2.01967
  >=7.5-7.9  |   1.643718   1.031204     0.79   0.428     .4806365    5.621315
    >=8-8.9  |   .8649522   .6469403    -0.19   0.846     .1996809    3.746689
        >=9  |   .8065702   .8309451    -0.21   0.835     .1070821    6.075295
    Unknown  |   6.79e-17   2.71e-08    -0.00   1.000            0           .
             |
gp_consult~t |   .9890604   .0835363    -0.13   0.896     .8381661     1.16712
             |
smoke_nomiss |
     Former  |   1.562469   1.602778     0.44   0.664     .2092427    11.66736
    Current  |    .573512   .4230519    -0.75   0.451     .1350991    2.434627
             |
1.hyperten~n |   .9312668   .4626904    -0.14   0.886     .3516927    2.465954
             |
      bp_cat |
High, sta..  |   6.33e-09   3.557531    -0.00   1.000            0           .
High, sta..  |   9.31e+07   5.06e+07    33.75   0.000     3.21e+07    2.70e+08
    Unknown  |   1.52e+08          .        .       .            .           .
             |
    1.asthma |   1.886003   1.392491     0.86   0.390     .4436857     8.01695
1.~y_disease |   .9053321   .4501866    -0.20   0.841     .3416161    2.399261
1.~c_disease |   .6879601    .374029    -0.69   0.491     .2370191    1.996839
             |
     dm_type |
       T1DM  |   3.153455   2.375249     1.52   0.127     .7205161     13.8016
       T2DM  |   1.688725   .7676595     1.15   0.249       .69282    4.116211
 UNKNOWN_DM  |    4.67835   3.528674     2.05   0.041     1.066765    20.51713
             |
    1.cancer |   .4797425   .2944933    -1.20   0.231      .144043    1.597807
1.~r_disease |   .5184288   .3180757    -1.07   0.284      .155756    1.725574
    1.stroke |   1.141862   .5302166     0.29   0.775     .4595827    2.837029
  1.dementia |   .3383173   .2489139    -1.47   0.141     .0799946     1.43083
1.other_ne~o |   1.698155   .7184792     1.25   0.211     .7410351    3.891487
             |
      egfr60 |
   eGFR <60  |   6.98e-17   1.44e-08    -0.00   1.000            0           .
      1.esrf |   1.447066   .6375956     0.84   0.402      .610152    3.431931
1.immunosu~d |   .9448369   .3868193    -0.14   0.890     .4235183    2.107859
1.ra_sle_p~s |   1.664001   .7040945     1.20   0.229     .7260755    3.813515
             |
hh_total_cat |
       6-10  |   .2996195   .2219545    -1.63   0.104     .0701471    1.279764
        11+  |   1.79e-17   1.14e-08    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_onscoviddeath_eth16.ster not found)
file ./output/model/model3_onscoviddeath_eth16.ster saved
(note: file ./output/model/model3_onscoviddeath_eth16.dta not found)
file ./output/model/model3_onscoviddeath_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
ons_noncoviddeath
(11,899 observations deleted)

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(15)      =       18.88
Log likelihood  =   -879.97476                  Prob > chi2      =      0.2191

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.16e-20          .        .       .            .           .
Other White  |   1.512827   .9765912     0.64   0.521     .4268787    5.361352
White + C..  |   .7401126   .5652982    -0.39   0.694     .1656342    3.307088
White + A..  |   1.960397   1.200568     1.10   0.272      .590281    6.510721
White + A..  |   1.510082   .9748199     0.64   0.523     .4261036    5.351629
Other mixed  |   .5144838   .4455773    -0.77   0.443     .0942268    2.809112
     Indian  |   1.788924    1.12131     0.93   0.353     .5236639    6.111265
  Pakistani  |   .9747121   .6892467    -0.04   0.971     .2437629    3.897492
Bangladeshi  |   1.001536   .7082404     0.00   0.998     .2504584    4.004952
Other Asian  |   1.250777   .8390843     0.33   0.739     .3358541    4.658101
  Caribbean  |   .7716017   .5893466    -0.34   0.734     .1726826    3.447767
    African  |   1.286534   .8630539     0.38   0.707      .345465    4.791134
Other Black  |   1.307732   .8773156     0.40   0.689     .3511358    4.870377
    Chinese  |   1.534522   .9905502     0.66   0.507     .4330259    5.437918
      Other  |   2.001072   1.225545     1.13   0.257      .602489    6.646244
    Unknown  |   1.185992     .63871     0.32   0.751      .412735    3.407941
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_ons_noncoviddeath_eth16.ster not found)
file ./output/model/crude_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/crude_ons_noncoviddeath_eth16.dta not found)
file ./output/model/crude_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(20)      =       20.64
Log likelihood  =   -879.09341                  Prob > chi2      =      0.4183

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.27e-17   1.79e-09    -0.00   1.000            0           .
Other White  |   1.514252   .9775288     0.64   0.520     .4272706    5.366526
White + C..  |   .7424914   .5671271    -0.39   0.697     .1661612    3.317822
White + A..  |   1.954678   1.197081     1.09   0.274     .5885501    6.491828
White + A..  |   1.506008   .9722032     0.63   0.526     .4249464    5.337284
Other mixed  |   .5150971   .4461175    -0.77   0.444     .0943359    2.812557
     Indian  |    1.78573   1.119328     0.93   0.355     .5227182    6.100482
  Pakistani  |   .9781069    .691659    -0.03   0.975     .2446061    3.911158
Bangladeshi  |   .9989069   .7063993    -0.00   0.999     .2497922    3.994581
Other Asian  |   1.256207   .8427428     0.34   0.734     .3373042    4.678437
  Caribbean  |   .7724389   .5899949    -0.34   0.735      .172866    3.451585
    African  |   1.292996   .8674316     0.38   0.702     .3471779     4.81551
Other Black  |   1.304863   .8754074     0.40   0.692     .3503564    4.859814
    Chinese  |   1.539013   .9934676     0.67   0.504     .4342827    5.453962
      Other  |   2.001445   1.225779     1.13   0.257     .6025983    6.647519
    Unknown  |   1.186315   .6388915     0.32   0.751     .4128422    3.408912
             |
        male |
       Male  |   1.161394   .2314634     0.75   0.453      .785845    1.716415
        age1 |   1.020134   .0294779     0.69   0.490     .9639636    1.079577
        age2 |   .9638359   .0982407    -0.36   0.718     .7893013    1.176965
        age3 |   1.064215   .2857894     0.23   0.817     .6287007    1.801421
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_ons_noncoviddeath_eth16.ster not found)
file ./output/model/model0_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/model0_ons_noncoviddeath_eth16.dta not found)
file ./output/model/model0_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(21)      =       22.23
Log likelihood  =   -878.30099                  Prob > chi2      =      0.3864

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.16e-20          .        .       .            .           .
Other White  |   1.515094   .9780823     0.64   0.520     .4275028    5.369579
White + C..  |   .7406422   .5657201    -0.39   0.694      .165745    3.309607
White + A..  |   1.949112   1.193705     1.09   0.276     .5868549    6.473555
White + A..  |   1.503364   .9704955     0.63   0.528     .4242011    5.327907
Other mixed  |   .5171367   .4478876    -0.76   0.446     .0947081    2.823733
     Indian  |   1.789899   1.121944     0.93   0.353      .523936    6.114749
  Pakistani  |   .9757977   .6900313    -0.03   0.972     .2440261    3.901965
Bangladeshi  |   .9993542   .7067164    -0.00   0.999     .2499037    3.996375
Other Asian  |   1.259781    .845149     0.34   0.731     .3382594     4.69181
  Caribbean  |   .7713331   .5891612    -0.34   0.734     .1726138    3.446739
    African  |    1.29461   .8685404     0.38   0.700     .3475978    4.821711
Other Black  |   1.303492   .8744816     0.40   0.693     .3499918    4.854663
    Chinese  |   1.539296   .9936807     0.67   0.504     .4343456    5.455176
      Other  |   2.009096   1.230482     1.14   0.255     .6048916    6.673044
    Unknown  |   1.188873   .6402781     0.32   0.748     .4137265    3.416313
             |
        male |
       Male  |   1.161448   .2314777     0.75   0.453     .7858771    1.716505
        age1 |   1.020003   .0294719     0.69   0.493     .9638438    1.079433
        age2 |   .9641716   .0982635    -0.36   0.720     .7895946    1.177347
        age3 |   1.063304   .2855186     0.23   0.819     .6281926    1.799792
             |
         imd |
          4  |   1.096552   .2747922     0.37   0.713     .6709974    1.791997
5 most de..  |   1.468264   .4321364     1.30   0.192     .8246699    2.614135
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(21)      =       22.23
Log likelihood  =   -878.30099                  Prob > chi2      =      0.3864

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.16e-20          .        .       .            .           .
Other White  |   1.515094   .9780823     0.64   0.520     .4275028    5.369579
White + C..  |   .7406422   .5657201    -0.39   0.694      .165745    3.309607
White + A..  |   1.949112   1.193705     1.09   0.276     .5868549    6.473555
White + A..  |   1.503364   .9704955     0.63   0.528     .4242011    5.327907
Other mixed  |   .5171367   .4478876    -0.76   0.446     .0947081    2.823733
     Indian  |   1.789899   1.121944     0.93   0.353      .523936    6.114749
  Pakistani  |   .9757977   .6900313    -0.03   0.972     .2440261    3.901965
Bangladeshi  |   .9993542   .7067164    -0.00   0.999     .2499037    3.996375
Other Asian  |   1.259781    .845149     0.34   0.731     .3382594     4.69181
  Caribbean  |   .7713331   .5891612    -0.34   0.734     .1726138    3.446739
    African  |    1.29461   .8685404     0.38   0.700     .3475978    4.821711
Other Black  |   1.303492   .8744816     0.40   0.693     .3499918    4.854663
    Chinese  |   1.539296   .9936807     0.67   0.504     .4343456    5.455176
      Other  |   2.009096   1.230482     1.14   0.255     .6048916    6.673044
    Unknown  |   1.188873   .6402781     0.32   0.748     .4137265    3.416313
             |
        male |
       Male  |   1.161448   .2314777     0.75   0.453     .7858771    1.716505
        age1 |   1.020003   .0294719     0.69   0.493     .9638438    1.079433
        age2 |   .9641716   .0982635    -0.36   0.720     .7895946    1.177347
        age3 |   1.063304   .2855186     0.23   0.819     .6281926    1.799792
             |
         imd |
          4  |   1.096552   .2747922     0.37   0.713     .6709974    1.791997
5 most de..  |   1.468264   .4321364     1.30   0.192     .8246699    2.614135
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_ons_noncoviddeath_eth16.ster not found)
file ./output/model/model1_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/model1_ons_noncoviddeath_eth16.dta not found)
file ./output/model/model1_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(54)      =       45.63
Log likelihood  =   -866.60145                  Prob > chi2      =      0.7841

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.70e-18   6.49e-10    -0.00   1.000            0           .
Other White  |   1.476183   .9533467     0.60   0.546     .4163114    5.234343
White + C..  |   .7269135   .5553712    -0.42   0.676     .1626124    3.249463
White + A..  |   1.921612   1.177302     1.07   0.286     .5783157    6.385078
White + A..  |   1.491604   .9631796     0.62   0.536       .42073    5.288146
Other mixed  |   .5124985   .4439514    -0.77   0.440     .0938296    2.799273
     Indian  |   1.796907   1.126775     0.93   0.350     .5257364    6.141625
  Pakistani  |    .968539   .6850704    -0.05   0.964     .2421265    3.874289
Bangladeshi  |   .9824752   .6950485    -0.02   0.980     .2455513    3.930982
Other Asian  |   1.241358   .8330905     0.32   0.747     .3331543    4.625394
  Caribbean  |   .7601515   .5807468    -0.36   0.720     .1700561    3.397881
    African  |   1.274225    .855122     0.36   0.718     .3419884    4.747671
Other Black  |   1.276755   .8568888     0.36   0.716     .3426317    4.757599
    Chinese  |   1.483442   .9581225     0.61   0.541     .4183097    5.260693
      Other  |   1.970722   1.207758     1.11   0.268     .5928787    6.550655
    Unknown  |   1.178971    .635144     0.31   0.760     .4101448    3.388978
             |
        male |
       Male  |   1.182098   .2381446     0.83   0.406     .7964726    1.754429
        age1 |   1.022978    .030165     0.77   0.441     .9655317    1.083842
        age2 |   .9557937   .0984593    -0.44   0.661     .7810508    1.169632
        age3 |   1.083139   .2930751     0.30   0.768     .6373336     1.84078
             |
         imd |
          4  |   1.095041    .274475     0.36   0.717     .6699995    1.789726
5 most de..  |   1.474591   .4341951     1.32   0.187     .8280079    2.626086
             |
   bmicat_sa |
Normal (..)  |   .7372584    .491947    -0.46   0.648      .199362    2.726447
Overweig..)  |   .8438245   .5341864    -0.27   0.789     .2440033    2.918157
Obese I ..)  |   .7207546    .451694    -0.52   0.601     .2110294    2.461682
Obese II..)  |   .8578673   .5316194    -0.25   0.805     .2546428    2.890073
Obese II..)  |   .6175712   .3840319    -0.78   0.438     .1825466    2.089297
    Unknown  |   .8331433    .523094    -0.29   0.771     .2433816    2.852014
             |
    hba1ccat |
  >=6.5-7.4  |   .8336693    .231747    -0.65   0.513      .483474    1.437522
  >=7.5-7.9  |   .8522311   .3632282    -0.38   0.708     .3696307    1.964929
    >=8-8.9  |   .7122126   .3034612    -0.80   0.426     .3089782    1.641692
        >=9  |   1.042297    .483397     0.09   0.929     .4199728    2.586796
    Unknown  |   1.46e-18   1.81e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9796679   .0428009    -0.47   0.638     .8992711    1.067252
             |
smoke_nomiss |
     Former  |   1.49e-18   8.45e-10    -0.00   1.000            0           .
    Current  |   .9511307   .2927311    -0.16   0.871     .5203127    1.738665
             |
1.hyperten~n |   1.382791   .3149059     1.42   0.155     .8849338     2.16074
             |
      bp_cat |
High, sta..  |   1.01e-10   .2220749    -0.00   1.000            0           .
High, sta..  |   7.91e+07   3.63e+07    39.63   0.000     3.22e+07    1.94e+08
    Unknown  |   3.67e+07          .        .       .            .           .
             |
    1.asthma |   .7415742   .4349266    -0.51   0.610     .2349268    2.340867
1.~y_disease |   1.180916    .280462     0.70   0.484     .7414175    1.880942
1.~c_disease |   .9859726   .2464122    -0.06   0.955     .6041355    1.609146
             |
     dm_type |
       T1DM  |   .9730741   .5731944    -0.05   0.963     .3067194      3.0871
       T2DM  |   1.008522   .2539589     0.03   0.973     .6156611    1.652072
 UNKNOWN_DM  |   1.477354   .8706597     0.66   0.508     .4654142     4.68953
             |
    1.cancer |   1.232043    .288248     0.89   0.372     .7788957    1.948823
1.~r_disease |   1.071444    .262925     0.28   0.779     .6623542    1.733199
    1.stroke |   .6457955   .1860335    -1.52   0.129     .3671896    1.135794
  1.dementia |   .9335703   .2378909    -0.27   0.787     .5665592    1.538328
1.other_ne~o |   1.473994   .3317361     1.72   0.085     .9482547    2.291219
             |
      egfr60 |
   eGFR <60  |   1.733365   1.278754     0.75   0.456     .4082569    7.359467
      1.esrf |   .8174108   .2175114    -0.76   0.449     .4852185     1.37703
1.immunosu~d |   .8697692   .1846676    -0.66   0.511     .5736917     1.31865
1.ra_sle_p~s |   1.236786   .2894343     0.91   0.364      .781799    1.956563
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(54)      =       45.63
Log likelihood  =   -866.60145                  Prob > chi2      =      0.7841

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.70e-18   6.49e-10    -0.00   1.000            0           .
Other White  |   1.476183   .9533467     0.60   0.546     .4163114    5.234343
White + C..  |   .7269135   .5553712    -0.42   0.676     .1626124    3.249463
White + A..  |   1.921612   1.177302     1.07   0.286     .5783157    6.385078
White + A..  |   1.491604   .9631796     0.62   0.536       .42073    5.288146
Other mixed  |   .5124985   .4439514    -0.77   0.440     .0938296    2.799273
     Indian  |   1.796907   1.126775     0.93   0.350     .5257364    6.141625
  Pakistani  |    .968539   .6850704    -0.05   0.964     .2421265    3.874289
Bangladeshi  |   .9824752   .6950485    -0.02   0.980     .2455513    3.930982
Other Asian  |   1.241358   .8330905     0.32   0.747     .3331543    4.625394
  Caribbean  |   .7601515   .5807468    -0.36   0.720     .1700561    3.397881
    African  |   1.274225    .855122     0.36   0.718     .3419884    4.747671
Other Black  |   1.276755   .8568888     0.36   0.716     .3426317    4.757599
    Chinese  |   1.483442   .9581225     0.61   0.541     .4183097    5.260693
      Other  |   1.970722   1.207758     1.11   0.268     .5928787    6.550655
    Unknown  |   1.178971    .635144     0.31   0.760     .4101448    3.388978
             |
        male |
       Male  |   1.182098   .2381446     0.83   0.406     .7964726    1.754429
        age1 |   1.022978    .030165     0.77   0.441     .9655317    1.083842
        age2 |   .9557937   .0984593    -0.44   0.661     .7810508    1.169632
        age3 |   1.083139   .2930751     0.30   0.768     .6373336     1.84078
             |
         imd |
          4  |   1.095041    .274475     0.36   0.717     .6699995    1.789726
5 most de..  |   1.474591   .4341951     1.32   0.187     .8280079    2.626086
             |
   bmicat_sa |
Normal (..)  |   .7372584    .491947    -0.46   0.648      .199362    2.726447
Overweig..)  |   .8438245   .5341864    -0.27   0.789     .2440033    2.918157
Obese I ..)  |   .7207546    .451694    -0.52   0.601     .2110294    2.461682
Obese II..)  |   .8578673   .5316194    -0.25   0.805     .2546428    2.890073
Obese II..)  |   .6175712   .3840319    -0.78   0.438     .1825466    2.089297
    Unknown  |   .8331433    .523094    -0.29   0.771     .2433816    2.852014
             |
    hba1ccat |
  >=6.5-7.4  |   .8336693    .231747    -0.65   0.513      .483474    1.437522
  >=7.5-7.9  |   .8522311   .3632282    -0.38   0.708     .3696307    1.964929
    >=8-8.9  |   .7122126   .3034612    -0.80   0.426     .3089782    1.641692
        >=9  |   1.042297    .483397     0.09   0.929     .4199728    2.586796
    Unknown  |   1.46e-18   1.81e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9796679   .0428009    -0.47   0.638     .8992711    1.067252
             |
smoke_nomiss |
     Former  |   1.49e-18   8.45e-10    -0.00   1.000            0           .
    Current  |   .9511307   .2927311    -0.16   0.871     .5203127    1.738665
             |
1.hyperten~n |   1.382791   .3149059     1.42   0.155     .8849338     2.16074
             |
      bp_cat |
High, sta..  |   1.01e-10   .2220749    -0.00   1.000            0           .
High, sta..  |   7.91e+07   3.63e+07    39.63   0.000     3.22e+07    1.94e+08
    Unknown  |   3.67e+07          .        .       .            .           .
             |
    1.asthma |   .7415742   .4349266    -0.51   0.610     .2349268    2.340867
1.~y_disease |   1.180916    .280462     0.70   0.484     .7414175    1.880942
1.~c_disease |   .9859726   .2464122    -0.06   0.955     .6041355    1.609146
             |
     dm_type |
       T1DM  |   .9730741   .5731944    -0.05   0.963     .3067194      3.0871
       T2DM  |   1.008522   .2539589     0.03   0.973     .6156611    1.652072
 UNKNOWN_DM  |   1.477354   .8706597     0.66   0.508     .4654142     4.68953
             |
    1.cancer |   1.232043    .288248     0.89   0.372     .7788957    1.948823
1.~r_disease |   1.071444    .262925     0.28   0.779     .6623542    1.733199
    1.stroke |   .6457955   .1860335    -1.52   0.129     .3671896    1.135794
  1.dementia |   .9335703   .2378909    -0.27   0.787     .5665592    1.538328
1.other_ne~o |   1.473994   .3317361     1.72   0.085     .9482547    2.291219
             |
      egfr60 |
   eGFR <60  |   1.733365   1.278754     0.75   0.456     .4082569    7.359467
      1.esrf |   .8174108   .2175114    -0.76   0.449     .4852185     1.37703
1.immunosu~d |   .8697692   .1846676    -0.66   0.511     .5736917     1.31865
1.ra_sle_p~s |   1.236786   .2894343     0.91   0.364      .781799    1.956563
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_ons_noncoviddeath_eth16.ster not found)
file ./output/model/model2_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/model2_ons_noncoviddeath_eth16.dta not found)
file ./output/model/model2_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(56)      =       46.95
Log likelihood  =   -865.94244                  Prob > chi2      =      0.8002

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.41e-17   2.91e-09    -0.00   1.000            0           .
Other White  |   1.477137    .953964     0.60   0.546     .4165799    5.237734
White + C..  |   .7290155   .5569851    -0.41   0.679     .1630792    3.258929
White + A..  |   1.927812   1.181137     1.07   0.284     .5801606    6.405913
White + A..  |   1.493903    .964681     0.62   0.534     .4213696    5.296413
Other mixed  |   .5130829   .4444537    -0.77   0.441      .093938    2.802423
     Indian  |   1.805962   1.132465     0.94   0.346     .5283793    6.172649
  Pakistani  |   .9704962   .6864548    -0.04   0.966     .2426157    3.882118
Bangladeshi  |   .9829131    .695363    -0.02   0.981     .2456584    3.932771
Other Asian  |   1.244898   .8354648     0.33   0.744      .334105    4.638575
  Caribbean  |   .7608829   .5813068    -0.36   0.721     .1702192    3.401161
    African  |   1.276788   .8568442     0.36   0.716     .3426755    4.757235
Other Black  |   1.280522   .8594322     0.37   0.713     .3436345    4.771748
    Chinese  |   1.491659   .9634269     0.62   0.536     .4206288    5.289812
      Other  |   1.979221   1.212986     1.11   0.265     .5954244    6.579033
    Unknown  |   1.183557   .6376238     0.31   0.754     .4117343    3.402212
             |
        male |
       Male  |   1.181079   .2379468     0.83   0.409     .7957766    1.752939
        age1 |   1.022923   .0301579     0.77   0.442     .9654899    1.083772
        age2 |    .956002    .098473    -0.44   0.662     .7812333    1.169868
        age3 |    1.08274   .2929536     0.29   0.769     .6371143    1.840056
             |
         imd |
          4  |   1.095788   .2746605     0.36   0.715     .6704588    1.790941
5 most de..  |   1.475205   .4343725     1.32   0.187     .8283563    2.627168
             |
   bmicat_sa |
Normal (..)  |   .7359938   .4910831    -0.46   0.646     .1990306    2.721625
Overweig..)  |   .8427534   .5335054    -0.27   0.787     .2436952    2.914432
Obese I ..)  |   .7204943   .4515292    -0.52   0.601     .2109541    2.460782
Obese II..)  |   .8583709   .5319276    -0.25   0.805     .2547946    2.891744
Obese II..)  |   .6162016   .3831691    -0.78   0.436     .1821483    2.084589
    Unknown  |   .8329567   .5229814    -0.29   0.771     .2433245    2.851406
             |
    hba1ccat |
  >=6.5-7.4  |    .830838   .2309682    -0.67   0.505     .4818227    1.432668
  >=7.5-7.9  |   .8486421   .3617137    -0.39   0.700     .3680612    1.956722
    >=8-8.9  |   .7118594   .3033106    -0.80   0.425     .3088249    1.640877
        >=9  |   1.041582   .4830621     0.09   0.930     .4196868    2.585005
    Unknown  |   2.94e-17   8.14e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9798459   .0428057    -0.47   0.641     .8994397     1.06744
             |
smoke_nomiss |
     Former  |   3.02e-17   3.83e-09    -0.00   1.000            0           .
    Current  |   .9531146   .2933389    -0.16   0.876      .521401    1.742282
             |
1.hyperten~n |    1.38049    .314381     1.42   0.157     .8834624    2.157142
             |
      bp_cat |
High, sta..  |   2.08e-09   1.010506    -0.00   1.000            0           .
High, sta..  |   8.03e+07   3.69e+07    39.67   0.000     3.27e+07    1.97e+08
    Unknown  |   3.72e+07          .        .       .            .           .
             |
    1.asthma |   .7411721   .4346863    -0.51   0.610     .2348021     2.33957
1.~y_disease |   1.178593    .279915     0.69   0.489     .7399532    1.877257
1.~c_disease |   .9864263   .2465298    -0.05   0.956     .6044084      1.6099
             |
     dm_type |
       T1DM  |   .9732204   .5732896    -0.05   0.963     .3067599     3.08762
       T2DM  |   1.008227   .2538903     0.03   0.974     .6154741    1.651607
 UNKNOWN_DM  |   1.473322   .8682863     0.66   0.511     .4641422    4.676749
             |
    1.cancer |   1.231691   .2881667     0.89   0.373     .7786719     1.94827
1.~r_disease |   1.071419   .2629269     0.28   0.779     .6623292    1.733184
    1.stroke |   .6451942   .1858601    -1.52   0.128     .3668479    1.134736
  1.dementia |   .9331777   .2377991    -0.27   0.786      .566311    1.537707
1.other_ne~o |   1.469537   .3307477     1.71   0.087     .9453682    2.284335
             |
      egfr60 |
   eGFR <60  |    1.71626   1.266247     0.73   0.464     .4041765    7.287775
      1.esrf |   .8170245   .2174109    -0.76   0.448     .4849865    1.376387
1.immunosu~d |   .8712961   .1849932    -0.65   0.516     .5746972    1.320969
1.ra_sle_p~s |   1.236364   .2893372     0.91   0.365     .7815301      1.9559
             |
hh_total_cat |
       6-10  |   2.345646   2.358071     0.85   0.396     .3270034    16.82568
        11+  |   6.84e-17   3.00e-08    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_ons_noncoviddeath_eth16.ster not found)
file ./output/model/model3_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/model3_ons_noncoviddeath_eth16.dta not found)
file ./output/model/model3_ons_noncoviddeath_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
onsdeath
(11,899 observations deleted)

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(16)      =       11.94
Log likelihood  =   -1121.1305                  Prob > chi2      =      0.7483

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .6018966   .4395801    -0.70   0.487     .1438362    2.518695
Other White  |   1.406767   .8237708     0.58   0.560      .446455    4.432681
White + C..  |   .7888703   .5292155    -0.35   0.724      .211824    2.937894
White + A..  |   1.762742   .9832672     1.02   0.310     .5907229    5.260096
White + A..  |   1.609251   .9174799     0.83   0.404     .5264166    4.919467
Other mixed  |   .6179435   .4513051    -0.66   0.510     .1476683    2.585891
     Indian  |   1.836826    1.02457     1.09   0.276     .6155639     5.48104
  Pakistani  |   .7794731   .5228999    -0.37   0.710     .2093067    2.902814
Bangladeshi  |   1.202445   .7281664     0.30   0.761     .3669459    3.940294
Other Asian  |   .9993703   .6320832    -0.00   0.999     .2893059    3.452197
  Caribbean  |   .6160764   .4499354    -0.66   0.507      .147225    2.578028
    African  |   1.441817   .8442605     0.62   0.532     .4576002    4.542908
Other Black  |   1.466523   .8587687     0.65   0.513     .4654157    4.621008
    Chinese  |   1.430201    .837456     0.61   0.541     .4539156     4.50629
      Other  |   1.598331   .9112807     0.82   0.411     .5228271    4.886244
    Unknown  |   1.250782   .6002785     0.47   0.641     .4882821       3.204
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_onsdeath_eth16.ster not found)
file ./output/model/crude_onsdeath_eth16.ster saved
(note: file ./output/model/crude_onsdeath_eth16.dta not found)
file ./output/model/crude_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(20)      =       13.58
Log likelihood  =   -1120.3091                  Prob > chi2      =      0.8512

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .6028334   .4402672    -0.69   0.488     .1440587    2.522639
Other White  |    1.40486   .8226582     0.58   0.562     .4458474    4.426697
White + C..  |   .7891798   .5294359    -0.35   0.724     .2119003     2.93914
White + A..  |   1.765373   .9847561     1.02   0.308     .5915905    5.268071
White + A..  |   1.610048   .9179592     0.84   0.404     .5266613    4.922053
Other mixed  |   .6188436   .4519705    -0.66   0.511     .1478797    2.589723
     Indian  |   1.839549   1.026118     1.09   0.275     .6164572    5.489335
  Pakistani  |   .7825782   .5249926    -0.37   0.715     .2101354    2.914448
Bangladeshi  |   1.204686   .7295454     0.31   0.758     .3676162    3.947778
Other Asian  |   .9994478   .6321449    -0.00   0.999     .2893211    3.452551
  Caribbean  |   .6170294   .4506391    -0.66   0.509     .1474492    2.582078
    African  |   1.441668   .8442287     0.62   0.532     .4575186    4.542781
Other Black  |   1.459235   .8545168     0.65   0.519     .4630927    4.598141
    Chinese  |    1.42543   .8346833     0.61   0.545     .4523878    4.491388
      Other  |   1.600324   .9124213     0.82   0.410     .5234762    4.892363
    Unknown  |   1.252393   .6010579     0.47   0.639     .4889062    3.208158
             |
        male |
       Male  |    1.22844   .2178762     1.16   0.246     .8677308    1.739095
        age1 |   .9986704   .0238011    -0.06   0.955     .9530939    1.046426
        age2 |   .9888789     .08624    -0.13   0.898     .8335082    1.173212
        age3 |   1.048108   .2425117     0.20   0.839     .6659695    1.649519
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_onsdeath_eth16.ster not found)
file ./output/model/model0_onsdeath_eth16.ster saved
(note: file ./output/model/model0_onsdeath_eth16.dta not found)
file ./output/model/model0_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(22)      =       15.49
Log likelihood  =   -1119.3518                  Prob > chi2      =      0.8402

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .6041125   .4412044    -0.69   0.490      .144363    2.528016
Other White  |   1.406706   .8237448     0.58   0.560     .4464301    4.432549
White + C..  |   .7858095   .5271827    -0.36   0.719     .2109913    2.926645
White + A..  |   1.764593   .9843438     1.02   0.309     .5913145    5.265877
White + A..  |   1.604523   .9148086     0.83   0.407      .524854    4.905159
Other mixed  |   .6199684   .4527953    -0.65   0.513     .1481469    2.594457
     Indian  |   1.842403   1.027712     1.10   0.273     .6174127    5.497862
  Pakistani  |    .782187   .5247314    -0.37   0.714     .2100297       2.913
Bangladeshi  |   1.204494   .7294281     0.31   0.759     .3675586    3.947142
Other Asian  |   1.000472   .6327987     0.00   0.999      .289614     3.45613
  Caribbean  |    .617925   .4513005    -0.66   0.510     .1476597    2.585886
    African  |   1.440637   .8436518     0.62   0.533     .4571745    4.539698
Other Black  |   1.457705   .8536171     0.64   0.520     .4626095    4.593297
    Chinese  |   1.421157   .8322108     0.60   0.548     .4510135    4.478107
      Other  |   1.604907   .9150458     0.83   0.407     .5249682    4.906443
    Unknown  |   1.253718   .6016995     0.47   0.638     .4894194     3.21158
             |
        male |
       Male  |   1.229886    .218137     1.17   0.243     .8687457    1.741153
        age1 |   .9986702   .0237988    -0.06   0.955      .953098    1.046421
        age2 |   .9889186   .0862377    -0.13   0.898     .8335514    1.173245
        age3 |   1.047971   .2424688     0.20   0.840     .6658971    1.649269
             |
         imd |
          4  |   1.257982   .2684928     1.08   0.282     .8279449    1.911382
5 most de..  |   1.353986   .3701269     1.11   0.268     .7923717    2.313659
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(22)      =       15.49
Log likelihood  =   -1119.3518                  Prob > chi2      =      0.8402

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .6041125   .4412044    -0.69   0.490      .144363    2.528016
Other White  |   1.406706   .8237448     0.58   0.560     .4464301    4.432549
White + C..  |   .7858095   .5271827    -0.36   0.719     .2109913    2.926645
White + A..  |   1.764593   .9843438     1.02   0.309     .5913145    5.265877
White + A..  |   1.604523   .9148086     0.83   0.407      .524854    4.905159
Other mixed  |   .6199684   .4527953    -0.65   0.513     .1481469    2.594457
     Indian  |   1.842403   1.027712     1.10   0.273     .6174127    5.497862
  Pakistani  |    .782187   .5247314    -0.37   0.714     .2100297       2.913
Bangladeshi  |   1.204494   .7294281     0.31   0.759     .3675586    3.947142
Other Asian  |   1.000472   .6327987     0.00   0.999      .289614     3.45613
  Caribbean  |    .617925   .4513005    -0.66   0.510     .1476597    2.585886
    African  |   1.440637   .8436518     0.62   0.533     .4571745    4.539698
Other Black  |   1.457705   .8536171     0.64   0.520     .4626095    4.593297
    Chinese  |   1.421157   .8322108     0.60   0.548     .4510135    4.478107
      Other  |   1.604907   .9150458     0.83   0.407     .5249682    4.906443
    Unknown  |   1.253718   .6016995     0.47   0.638     .4894194     3.21158
             |
        male |
       Male  |   1.229886    .218137     1.17   0.243     .8687457    1.741153
        age1 |   .9986702   .0237988    -0.06   0.955      .953098    1.046421
        age2 |   .9889186   .0862377    -0.13   0.898     .8335514    1.173245
        age3 |   1.047971   .2424688     0.20   0.840     .6658971    1.649269
             |
         imd |
          4  |   1.257982   .2684928     1.08   0.282     .8279449    1.911382
5 most de..  |   1.353986   .3701269     1.11   0.268     .7923717    2.313659
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_onsdeath_eth16.ster not found)
file ./output/model/model1_onsdeath_eth16.ster saved
(note: file ./output/model/model1_onsdeath_eth16.dta not found)
file ./output/model/model1_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(54)      =       37.98
Log likelihood  =   -1108.1091                  Prob > chi2      =      0.9517

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .5966676   .4358478    -0.71   0.480     .1425461    2.497524
Other White  |   1.375343   .8057208     0.54   0.586     .4362637    4.335834
White + C..  |   .7745222   .5197441    -0.38   0.703     .2078902    2.885584
White + A..  |   1.753073   .9782416     1.01   0.314     .5872412    5.233395
White + A..  |   1.600483   .9127555     0.82   0.410     .5233722    4.894308
Other mixed  |   .6187811   .4520113    -0.66   0.511     .1478242    2.590171
     Indian  |   1.854911   1.035058     1.11   0.268     .6213618    5.537343
  Pakistani  |   .7796728   .5231472    -0.37   0.711     .2093007    2.904385
Bangladeshi  |   1.185221   .7180405     0.28   0.779     .3615073    3.885808
Other Asian  |   .9869688   .6244362    -0.02   0.983     .2856042     3.41069
  Caribbean  |   .6072191   .4435662    -0.68   0.495     .1450618    2.541779
    African  |   1.425931   .8352745     0.61   0.545     .4523618    4.494806
Other Black  |   1.433625   .8397723     0.61   0.539     .4548083    4.519003
    Chinese  |   1.379842   .8083862     0.55   0.583     .4376726    4.350201
      Other  |   1.568596   .8948636     0.79   0.430     .5127574    4.798555
    Unknown  |   1.246877   .5985994     0.46   0.646     .4866081    3.194976
             |
        male |
       Male  |   1.237023    .221382     1.19   0.235     .8710518    1.756758
        age1 |   .9998446   .0246158    -0.01   0.995      .952744    1.049274
        age2 |   .9853325   .0875119    -0.17   0.868     .8279111    1.172686
        age3 |   1.055724   .2477305     0.23   0.817     .6665184    1.672202
             |
         imd |
          4  |   1.254502   .2678267     1.06   0.288     .8255558    1.906323
5 most de..  |   1.358753   .3715465     1.12   0.262     .7950279    2.322196
             |
   bmicat_sa |
Normal (..)  |   .6770547   .3956437    -0.67   0.505     .2153851    2.128296
Overweig..)  |   .7584409   .4196246    -0.50   0.617     .2564337    2.243202
Obese I ..)  |   .7010327     .38132    -0.65   0.514     .2413989    2.035829
Obese II..)  |   .8694948     .46624    -0.26   0.794     .3039738    2.487126
Obese II..)  |   .5601614   .3037084    -1.07   0.285     .1935568     1.62113
    Unknown  |   .7280618   .3980073    -0.58   0.562     .2493702    2.125651
             |
    hba1ccat |
  >=6.5-7.4  |    .787414   .1996763    -0.94   0.346     .4790174     1.29436
  >=7.5-7.9  |   1.020526   .3578727     0.06   0.954     .5132501    2.029172
    >=8-8.9  |   .7517293       .278    -0.77   0.440     .3641458    1.551843
        >=9  |    1.01199   .4276101     0.03   0.977     .4420853    2.316574
    Unknown  |   1.21e-14   1.50e-07    -0.00   1.000            0           .
             |
gp_consult~t |   .9809858   .0380947    -0.49   0.621     .9090922    1.058565
             |
smoke_nomiss |
     Former  |   .3779908   .3797383    -0.97   0.333     .0527648    2.707809
    Current  |   .8707844   .2469156    -0.49   0.626     .4995142    1.518006
             |
1.hyperten~n |   1.277182   .2636675     1.19   0.236     .8521708    1.914163
             |
      bp_cat |
High, sta..  |   3.73e-07   7.944709    -0.00   1.000            0           .
High, sta..  |   3.29e+07   1.14e+07    50.04   0.000     1.67e+07    6.48e+07
    Unknown  |   2.22e+07          .        .       .            .           .
             |
    1.asthma |   .9864877   .4503378    -0.03   0.976     .4031929    2.413629
1.~y_disease |   1.117809   .2391924     0.52   0.603     .7348939    1.700241
1.~c_disease |   .9237524    .209354    -0.35   0.726     .5924396    1.440347
             |
     dm_type |
       T1DM  |   1.349703    .620308     0.65   0.514     .5483222    3.322314
       T2DM  |   1.120681     .24574     0.52   0.603     .7291762    1.722389
 UNKNOWN_DM  |   2.038426   .9373586     1.55   0.121     .8277036    5.020132
             |
    1.cancer |   1.059352   .2296537     0.27   0.790     .6926448    1.620204
1.~r_disease |   .9416369   .2134006    -0.27   0.791     .6039181    1.468213
    1.stroke |   .7423701   .1807856    -1.22   0.221     .4606082     1.19649
  1.dementia |   .7963339   .1901805    -0.95   0.340     .4986677    1.271684
1.other_ne~o |   1.527003   .3030925     2.13   0.033     1.034871    2.253168
             |
      egfr60 |
   eGFR <60  |   1.379684   1.011883     0.44   0.661     .3277139     5.80851
      1.esrf |   .9319961   .2111966    -0.31   0.756      .597759    1.453122
1.immunosu~d |   .8809115   .1659476    -0.67   0.501     .6089498    1.274333
1.ra_sle_p~s |   1.317935   .2692671     1.35   0.177     .8830494    1.966993
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(54)      =       37.98
Log likelihood  =   -1108.1091                  Prob > chi2      =      0.9517

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .5966676   .4358478    -0.71   0.480     .1425461    2.497524
Other White  |   1.375343   .8057208     0.54   0.586     .4362637    4.335834
White + C..  |   .7745222   .5197441    -0.38   0.703     .2078902    2.885584
White + A..  |   1.753073   .9782416     1.01   0.314     .5872412    5.233395
White + A..  |   1.600483   .9127555     0.82   0.410     .5233722    4.894308
Other mixed  |   .6187811   .4520113    -0.66   0.511     .1478242    2.590171
     Indian  |   1.854911   1.035058     1.11   0.268     .6213618    5.537343
  Pakistani  |   .7796728   .5231472    -0.37   0.711     .2093007    2.904385
Bangladeshi  |   1.185221   .7180405     0.28   0.779     .3615073    3.885808
Other Asian  |   .9869688   .6244362    -0.02   0.983     .2856042     3.41069
  Caribbean  |   .6072191   .4435662    -0.68   0.495     .1450618    2.541779
    African  |   1.425931   .8352745     0.61   0.545     .4523618    4.494806
Other Black  |   1.433625   .8397723     0.61   0.539     .4548083    4.519003
    Chinese  |   1.379842   .8083862     0.55   0.583     .4376726    4.350201
      Other  |   1.568596   .8948636     0.79   0.430     .5127574    4.798555
    Unknown  |   1.246877   .5985994     0.46   0.646     .4866081    3.194976
             |
        male |
       Male  |   1.237023    .221382     1.19   0.235     .8710518    1.756758
        age1 |   .9998446   .0246158    -0.01   0.995      .952744    1.049274
        age2 |   .9853325   .0875119    -0.17   0.868     .8279111    1.172686
        age3 |   1.055724   .2477305     0.23   0.817     .6665184    1.672202
             |
         imd |
          4  |   1.254502   .2678267     1.06   0.288     .8255558    1.906323
5 most de..  |   1.358753   .3715465     1.12   0.262     .7950279    2.322196
             |
   bmicat_sa |
Normal (..)  |   .6770547   .3956437    -0.67   0.505     .2153851    2.128296
Overweig..)  |   .7584409   .4196246    -0.50   0.617     .2564337    2.243202
Obese I ..)  |   .7010327     .38132    -0.65   0.514     .2413989    2.035829
Obese II..)  |   .8694948     .46624    -0.26   0.794     .3039738    2.487126
Obese II..)  |   .5601614   .3037084    -1.07   0.285     .1935568     1.62113
    Unknown  |   .7280618   .3980073    -0.58   0.562     .2493702    2.125651
             |
    hba1ccat |
  >=6.5-7.4  |    .787414   .1996763    -0.94   0.346     .4790174     1.29436
  >=7.5-7.9  |   1.020526   .3578727     0.06   0.954     .5132501    2.029172
    >=8-8.9  |   .7517293       .278    -0.77   0.440     .3641458    1.551843
        >=9  |    1.01199   .4276101     0.03   0.977     .4420853    2.316574
    Unknown  |   1.21e-14   1.50e-07    -0.00   1.000            0           .
             |
gp_consult~t |   .9809858   .0380947    -0.49   0.621     .9090922    1.058565
             |
smoke_nomiss |
     Former  |   .3779908   .3797383    -0.97   0.333     .0527648    2.707809
    Current  |   .8707844   .2469156    -0.49   0.626     .4995142    1.518006
             |
1.hyperten~n |   1.277182   .2636675     1.19   0.236     .8521708    1.914163
             |
      bp_cat |
High, sta..  |   3.73e-07   7.944709    -0.00   1.000            0           .
High, sta..  |   3.29e+07   1.14e+07    50.04   0.000     1.67e+07    6.48e+07
    Unknown  |   2.22e+07          .        .       .            .           .
             |
    1.asthma |   .9864877   .4503378    -0.03   0.976     .4031929    2.413629
1.~y_disease |   1.117809   .2391924     0.52   0.603     .7348939    1.700241
1.~c_disease |   .9237524    .209354    -0.35   0.726     .5924396    1.440347
             |
     dm_type |
       T1DM  |   1.349703    .620308     0.65   0.514     .5483222    3.322314
       T2DM  |   1.120681     .24574     0.52   0.603     .7291762    1.722389
 UNKNOWN_DM  |   2.038426   .9373586     1.55   0.121     .8277036    5.020132
             |
    1.cancer |   1.059352   .2296537     0.27   0.790     .6926448    1.620204
1.~r_disease |   .9416369   .2134006    -0.27   0.791     .6039181    1.468213
    1.stroke |   .7423701   .1807856    -1.22   0.221     .4606082     1.19649
  1.dementia |   .7963339   .1901805    -0.95   0.340     .4986677    1.271684
1.other_ne~o |   1.527003   .3030925     2.13   0.033     1.034871    2.253168
             |
      egfr60 |
   eGFR <60  |   1.379684   1.011883     0.44   0.661     .3277139     5.80851
      1.esrf |   .9319961   .2111966    -0.31   0.756      .597759    1.453122
1.immunosu~d |   .8809115   .1659476    -0.67   0.501     .6089498    1.274333
1.ra_sle_p~s |   1.317935   .2692671     1.35   0.177     .8830494    1.966993
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_onsdeath_eth16.ster not found)
file ./output/model/model2_onsdeath_eth16.ster saved
(note: file ./output/model/model2_onsdeath_eth16.dta not found)
file ./output/model/model2_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(56)      =       38.43
Log likelihood  =   -1107.8851                  Prob > chi2      =      0.9649

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .5964716   .4357092    -0.71   0.479     .1424971    2.496741
Other White  |   1.374793   .8054019     0.54   0.587     .4360875    4.334121
White + C..  |   .7747139   .5198786    -0.38   0.704     .2079386    2.886341
White + A..  |   1.755914    .979838     1.01   0.313     .5881855    5.241941
White + A..  |   1.600837   .9129655     0.83   0.409     .5234829    4.895439
Other mixed  |   .6186994   .4519529    -0.66   0.511     .1478042    2.589839
     Indian  |   1.856294   1.035869     1.11   0.268     .6217993    5.541702
  Pakistani  |   .7793593   .5229442    -0.37   0.710     .2092126     2.90327
Bangladeshi  |   1.184684   .7177174     0.28   0.780     .3613426    3.884062
Other Asian  |   .9889334   .6256793    -0.02   0.986     .2861726     3.41748
  Caribbean  |   .6072824   .4436143    -0.68   0.495     .1450761    2.542059
    African  |   1.426793   .8357897     0.61   0.544     .4526291    4.497587
Other Black  |   1.434889   .8405175     0.62   0.538     .4552062    4.523016
    Chinese  |    1.38315   .8103521     0.55   0.580     .4387046    4.360802
      Other  |   1.568505   .8948483     0.79   0.430     .5127036    4.798497
    Unknown  |   1.247017   .5987006     0.46   0.646     .4866373    3.195505
             |
        male |
       Male  |   1.236216     .22124     1.18   0.236     .8704793    1.755618
        age1 |   .9999263   .0246161    -0.00   0.998      .952825    1.049356
        age2 |   .9850051   .0874822    -0.17   0.865     .8276369    1.172295
        age3 |   1.056707   .2479677     0.24   0.814     .6671305    1.673779
             |
         imd |
          4  |   1.254679    .267867     1.06   0.288     .8256686    1.906599
5 most de..  |   1.359963   .3718764     1.12   0.261     .7957366     2.32426
             |
   bmicat_sa |
Normal (..)  |   .6750729   .3944798    -0.67   0.501     .2147583     2.12203
Overweig..)  |   .7558408   .4181823    -0.51   0.613     .2555572     2.23549
Obese I ..)  |    .698881   .3801481    -0.66   0.510      .240659    2.029571
Obese II..)  |   .8680046   .4654391    -0.26   0.792     .3034541    2.482853
Obese II..)  |   .5585897   .3028521    -1.07   0.283     .1930167    1.616557
    Unknown  |   .7266933   .3972513    -0.58   0.559     .2489067     2.12161
             |
    hba1ccat |
  >=6.5-7.4  |    .787202   .1996344    -0.94   0.345     .4788743     1.29405
  >=7.5-7.9  |   1.020316   .3578124     0.06   0.954     .5131317    2.028807
    >=8-8.9  |   .7512491    .277822    -0.77   0.439     .3639135     1.55085
        >=9  |    1.01112   .4272422     0.03   0.979     .4417061    2.314581
    Unknown  |   3.33e-14   2.49e-07    -0.00   1.000            0           .
             |
gp_consult~t |   .9810473    .038098    -0.49   0.622     .9091475    1.058633
             |
smoke_nomiss |
     Former  |    .379439   .3812016    -0.96   0.335     .0529647    2.718301
    Current  |   .8714042   .2470941    -0.49   0.627     .4998667    1.519096
             |
1.hyperten~n |   1.276205   .2634715     1.18   0.237     .8515117    1.912715
             |
      bp_cat |
High, sta..  |   1.01e-06   13.06999    -0.00   1.000            0           .
High, sta..  |   3.29e+07   1.14e+07    50.04   0.000     1.67e+07    6.48e+07
    Unknown  |   2.22e+07          .        .       .            .           .
             |
    1.asthma |   .9860888    .450157    -0.03   0.976     .4030288    2.412659
1.~y_disease |   1.117476   .2391291     0.52   0.604     .7346653    1.699759
1.~c_disease |   .9237694   .2093619    -0.35   0.726     .5924455    1.440386
             |
     dm_type |
       T1DM  |   1.349977   .6204349     0.65   0.514     .5484329    3.322993
       T2DM  |   1.120851   .2457822     0.52   0.603     .7292811    1.722665
 UNKNOWN_DM  |   2.035469   .9360009     1.55   0.122     .8265009     5.01286
             |
    1.cancer |   1.058883   .2295549     0.26   0.792     .6923345    1.619495
1.~r_disease |   .9416873   .2134154    -0.27   0.791     .6039461    1.468301
    1.stroke |   .7422703   .1807627    -1.22   0.221     .4605446    1.196334
  1.dementia |   .7967456   .1902834    -0.95   0.341     .4989199    1.272356
1.other_ne~o |   1.527528   .3032187     2.13   0.033     1.035197    2.254006
             |
      egfr60 |
   eGFR <60  |   1.376681   1.009762     0.44   0.663     .3269622    5.796544
      1.esrf |   .9322487   .2112564    -0.31   0.757     .5979177    1.453524
1.immunosu~d |    .881406   .1660408    -0.67   0.503     .6092916    1.275049
1.ra_sle_p~s |   1.317636   .2692063     1.35   0.177     .8828488    1.966547
             |
hh_total_cat |
       6-10  |   .9785917   .5721374    -0.04   0.970      .311131    3.077937
        11+  |   3.20e-14   3.74e-07    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_onsdeath_eth16.ster not found)
file ./output/model/model3_onsdeath_eth16.ster saved
(note: file ./output/model/model3_onsdeath_eth16.dta not found)
file ./output/model/model3_onsdeath_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)

. 
. file close tablecontent

. 
. ************************************************create forestplot dataset
. dsconcat `hr'

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. split idstr, p(_)
variables created as string: 
idstr1  idstr2  idstr3  idstr4

. ren idstr1 model

. ren idstr2 outcome

. drop idstr idstr3

. tab model

      model |      Freq.     Percent        Cum.
------------+-----------------------------------
      crude |        119        7.76        7.76
     model0 |        154       10.05       17.81
     model1 |        175       11.42       29.22
     model2 |        532       34.70       63.93
     model3 |        553       36.07      100.00
------------+-----------------------------------
      Total |      1,533      100.00

. 
. *save dataset for later
. outsheet using ./output/FP_multivariable_eth16.txt, replace
(note: file ./output/FP_multivariable_eth16.txt not found)

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/04a_eth_an_multivariable_eth16.log
  log type:  text
 closed on:   6 Jan 2021, 14:11:53
-------------------------------------------------------------------------------
