-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04b_eth_an_multivariable_eth5.log
  log type:  text
 opened on:   6 Jan 2021, 12:22:09

. cap file close tablecontent

. file open tablecontent using ./output/table2_eth5.txt, write text replace
(note: file ./output/table2_eth5.txt not found)

. 
. file write tablecontent ("Table 2: Association between ethnicity in 5 categor
> ies and COVID-19 outcomes - No care homes") _n

. file write tablecontent _tab ("Denominator") _tab ("Event") _tab ("Total pers
> on-weeks") _tab ("Rate per 1,000") _tab ("Crude") _tab _tab ("Age/Sex Adjuste
> d") _tab _tab ("Age/Sex/IMD Adjusted") _tab _tab      ("plus co-morbidities")
>  _tab _tab       ("plus hh size")  _tab _tab  _n

. file write tablecontent _tab _tab _tab _tab _tab   ("HR") _tab ("95% CI") _ta
> b ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% C
> I") _tab ("HR") _tab ("95% CI") _tab _tab _n

. 
. 
. 
. foreach i of global outcomes {
  2. use ./output/analysis_dataset_STSET_`i'.dta, clear
  3. drop if carehome==1
  4. safetab eth5 `i', missing row
  5. } //end outcomes
(1,191 observations deleted)

**TABLE OF eth5 tested REDACTED DUE TO SMALL N**

(1,191 observations deleted)

**TABLE OF eth5 positivetest REDACTED DUE TO SMALL N**

(1,191 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

            |  outcome
      Eth 5 |    icu
 categories |         0 |     Total
------------+-----------+----------
      White |       935 |       935 
            |    100.00 |    100.00 
------------+-----------+----------
South Asian |       998 |       998 
            |    100.00 |    100.00 
------------+-----------+----------
      Black |       980 |       980 
            |    100.00 |    100.00 
------------+-----------+----------
      Mixed |     1,023 |     1,023 
            |    100.00 |    100.00 
------------+-----------+----------
      Other |       968 |       968 
            |    100.00 |    100.00 
------------+-----------+----------
    Unknown |     1,689 |     1,689 
            |    100.00 |    100.00 
------------+-----------+----------
      Total |     6,593 |     6,593 
            |    100.00 |    100.00 
(1,191 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |      outcome hes
 categories |         0          1 |     Total
------------+----------------------+----------
      White |       814        121 |       935 
            |     87.06      12.94 |    100.00 
------------+----------------------+----------
South Asian |       853        145 |       998 
            |     85.47      14.53 |    100.00 
------------+----------------------+----------
      Black |       835        145 |       980 
            |     85.20      14.80 |    100.00 
------------+----------------------+----------
      Mixed |       868        155 |     1,023 
            |     84.85      15.15 |    100.00 
------------+----------------------+----------
      Other |       822        146 |       968 
            |     84.92      15.08 |    100.00 
------------+----------------------+----------
    Unknown |     1,485        204 |     1,689 
            |     87.92      12.08 |    100.00 
------------+----------------------+----------
      Total |     5,677        916 |     6,593 
            |     86.11      13.89 |    100.00 
(1,191 observations deleted)

**TABLE OF eth5 onscoviddeath REDACTED DUE TO SMALL N**

(1,191 observations deleted)

**TABLE OF eth5 ons_noncoviddeath REDACTED DUE TO SMALL N**

(1,191 observations deleted)

**TABLE OF eth5 onsdeath REDACTED DUE TO SMALL N**


. 
. foreach i of global outcomes {
  2.         di "`i'"
  3.         
. * Open Stata dataset
. use ./output/analysis_dataset_STSET_`i'.dta, clear
  4. drop if carehome==1
  5. 
. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.eth5, strata(stp) nolog
  6. estimates save ./output/model/crude_`i'_eth5, replace 
  7. eststo model1
  8. parmest, label eform format(estimate p lb ub) saving(./output/model/crude_
> `i'_eth5, replace) idstr(crude_`i'_eth5) 
  9. local hr "`hr' ./output/model/crude_`i'_eth5 "
 10. 
. 
. /* Multivariable models */ 
. *Age and gender
. stcox i.eth5 i.male age1 age2 age3, strata(stp) nolog
 11. estimates save ./output/model/model0_`i'_eth5, replace 
 12. eststo model2
 13. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model0_`i
> '_eth5, replace) idstr(model0_`i'_eth5)
 14. local hr "`hr' ./output/model/model0_`i'_eth5 "
 15.  
. 
. * Age, Gender, IMD
. 
. stcox i.eth5 i.male age1 age2 age3 i.imd, strata(stp) nolog
 16. if _rc==0{
 17. estimates
 18. estimates save ./output/model/model1_`i'_eth5, replace 
 19. eststo model3
 20. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model1_`i
> '_eth5, replace) idstr(model1_`i'_eth5) 
 21. local hr "`hr' ./output/model/model1_`i'_eth5 "
 22. }
 23. else di "WARNING MODEL1 DID NOT FIT (OUTCOME `i')"
 24. 
. * Age, Gender, IMD and Comorbidities 
. stcox i.eth5 i.male age1 age2 age3      i.imd                                
>            ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis, strata(stp) nolog           
 25. if _rc==0{
 26. estimates
 27. estimates save ./output/model/model2_`i'_eth5, replace 
 28. eststo model4
 29. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model2_`i
> '_eth5, replace) idstr(model2_`i'_eth5) 
 30. local hr "`hr' ./output/model/model2_`i'_eth5 "
 31. }
 32. else di "WARNING MODEL2 DID NOT FIT (OUTCOME `i')"
 33. 
.                                                                              
>    
. * Age, Gender, IMD and Comorbidities  and household size 
. stcox i.eth5 i.male age1 age2 age3      i.imd                                
>            ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis                      ///
>                                                                              
>    i.hh_total_cat, strata(stp) nolog               
 34. estimates save ./output/model/model3_`i'_eth5, replace
 35. eststo model5
 36. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model3_`i
> '_eth5, replace) idstr(model3_`i'_eth5) 
 37. local hr "`hr' ./output/model/model3_`i'_eth5 "
 38. 
. 
. 
. /* Estout================================================================*/ 
. esttab model1 model2 model3 model4 model5 using ./output/estout_table2_eth5.t
> xt, b(a2) ci(2) label wide compress eform ///
>         title ("`i'") ///
>         varlabels(`e(labels)') ///
>         stats(N_sub) ///
>         append 
 39. eststo clear
 40. 
.                                                                              
>    
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("`i'") _n
 41. 
. * eth5 labelled columns
. 
. local lab1: label eth5 1
 42. local lab2: label eth5 2
 43. local lab3: label eth5 3
 44. local lab4: label eth5 4
 45. local lab5: label eth5 5
 46. local lab6: label eth5 6
 47. 
. /* counts */
.  
. * First row, eth5 = 1 (White British) reference cat
.         qui safecount if eth5==1
 48.         local denominator = r(N)
 49.         qui safecount if eth5 == 1 & `i' == 1
 50.         local event = r(N)
 51.     bysort eth5: egen total_follow_up = total(_t)
 52.         qui su total_follow_up if eth5 == 1
 53.         local person_week = r(mean)/7
 54.         local rate = 1000*(`event'/`person_week')
 55.         
.         file write tablecontent  ("`lab1'") _tab (`denominator') _tab (`event
> ') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab
 56.         file write tablecontent ("1.00") _tab _tab ("1.00") _tab _tab ("1.
> 00")  _tab _tab ("1.00") _tab _tab ("1.00") _n
 57.         
. * Subsequent ethnic groups
. forvalues eth=2/6 {
 58.         qui safecount if eth5==`eth'
 59.         local denominator = r(N)
 60.         qui safecount if eth5 == `eth' & `i' == 1
 61.         local event = r(N)
 62.         qui su total_follow_up if eth5 == `eth'
 63.         local person_week = r(mean)/7
 64.         local rate = 1000*(`event'/`person_week')
 65.         file write tablecontent  ("`lab`eth''") _tab (`denominator') _tab 
> (`event') _tab %10.0f (`person_week') _tab %3.2f (`rate ') _tab  
 66.         cap estimates use ./output/model/crude_`i'_eth5 
 67.          cap lincom `eth'.eth5, eform
 68.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 69.         cap estimates clear
 70.         cap estimates use ./output/model/model0_`i'_eth5 
 71.          cap lincom `eth'.eth5, eform
 72.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 73.         cap estimates clear
 74.         cap estimates use ./output/model/model1_`i'_eth5 
 75.          cap lincom `eth'.eth5, eform
 76.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 77.         cap estimates clear
 78.         cap estimates use ./output/model/model2_`i'_eth5 
 79.          cap lincom `eth'.eth5, eform
 80.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 81.         cap estimates clear
 82.         cap estimates use ./output/model/model3_`i'_eth5 
 83.          cap lincom `eth'.eth5, eform
 84.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _n
 85. }  //end ethnic group
 86. 
. 
. } //end outcomes
tested
(1,191 observations deleted)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(4)       =        6.13
Log likelihood  =   -81.206028                  Prob > chi2      =      0.1898

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8973786   .8980503    -0.11   0.914     .1262226    6.379907
      Black  |   2.04e-20          .        .       .            .           .
      Mixed  |    1.72656   1.498064     0.63   0.529     .3152313    9.456573
      Other  |   .4528435   .5550364    -0.65   0.518      .040988    5.003108
    Unknown  |   1.041033   .9024096     0.05   0.963     .1903745    5.692727
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_tested_eth5.ster not found)
file ./output/model/crude_tested_eth5.ster saved
(note: file ./output/model/crude_tested_eth5.dta not found)
file ./output/model/crude_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(9)       =        9.00
Log likelihood  =   -79.768103                  Prob > chi2      =      0.4369

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8854241    .887216    -0.12   0.903     .1242302     6.31067
      Black  |   1.21e-15   2.31e-08    -0.00   1.000            0           .
      Mixed  |   1.682069   1.460952     0.60   0.549     .3065754    9.228906
      Other  |   .4372445   .5363521    -0.67   0.500      .039499    4.840192
    Unknown  |   1.027245   .8908634     0.03   0.975     .1877074    5.621684
             |
        male |
       Male  |   2.372819   1.428988     1.43   0.151     .7288592    7.724771
        age1 |   1.018597   .0746268     0.25   0.801     .8823475    1.175885
        age2 |   .8734162   .2384836    -0.50   0.620     .5114502    1.491555
        age3 |   1.480912   1.084895     0.54   0.592     .3523315    6.224538
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_tested_eth5.ster not found)
file ./output/model/model0_tested_eth5.ster saved
(note: file ./output/model/model0_tested_eth5.dta not found)
file ./output/model/model0_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(11)      =       11.81
Log likelihood  =   -78.364727                  Prob > chi2      =      0.3781

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .888326   .8910146    -0.12   0.906     .1243926     6.34381
      Black  |   5.87e-17   5.04e-09    -0.00   1.000            0           .
      Mixed  |   1.664529   1.445972     0.59   0.557      .303288    9.135405
      Other  |   .4428687   .5435742    -0.66   0.507     .0399499    4.909468
    Unknown  |   1.042167   .9042694     0.05   0.962     .1902675    5.708337
             |
        male |
       Male  |   2.347085   1.414368     1.42   0.157     .7204257    7.646599
        age1 |   1.020738   .0744032     0.28   0.778     .8848479    1.177496
        age2 |   .8636777   .2348786    -0.54   0.590     .5068343    1.471761
        age3 |   1.524772   1.113331     0.58   0.563     .3644932    6.378522
             |
         imd |
          4  |   1.051895   .6939965     0.08   0.939     .2886591    3.833184
5 most de..  |   7.02e-17   6.92e-09    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(11)      =       11.81
Log likelihood  =   -78.364727                  Prob > chi2      =      0.3781

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .888326   .8910146    -0.12   0.906     .1243926     6.34381
      Black  |   5.87e-17   5.04e-09    -0.00   1.000            0           .
      Mixed  |   1.664529   1.445972     0.59   0.557      .303288    9.135405
      Other  |   .4428687   .5435742    -0.66   0.507     .0399499    4.909468
    Unknown  |   1.042167   .9042694     0.05   0.962     .1902675    5.708337
             |
        male |
       Male  |   2.347085   1.414368     1.42   0.157     .7204257    7.646599
        age1 |   1.020738   .0744032     0.28   0.778     .8848479    1.177496
        age2 |   .8636777   .2348786    -0.54   0.590     .5068343    1.471761
        age3 |   1.524772   1.113331     0.58   0.563     .3644932    6.378522
             |
         imd |
          4  |   1.051895   .6939965     0.08   0.939     .2886591    3.833184
5 most de..  |   7.02e-17   6.92e-09    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_tested_eth5.ster not found)
file ./output/model/model1_tested_eth5.ster saved
(note: file ./output/model/model1_tested_eth5.dta not found)
file ./output/model/model1_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(41)      =       36.88
Log likelihood  =   -65.831088                  Prob > chi2      =      0.6544

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7968034   .8156186    -0.22   0.824     .1071643     5.92451
      Black  |   6.90e-17   5.77e-09    -0.00   1.000            0           .
      Mixed  |    2.07278   1.908528     0.79   0.429      .341038    12.59806
      Other  |   .4160826   .5218222    -0.70   0.484     .0356173    4.860692
    Unknown  |   1.194638   1.073077     0.20   0.843     .2054231    6.947414
             |
        male |
       Male  |    2.72595   1.721482     1.59   0.112     .7906244    9.398653
        age1 |   1.029858   .0772791     0.39   0.695     .8890057    1.193027
        age2 |   .8337019   .2337995    -0.65   0.517     .4811758    1.444501
        age3 |   1.685704   1.275196     0.69   0.490      .382708     7.42498
             |
         imd |
          4  |    1.10841   .7472788     0.15   0.879     .2956847    4.155008
5 most de..  |   7.48e-17   7.24e-09    -0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   1.68e-07   19.39302    -0.00   1.000            0           .
Overweig..)  |   1.35e+09          .        .       .            .           .
Obese I ..)  |   4.02e+09   4.55e+09    19.52   0.000     4.36e+08    3.70e+10
Obese II..)  |   1.29e+09   1.84e+09    14.67   0.000     7.80e+07    2.12e+10
Obese II..)  |   3.23e+09   3.68e+09    19.23   0.000     3.47e+08    3.01e+10
    Unknown  |   3.18e+09   3.78e+09    18.42   0.000     3.10e+08    3.27e+10
             |
    hba1ccat |
  >=6.5-7.4  |    .290931   .3090745    -1.16   0.245     .0362664    2.333863
  >=7.5-7.9  |    .864858   .9246633    -0.14   0.892     .1063855    7.030841
    >=8-8.9  |   6.34e-17   7.25e-09    -0.00   1.000            0           .
        >=9  |   1.718817   1.889449     0.49   0.622     .1993089    14.82288
    Unknown  |   3.48e-17   2.34e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.007656   .1203111     0.06   0.949     .7974094    1.273336
             |
smoke_nomiss |
     Former  |   6.88e-17   8.43e-09    -0.00   1.000            0           .
    Current  |   4.25e-17   4.99e-09    -0.00   1.000            0           .
             |
1.hyperten~n |   .2729244   .2902416    -1.22   0.222     .0339494    2.194083
             |
      bp_cat |
High, sta..  |    6282258    5009968    19.63   0.000      1316135    3.00e+07
    Unknown  |   1.37e+07          .        .       .            .           .
             |
    1.asthma |   4.541042   3.712983     1.85   0.064     .9144721    22.54969
1.~y_disease |   .5545482   .4343849    -0.75   0.452     .1194488    2.574522
1.~c_disease |   .5855504   .4635219    -0.68   0.499     .1240946    2.762967
             |
     dm_type |
       T1DM  |   5.04e-17   1.06e-08    -0.00   1.000            0           .
       T2DM  |   1.070815   .7192463     0.10   0.919      .287064     3.99439
 UNKNOWN_DM  |   6.21e-17   1.59e-08    -0.00   1.000            0           .
             |
    1.cancer |   1.239421   .8470764     0.31   0.753     .3246901     4.73117
1.~r_disease |   .8445557   .6621461    -0.22   0.829     .1816652    3.926313
    1.stroke |   1.440625   .9738831     0.54   0.589     .3829362    5.419701
  1.dementia |   1.313039   .9051865     0.40   0.693     .3399961    5.070857
1.other_ne~o |   1.340434   .9147287     0.43   0.668     .3518639    5.106413
             |
      egfr60 |
   eGFR <60  |   8.35e-17   2.78e-08    -0.00   1.000            0           .
      1.esrf |   .3511194   .3684143    -1.00   0.319     .0449083     2.74526
1.immunosu~d |   2.005452   1.143484     1.22   0.222     .6559456    6.131361
1.ra_sle_p~s |   1.833945    1.14329     0.97   0.331     .5404347    6.223426
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(41)      =       36.88
Log likelihood  =   -65.831088                  Prob > chi2      =      0.6544

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7968034   .8156186    -0.22   0.824     .1071643     5.92451
      Black  |   6.90e-17   5.77e-09    -0.00   1.000            0           .
      Mixed  |    2.07278   1.908528     0.79   0.429      .341038    12.59806
      Other  |   .4160826   .5218222    -0.70   0.484     .0356173    4.860692
    Unknown  |   1.194638   1.073077     0.20   0.843     .2054231    6.947414
             |
        male |
       Male  |    2.72595   1.721482     1.59   0.112     .7906244    9.398653
        age1 |   1.029858   .0772791     0.39   0.695     .8890057    1.193027
        age2 |   .8337019   .2337995    -0.65   0.517     .4811758    1.444501
        age3 |   1.685704   1.275196     0.69   0.490      .382708     7.42498
             |
         imd |
          4  |    1.10841   .7472788     0.15   0.879     .2956847    4.155008
5 most de..  |   7.48e-17   7.24e-09    -0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   1.68e-07   19.39302    -0.00   1.000            0           .
Overweig..)  |   1.35e+09          .        .       .            .           .
Obese I ..)  |   4.02e+09   4.55e+09    19.52   0.000     4.36e+08    3.70e+10
Obese II..)  |   1.29e+09   1.84e+09    14.67   0.000     7.80e+07    2.12e+10
Obese II..)  |   3.23e+09   3.68e+09    19.23   0.000     3.47e+08    3.01e+10
    Unknown  |   3.18e+09   3.78e+09    18.42   0.000     3.10e+08    3.27e+10
             |
    hba1ccat |
  >=6.5-7.4  |    .290931   .3090745    -1.16   0.245     .0362664    2.333863
  >=7.5-7.9  |    .864858   .9246633    -0.14   0.892     .1063855    7.030841
    >=8-8.9  |   6.34e-17   7.25e-09    -0.00   1.000            0           .
        >=9  |   1.718817   1.889449     0.49   0.622     .1993089    14.82288
    Unknown  |   3.48e-17   2.34e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.007656   .1203111     0.06   0.949     .7974094    1.273336
             |
smoke_nomiss |
     Former  |   6.88e-17   8.43e-09    -0.00   1.000            0           .
    Current  |   4.25e-17   4.99e-09    -0.00   1.000            0           .
             |
1.hyperten~n |   .2729244   .2902416    -1.22   0.222     .0339494    2.194083
             |
      bp_cat |
High, sta..  |    6282258    5009968    19.63   0.000      1316135    3.00e+07
    Unknown  |   1.37e+07          .        .       .            .           .
             |
    1.asthma |   4.541042   3.712983     1.85   0.064     .9144721    22.54969
1.~y_disease |   .5545482   .4343849    -0.75   0.452     .1194488    2.574522
1.~c_disease |   .5855504   .4635219    -0.68   0.499     .1240946    2.762967
             |
     dm_type |
       T1DM  |   5.04e-17   1.06e-08    -0.00   1.000            0           .
       T2DM  |   1.070815   .7192463     0.10   0.919      .287064     3.99439
 UNKNOWN_DM  |   6.21e-17   1.59e-08    -0.00   1.000            0           .
             |
    1.cancer |   1.239421   .8470764     0.31   0.753     .3246901     4.73117
1.~r_disease |   .8445557   .6621461    -0.22   0.829     .1816652    3.926313
    1.stroke |   1.440625   .9738831     0.54   0.589     .3829362    5.419701
  1.dementia |   1.313039   .9051865     0.40   0.693     .3399961    5.070857
1.other_ne~o |   1.340434   .9147287     0.43   0.668     .3518639    5.106413
             |
      egfr60 |
   eGFR <60  |   8.35e-17   2.78e-08    -0.00   1.000            0           .
      1.esrf |   .3511194   .3684143    -1.00   0.319     .0449083     2.74526
1.immunosu~d |   2.005452   1.143484     1.22   0.222     .6559456    6.131361
1.ra_sle_p~s |   1.833945    1.14329     0.97   0.331     .5404347    6.223426
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_tested_eth5.ster not found)
file ./output/model/model2_tested_eth5.ster saved
(note: file ./output/model/model2_tested_eth5.dta not found)
file ./output/model/model2_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           13
Time at risk    =      1858828
                                                LR chi2(31)      =       37.80
Log likelihood  =   -65.371996                  Prob > chi2      =      0.1866

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8136309   .8343518    -0.20   0.841     .1090306    6.071649
      Black  |   2.32e-20          .        .       .            .           .
      Mixed  |   2.052075   1.891184     0.78   0.435     .3370772    12.49272
      Other  |   .4268183   .5371691    -0.68   0.499     .0362218    5.029405
    Unknown  |    1.21751   1.095894     0.22   0.827     .2085914    7.106379
             |
        male |
       Male  |   2.735752   1.727496     1.59   0.111     .7935674     9.43126
        age1 |    1.03244    .077917     0.42   0.672     .8904833    1.197027
        age2 |   .8257313   .2325119    -0.68   0.496     .4755047    1.433913
        age3 |   1.725749   1.308501     0.72   0.472     .3904614    7.627414
             |
         imd |
          4  |    1.13097   .7635153     0.18   0.855     .3011665    4.247128
5 most de..  |   6.63e-20          .        .       .            .           .
             |
   bmicat_sa |
Normal (..)  |   1.56e-10          .        .       .            .           .
Overweig..)  |   1.43e+09          .        .       .            .           .
Obese I ..)  |   4.17e+09   4.73e+09    19.54   0.000     4.52e+08    3.85e+10
Obese II..)  |   1.34e+09   1.92e+09    14.66   0.000     8.06e+07    2.22e+10
Obese II..)  |   3.36e+09   3.83e+09    19.25   0.000     3.60e+08    3.13e+10
    Unknown  |   3.29e+09   3.90e+09    18.47   0.000     3.21e+08    3.36e+10
             |
    hba1ccat |
  >=6.5-7.4  |   .2817096   .2993449    -1.19   0.233     .0351006     2.26094
  >=7.5-7.9  |   .8489122   .9093221    -0.15   0.878     .1040132    6.928466
    >=8-8.9  |   5.78e-20          .        .       .            .           .
        >=9  |   1.748806   1.921904     0.51   0.611     .2029028    15.07285
    Unknown  |   6.12e-19          .        .       .            .           .
             |
gp_consult~t |   1.002012   .1195553     0.02   0.987     .7930698    1.266001
             |
smoke_nomiss |
     Former  |   6.07e-20          .        .       .            .           .
    Current  |   3.70e-20          .        .       .            .           .
             |
1.hyperten~n |   .2791931    .296441    -1.20   0.230     .0348432    2.237131
             |
      bp_cat |
High, sta..  |    6785387    5427116    19.67   0.000      1415022    3.25e+07
    Unknown  |   1.47e+07          .        .       .            .           .
             |
    1.asthma |   4.408815   3.607714     1.81   0.070     .8867219     21.9208
1.~y_disease |   .5457914   .4280986    -0.77   0.440      .117321    2.539087
1.~c_disease |   .5980576   .4737203    -0.65   0.516     .1266216    2.824738
             |
     dm_type |
       T1DM  |   1.22e-19          .        .       .            .           .
       T2DM  |   1.095599   .7368677     0.14   0.892     .2931962    4.093971
 UNKNOWN_DM  |   1.47e-19          .        .       .            .           .
             |
    1.cancer |   1.183489   .8105008     0.25   0.806      .309191    4.530032
1.~r_disease |   .8637467   .6768343    -0.19   0.852     .1859441    4.012271
    1.stroke |   1.469912   .9941002     0.57   0.569     .3905031    5.532968
  1.dementia |   1.297799   .8983924     0.38   0.707     .3341709    5.040178
1.other_ne~o |   1.331633   .9058444     0.42   0.674     .3510376    5.051439
             |
      egfr60 |
   eGFR <60  |   5.61e-19          .        .       .            .           .
      1.esrf |    .346737   .3642215    -1.01   0.313     .0442462    2.717217
1.immunosu~d |   2.046489   1.168991     1.25   0.210     .6680177    6.269471
1.ra_sle_p~s |   1.850784    1.15487     0.99   0.324     .5447721    6.287772
             |
hh_total_cat |
       6-10  |   1.05e+16          .        .       .            .           .
        11+  |   .0059146          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_tested_eth5.ster not found)
file ./output/model/model3_tested_eth5.ster saved
(note: file ./output/model/model3_tested_eth5.dta not found)
file ./output/model/model3_tested_eth5.dta saved
(note: file ./output/estout_table2_eth5.txt not found)
(output written to ./output/estout_table2_eth5.txt)
positivetest
(1,191 observations deleted)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(5)       =        4.61
Log likelihood  =   -101.69938                  Prob > chi2      =      0.4657

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.371957   1.253749     0.35   0.729     .2288119    8.226261
      Black  |   1.389141   1.269675     0.36   0.719     .2316049    8.331911
      Mixed  |   2.226628   1.867128     0.95   0.340     .4304046     11.5191
      Other  |   .4649845   .5699388    -0.62   0.532     .0420831    5.137709
    Unknown  |   .5387555   .5391895    -0.62   0.537     .0757713    3.830707
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_positivetest_eth5.ster not found)
file ./output/model/crude_positivetest_eth5.ster saved
(note: file ./output/model/crude_positivetest_eth5.dta not found)
file ./output/model/crude_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(9)       =        7.27
Log likelihood  =   -100.36866                  Prob > chi2      =      0.6092

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    1.34489   1.230281     0.32   0.746     .2238841    8.078865
      Black  |   1.391987    1.27324     0.36   0.718     .2317649    8.360319
      Mixed  |   2.185326   1.834004     0.93   0.352     .4218494    11.32074
      Other  |   .4495198   .5513033    -0.65   0.514     .0406268    4.973767
    Unknown  |   .5292313   .5298825    -0.64   0.525     .0743698    3.766123
             |
        male |
       Male  |   1.667089   .8623228     0.99   0.323     .6048726    4.594661
        age1 |   1.000048   .0653322     0.00   0.999      .879858    1.136656
        age2 |   1.015982   .2583693     0.06   0.950     .6171937    1.672441
        age3 |   .8661436   .6170288    -0.20   0.840     .2143905    3.499244
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_positivetest_eth5.ster not found)
file ./output/model/model0_positivetest_eth5.ster saved
(note: file ./output/model/model0_positivetest_eth5.dta not found)
file ./output/model/model0_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(11)      =        7.52
Log likelihood  =   -100.24334                  Prob > chi2      =      0.7556

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.338991   1.224923     0.32   0.750     .2228895    8.043879
      Black  |   1.403661   1.284202     0.37   0.711      .233616    8.433779
      Mixed  |   2.203964   1.850292     0.94   0.347      .425203    11.42386
      Other  |   .4498846     .55183    -0.65   0.515     .0406457    4.979526
    Unknown  |   .5292228   .5298383    -0.64   0.525     .0743785    3.765563
             |
        male |
       Male  |   1.672894   .8655495     0.99   0.320     .6068196    4.611871
        age1 |    .998798   .0653709    -0.02   0.985     .8785508    1.135503
        age2 |   1.020995   .2600816     0.08   0.935     .6197178    1.682105
        age3 |   .8551664   .6099818    -0.22   0.826     .2112988    3.461022
             |
         imd |
          4  |   .9488936   .6187289    -0.08   0.936     .2643559    3.406011
5 most de..  |   1.465014   1.129991     0.50   0.621     .3230687    6.643371
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(11)      =        7.52
Log likelihood  =   -100.24334                  Prob > chi2      =      0.7556

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.338991   1.224923     0.32   0.750     .2228895    8.043879
      Black  |   1.403661   1.284202     0.37   0.711      .233616    8.433779
      Mixed  |   2.203964   1.850292     0.94   0.347      .425203    11.42386
      Other  |   .4498846     .55183    -0.65   0.515     .0406457    4.979526
    Unknown  |   .5292228   .5298383    -0.64   0.525     .0743785    3.765563
             |
        male |
       Male  |   1.672894   .8655495     0.99   0.320     .6068196    4.611871
        age1 |    .998798   .0653709    -0.02   0.985     .8785508    1.135503
        age2 |   1.020995   .2600816     0.08   0.935     .6197178    1.682105
        age3 |   .8551664   .6099818    -0.22   0.826     .2112988    3.461022
             |
         imd |
          4  |   .9488936   .6187289    -0.08   0.936     .2643559    3.406011
5 most de..  |   1.465014   1.129991     0.50   0.621     .3230687    6.643371
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_positivetest_eth5.ster not found)
file ./output/model/model1_positivetest_eth5.ster saved
(note: file ./output/model/model1_positivetest_eth5.dta not found)
file ./output/model/model1_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(41)      =       41.14
Log likelihood  =   -83.431756                  Prob > chi2      =      0.4644

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.346186   1.254354     0.32   0.750     .2167552    8.360662
      Black  |    1.30835   1.220994     0.29   0.773     .2100659    8.148777
      Mixed  |   1.867583   1.605632     0.73   0.468     .3463136    10.07141
      Other  |    .466162   .5854123    -0.61   0.543     .0397729      5.4637
    Unknown  |   .4780718   .4870624    -0.72   0.469     .0649059    3.521294
             |
        male |
       Male  |   1.607454   .8505661     0.90   0.370     .5698164    4.534634
        age1 |   .9713967   .0687071    -0.41   0.682     .8456506    1.115841
        age2 |   1.101445   .2981835     0.36   0.721     .6479262    1.872408
        age3 |   .7181417   .5419053    -0.44   0.661     .1636435    3.151531
             |
         imd |
          4  |   .9719229    .651232    -0.04   0.966     .2613897    3.613891
5 most de..  |   1.672707   1.320129     0.65   0.515     .3561531    7.856026
             |
   bmicat_sa |
Normal (..)  |   1.91e+09   2.75e+09    14.81   0.000     1.13e+08    3.22e+10
Overweig..)  |   1.28e+09   1.86e+09    14.45   0.000     7.44e+07    2.20e+10
Obese I ..)  |   5.28e+09   5.95e+09    19.88   0.000     5.81e+08    4.80e+10
Obese II..)  |   1.69e+09   2.14e+09    16.79   0.000     1.41e+08    2.02e+10
Obese II..)  |   4.14e+09   4.62e+09    19.84   0.000     4.64e+08    3.69e+10
    Unknown  |   9.36e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .7080616   .5618214    -0.44   0.664     .1495111    3.353272
  >=7.5-7.9  |    2.13251   1.718483     0.94   0.347     .4394913    10.34741
    >=8-8.9  |   1.037262   1.105214     0.03   0.973     .1285061    8.372456
        >=9  |   3.09e-17   6.97e-09    -0.00   1.000            0           .
    Unknown  |   34.21437    43.1091     2.80   0.005     2.895474    404.2942
             |
gp_consult~t |   .9337208   .1068225    -0.60   0.549     .7461655     1.16842
             |
smoke_nomiss |
     Former  |   3.748965    4.16151     1.19   0.234     .4256392    33.02031
    Current  |   .5061968    .532296    -0.65   0.517     .0644511    3.975651
             |
1.hyperten~n |   1.366312   .8290348     0.51   0.607     .4159753    4.487785
             |
      bp_cat |
High, sta..  |    5463683    3110923    27.25   0.000      1789891    1.67e+07
    Unknown  |   2.14e+07          .        .       .            .           .
             |
    1.asthma |   3.49e-17   7.15e-09    -0.00   1.000            0           .
1.~y_disease |   2.058236   1.148653     1.29   0.196     .6893817    6.145124
1.~c_disease |   3.721809   1.967173     2.49   0.013     1.320836    10.48719
             |
     dm_type |
       T1DM  |   3.28e-17   9.18e-09    -0.00   1.000            0           .
       T2DM  |   .9769825   .6456252    -0.04   0.972      .267536    3.567725
 UNKNOWN_DM  |   3.32e-17   9.28e-09    -0.00   1.000            0           .
             |
    1.cancer |   .5346106   .4107098    -0.82   0.415     .1186068    2.409714
1.~r_disease |   .8244194   .5503954    -0.29   0.772     .2227781    3.050871
    1.stroke |   .6724051   .5204353    -0.51   0.608     .1475058    3.065159
  1.dementia |    .484513    .380926    -0.92   0.357     .1037738     2.26216
1.other_ne~o |    .597767   .4592111    -0.67   0.503     .1326263    2.694227
             |
      egfr60 |
   eGFR <60  |   9.29e-17   3.65e-08    -0.00   1.000            0           .
      1.esrf |   .5603188   .4314682    -0.75   0.452     .1238727    2.534515
1.immunosu~d |    1.15102   .6098505     0.27   0.791     .4074618    3.251465
1.ra_sle_p~s |   .9746199   .6402443    -0.04   0.969     .2689469    3.531864
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(41)      =       41.14
Log likelihood  =   -83.431756                  Prob > chi2      =      0.4644

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.346186   1.254354     0.32   0.750     .2167552    8.360662
      Black  |    1.30835   1.220994     0.29   0.773     .2100659    8.148777
      Mixed  |   1.867583   1.605632     0.73   0.468     .3463136    10.07141
      Other  |    .466162   .5854123    -0.61   0.543     .0397729      5.4637
    Unknown  |   .4780718   .4870624    -0.72   0.469     .0649059    3.521294
             |
        male |
       Male  |   1.607454   .8505661     0.90   0.370     .5698164    4.534634
        age1 |   .9713967   .0687071    -0.41   0.682     .8456506    1.115841
        age2 |   1.101445   .2981835     0.36   0.721     .6479262    1.872408
        age3 |   .7181417   .5419053    -0.44   0.661     .1636435    3.151531
             |
         imd |
          4  |   .9719229    .651232    -0.04   0.966     .2613897    3.613891
5 most de..  |   1.672707   1.320129     0.65   0.515     .3561531    7.856026
             |
   bmicat_sa |
Normal (..)  |   1.91e+09   2.75e+09    14.81   0.000     1.13e+08    3.22e+10
Overweig..)  |   1.28e+09   1.86e+09    14.45   0.000     7.44e+07    2.20e+10
Obese I ..)  |   5.28e+09   5.95e+09    19.88   0.000     5.81e+08    4.80e+10
Obese II..)  |   1.69e+09   2.14e+09    16.79   0.000     1.41e+08    2.02e+10
Obese II..)  |   4.14e+09   4.62e+09    19.84   0.000     4.64e+08    3.69e+10
    Unknown  |   9.36e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .7080616   .5618214    -0.44   0.664     .1495111    3.353272
  >=7.5-7.9  |    2.13251   1.718483     0.94   0.347     .4394913    10.34741
    >=8-8.9  |   1.037262   1.105214     0.03   0.973     .1285061    8.372456
        >=9  |   3.09e-17   6.97e-09    -0.00   1.000            0           .
    Unknown  |   34.21437    43.1091     2.80   0.005     2.895474    404.2942
             |
gp_consult~t |   .9337208   .1068225    -0.60   0.549     .7461655     1.16842
             |
smoke_nomiss |
     Former  |   3.748965    4.16151     1.19   0.234     .4256392    33.02031
    Current  |   .5061968    .532296    -0.65   0.517     .0644511    3.975651
             |
1.hyperten~n |   1.366312   .8290348     0.51   0.607     .4159753    4.487785
             |
      bp_cat |
High, sta..  |    5463683    3110923    27.25   0.000      1789891    1.67e+07
    Unknown  |   2.14e+07          .        .       .            .           .
             |
    1.asthma |   3.49e-17   7.15e-09    -0.00   1.000            0           .
1.~y_disease |   2.058236   1.148653     1.29   0.196     .6893817    6.145124
1.~c_disease |   3.721809   1.967173     2.49   0.013     1.320836    10.48719
             |
     dm_type |
       T1DM  |   3.28e-17   9.18e-09    -0.00   1.000            0           .
       T2DM  |   .9769825   .6456252    -0.04   0.972      .267536    3.567725
 UNKNOWN_DM  |   3.32e-17   9.28e-09    -0.00   1.000            0           .
             |
    1.cancer |   .5346106   .4107098    -0.82   0.415     .1186068    2.409714
1.~r_disease |   .8244194   .5503954    -0.29   0.772     .2227781    3.050871
    1.stroke |   .6724051   .5204353    -0.51   0.608     .1475058    3.065159
  1.dementia |    .484513    .380926    -0.92   0.357     .1037738     2.26216
1.other_ne~o |    .597767   .4592111    -0.67   0.503     .1326263    2.694227
             |
      egfr60 |
   eGFR <60  |   9.29e-17   3.65e-08    -0.00   1.000            0           .
      1.esrf |   .5603188   .4314682    -0.75   0.452     .1238727    2.534515
1.immunosu~d |    1.15102   .6098505     0.27   0.791     .4074618    3.251465
1.ra_sle_p~s |   .9746199   .6402443    -0.04   0.969     .2689469    3.531864
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_positivetest_eth5.ster not found)
file ./output/model/model2_positivetest_eth5.ster saved
(note: file ./output/model/model2_positivetest_eth5.dta not found)
file ./output/model/model2_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858762
                                                LR chi2(43)      =       41.92
Log likelihood  =   -83.044346                  Prob > chi2      =      0.5182

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.391787   1.298463     0.35   0.723     .2235875    8.663595
      Black  |    1.31369   1.229069     0.29   0.771     .2099526    8.219859
      Mixed  |   1.887564   1.626324     0.74   0.461     .3487445    10.21636
      Other  |   .4662508   .5856809    -0.61   0.544     .0397542     5.46835
    Unknown  |   .4707346   .4802888    -0.74   0.460     .0637233    3.477394
             |
        male |
       Male  |   1.623404   .8612881     0.91   0.361     .5738865    4.592265
        age1 |   .9767744   .0697406    -0.33   0.742     .8492184     1.12349
        age2 |    1.07867   .2942942     0.28   0.781     .6319091    1.841291
        age3 |   .7572755   .5752854    -0.37   0.714       .17085    3.356548
             |
         imd |
          4  |   .9831999   .6607176    -0.03   0.980     .2634075    3.669911
5 most de..  |   1.732028   1.370971     0.69   0.488     .3671084     8.17176
             |
   bmicat_sa |
Normal (..)  |   1.87e+09   2.70e+09    14.79   0.000     1.10e+08    3.17e+10
Overweig..)  |   1.30e+09   1.90e+09    14.44   0.000     7.55e+07    2.25e+10
Obese I ..)  |   5.23e+09   5.89e+09    19.89   0.000     5.77e+08    4.75e+10
Obese II..)  |   1.69e+09   2.14e+09    16.79   0.000     1.41e+08    2.02e+10
Obese II..)  |   4.07e+09   4.54e+09    19.84   0.000     4.57e+08    3.62e+10
    Unknown  |   9.44e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .7074171    .560748    -0.44   0.662     .1496077    3.345008
  >=7.5-7.9  |   2.058104   1.658044     0.90   0.370     .4243505    9.981821
    >=8-8.9  |   1.058514   1.127565     0.05   0.957     .1312105    8.539354
        >=9  |   1.65e-15   5.15e-08    -0.00   1.000            0           .
    Unknown  |   33.86254   42.58654     2.80   0.005     2.878877    398.3053
             |
gp_consult~t |   .9398603   .1081036    -0.54   0.590      .750166    1.177523
             |
smoke_nomiss |
     Former  |   3.852008   4.290128     1.21   0.226     .4341817    34.17454
    Current  |   .5153098   .5420485    -0.63   0.529     .0655691    4.049837
             |
1.hyperten~n |    1.37721   .8379718     0.53   0.599     .4179089    4.538569
             |
      bp_cat |
High, sta..  |    5155523    2938058    27.12   0.000      1687273    1.58e+07
    Unknown  |   1.96e+07          .        .       .            .           .
             |
    1.asthma |   1.83e-15   5.23e-08    -0.00   1.000            0           .
1.~y_disease |   2.115599   1.187563     1.33   0.182     .7040809     6.35688
1.~c_disease |   3.740689   1.977716     2.50   0.013     1.327145     10.5435
             |
     dm_type |
       T1DM  |   1.77e-15   6.88e-08    -0.00   1.000            0           .
       T2DM  |   .9158238     .61183    -0.13   0.895     .2472599    3.392111
 UNKNOWN_DM  |   1.81e-15   6.98e-08    -0.00   1.000            0           .
             |
    1.cancer |   .5486194   .4222227    -0.78   0.435     .1213887    2.479499
1.~r_disease |   .8008387   .5375864    -0.33   0.741     .2148578    2.984963
    1.stroke |   .6445047   .5007829    -0.57   0.572     .1405526     2.95538
  1.dementia |    .495286   .3901881    -0.89   0.372      .105749     2.31972
1.other_ne~o |   .6032258   .4637415    -0.66   0.511      .133691    2.721808
             |
      egfr60 |
   eGFR <60  |   5.19e-15   2.77e-07    -0.00   1.000            0           .
      1.esrf |   .5735302   .4426783    -0.72   0.471     .1263449    2.603483
1.immunosu~d |   1.134158   .6027651     0.24   0.813     .4002115    3.214084
1.ra_sle_p~s |   .9899802   .6505371    -0.02   0.988     .2730761    3.588965
             |
hh_total_cat |
       6-10  |   .3404599   .3730352    -0.98   0.325     .0397577    2.915485
        11+  |   6.39e-16   1.43e-07    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_positivetest_eth5.ster not found)
file ./output/model/model3_positivetest_eth5.ster saved
(note: file ./output/model/model3_positivetest_eth5.dta not found)
file ./output/model/model3_positivetest_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
icu
(1,191 observations deleted)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |          1  (omitted)
      Black  |          1  (omitted)
      Mixed  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_icu_eth5.ster not found)
file ./output/model/crude_icu_eth5.ster saved
(note: file ./output/model/crude_icu_eth5.dta not found)
file ./output/model/crude_icu_eth5.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |          1  (omitted)
      Black  |          1  (omitted)
      Mixed  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_icu_eth5.ster not found)
file ./output/model/model0_icu_eth5.ster saved
(note: file ./output/model/model0_icu_eth5.dta not found)
file ./output/model/model0_icu_eth5.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |          1  (omitted)
      Black  |          1  (omitted)
      Mixed  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |          1  (omitted)
      Black  |          1  (omitted)
      Mixed  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_icu_eth5.ster not found)
file ./output/model/model1_icu_eth5.ster saved
(note: file ./output/model/model1_icu_eth5.dta not found)
file ./output/model/model1_icu_eth5.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |          1  (omitted)
      Black  |          1  (omitted)
      Mixed  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
   bmicat_sa |
Normal (..)  |          1  (omitted)
Overweig..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    hba1ccat |
  >=6.5-7.4  |          1  (omitted)
  >=7.5-7.9  |          1  (omitted)
    >=8-8.9  |          1  (omitted)
        >=9  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
gp_consult~t |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |          1  (omitted)
             |
1.hyperten~n |          1  (omitted)
             |
      bp_cat |
High, sta..  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    1.asthma |          1  (omitted)
1.~y_disease |          1  (omitted)
1.~c_disease |          1  (omitted)
             |
     dm_type |
       T1DM  |          1  (omitted)
       T2DM  |          1  (omitted)
 UNKNOWN_DM  |          1  (omitted)
             |
    1.cancer |          1  (omitted)
1.~r_disease |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
1.other_ne~o |          1  (omitted)
             |
      egfr60 |
   eGFR <60  |          1  (omitted)
      1.esrf |          1  (omitted)
1.immunosu~d |          1  (omitted)
1.ra_sle_p~s |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |          1  (omitted)
      Black  |          1  (omitted)
      Mixed  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
   bmicat_sa |
Normal (..)  |          1  (omitted)
Overweig..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    hba1ccat |
  >=6.5-7.4  |          1  (omitted)
  >=7.5-7.9  |          1  (omitted)
    >=8-8.9  |          1  (omitted)
        >=9  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
gp_consult~t |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |          1  (omitted)
             |
1.hyperten~n |          1  (omitted)
             |
      bp_cat |
High, sta..  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    1.asthma |          1  (omitted)
1.~y_disease |          1  (omitted)
1.~c_disease |          1  (omitted)
             |
     dm_type |
       T1DM  |          1  (omitted)
       T2DM  |          1  (omitted)
 UNKNOWN_DM  |          1  (omitted)
             |
    1.cancer |          1  (omitted)
1.~r_disease |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
1.other_ne~o |          1  (omitted)
             |
      egfr60 |
   eGFR <60  |          1  (omitted)
      1.esrf |          1  (omitted)
1.immunosu~d |          1  (omitted)
1.ra_sle_p~s |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_icu_eth5.ster not found)
file ./output/model/model2_icu_eth5.ster saved
(note: file ./output/model/model2_icu_eth5.dta not found)
file ./output/model/model2_icu_eth5.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            0
Time at risk    =      1186740
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |          1  (omitted)
      Black  |          1  (omitted)
      Mixed  |          1  (omitted)
      Other  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
        male |
       Male  |          1  (omitted)
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
             |
         imd |
          4  |          1  (omitted)
5 most de..  |          1  (omitted)
             |
   bmicat_sa |
Normal (..)  |          1  (omitted)
Overweig..)  |          1  (omitted)
Obese I ..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
Obese II..)  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    hba1ccat |
  >=6.5-7.4  |          1  (omitted)
  >=7.5-7.9  |          1  (omitted)
    >=8-8.9  |          1  (omitted)
        >=9  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
gp_consult~t |          1  (omitted)
             |
smoke_nomiss |
     Former  |          1  (omitted)
    Current  |          1  (omitted)
             |
1.hyperten~n |          1  (omitted)
             |
      bp_cat |
High, sta..  |          1  (omitted)
    Unknown  |          1  (omitted)
             |
    1.asthma |          1  (omitted)
1.~y_disease |          1  (omitted)
1.~c_disease |          1  (omitted)
             |
     dm_type |
       T1DM  |          1  (omitted)
       T2DM  |          1  (omitted)
 UNKNOWN_DM  |          1  (omitted)
             |
    1.cancer |          1  (omitted)
1.~r_disease |          1  (omitted)
    1.stroke |          1  (omitted)
  1.dementia |          1  (omitted)
1.other_ne~o |          1  (omitted)
             |
      egfr60 |
   eGFR <60  |          1  (omitted)
      1.esrf |          1  (omitted)
1.immunosu~d |          1  (omitted)
1.ra_sle_p~s |          1  (omitted)
             |
hh_total_cat |
       6-10  |          1  (omitted)
        11+  |          1  (omitted)
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_icu_eth5.ster not found)
file ./output/model/model3_icu_eth5.ster saved
(note: file ./output/model/model3_icu_eth5.dta not found)
file ./output/model/model3_icu_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
hes
(1,191 observations deleted)

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(5)       =        8.76
Log likelihood  =   -5876.2181                  Prob > chi2      =      0.1190

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    1.14156   .1406394     1.07   0.283     .8966674    1.453337
      Black  |   1.154284   .1422515     1.16   0.244     .9065931    1.469647
      Mixed  |   1.194392   .1451147     1.46   0.144     .9413014    1.515532
      Other  |     1.1857   .1459016     1.38   0.166     .9316088    1.509093
    Unknown  |   .9380181   .1077254    -0.56   0.577     .7489558    1.174806
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_hes_eth5.ster not found)
file ./output/model/crude_hes_eth5.ster saved
(note: file ./output/model/crude_hes_eth5.dta not found)
file ./output/model/crude_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(9)       =        9.79
Log likelihood  =    -5875.705                  Prob > chi2      =      0.3681

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.142428   .1407922     1.08   0.280     .8972788    1.454557
      Black  |   1.155285   .1424055     1.17   0.242     .9073323    1.470998
      Mixed  |   1.193756    .145075     1.46   0.145      .940742    1.514818
      Other  |   1.185705   .1459549     1.38   0.166      .931532    1.509231
    Unknown  |   .9379505   .1077429    -0.56   0.577     .7488622    1.174784
             |
        male |
       Male  |   1.014988    .067181     0.22   0.822     .8914991    1.155583
        age1 |   1.006071   .0090756     0.67   0.502     .9884399    1.024017
        age2 |    .976054   .0322304    -0.73   0.463     .9148844    1.041313
        age3 |   1.061422   .0932089     0.68   0.497     .8935929    1.260772
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_hes_eth5.ster not found)
file ./output/model/model0_hes_eth5.ster saved
(note: file ./output/model/model0_hes_eth5.dta not found)
file ./output/model/model0_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(11)      =       10.60
Log likelihood  =   -5875.2981                  Prob > chi2      =      0.4774

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.143212   .1408906     1.09   0.277     .8978915    1.455559
      Black  |    1.15327   .1421754     1.16   0.247     .9057216    1.468478
      Mixed  |   1.192257   .1449048     1.45   0.148     .9395428    1.512946
      Other  |   1.188032   .1462706     1.40   0.162     .9333151    1.512266
    Unknown  |   .9384841   .1078091    -0.55   0.580     .7492806    1.175464
             |
        male |
       Male  |   1.013821   .0671147     0.21   0.836      .890455    1.154278
        age1 |   1.006234   .0090777     0.69   0.491      .988599    1.024185
        age2 |   .9756086   .0322174    -0.75   0.455     .9144638    1.040842
        age3 |   1.062464   .0933044     0.69   0.490     .8944639    1.262019
             |
         imd |
          4  |   .9514327   .0793722    -0.60   0.551     .8079185     1.12044
5 most de..  |   .9148224   .1079782    -0.75   0.451     .7258852    1.152937
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(11)      =       10.60
Log likelihood  =   -5875.2981                  Prob > chi2      =      0.4774

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.143212   .1408906     1.09   0.277     .8978915    1.455559
      Black  |    1.15327   .1421754     1.16   0.247     .9057216    1.468478
      Mixed  |   1.192257   .1449048     1.45   0.148     .9395428    1.512946
      Other  |   1.188032   .1462706     1.40   0.162     .9333151    1.512266
    Unknown  |   .9384841   .1078091    -0.55   0.580     .7492806    1.175464
             |
        male |
       Male  |   1.013821   .0671147     0.21   0.836      .890455    1.154278
        age1 |   1.006234   .0090777     0.69   0.491      .988599    1.024185
        age2 |   .9756086   .0322174    -0.75   0.455     .9144638    1.040842
        age3 |   1.062464   .0933044     0.69   0.490     .8944639    1.262019
             |
         imd |
          4  |   .9514327   .0793722    -0.60   0.551     .8079185     1.12044
5 most de..  |   .9148224   .1079782    -0.75   0.451     .7258852    1.152937
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_hes_eth5.ster not found)
file ./output/model/model1_hes_eth5.ster saved
(note: file ./output/model/model1_hes_eth5.dta not found)
file ./output/model/model1_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(43)      =       61.42
Log likelihood  =   -5849.8894                  Prob > chi2      =      0.0338

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.154199   .1430961     1.16   0.247     .9052105    1.471673
      Black  |   1.118722   .1384209     0.91   0.365     .8778128    1.425747
      Mixed  |   1.190713   .1451358     1.43   0.152     .9376792    1.512028
      Other  |   1.181675   .1460132     1.35   0.177     .9275124    1.505485
    Unknown  |    .921731   .1062373    -0.71   0.479     .7353533    1.155347
             |
        male |
       Male  |   1.009041   .0671685     0.14   0.892     .8856193    1.149663
        age1 |   1.004588   .0093465     0.49   0.623     .9864355    1.023075
        age2 |   .9802195   .0329534    -0.59   0.552      .917714    1.046982
        age3 |    1.05219   .0937139     0.57   0.568     .8836526    1.252873
             |
         imd |
          4  |   .9522354   .0796165    -0.59   0.558     .8083049    1.121795
5 most de..  |   .9235632   .1092447    -0.67   0.501     .7324555    1.164533
             |
   bmicat_sa |
Normal (..)  |   1.319233   .3213941     1.14   0.255      .818371    2.126635
Overweig..)  |   1.242518   .2942351     0.92   0.359      .781148    1.976386
Obese I ..)  |   1.069447   .2520825     0.28   0.776     .6737826    1.697455
Obese II..)  |   1.527681   .3525285     1.84   0.066     .9718714    2.401355
Obese II..)  |   1.189168   .2734958     0.75   0.451     .7576629    1.866424
    Unknown  |   1.192662   .2806329     0.75   0.454     .7520211    1.891493
             |
    hba1ccat |
  >=6.5-7.4  |   1.049675   .0919644     0.55   0.580     .8840551    1.246323
  >=7.5-7.9  |   1.002971   .1375798     0.02   0.983     .7665263     1.31235
    >=8-8.9  |   1.049315   .1300423     0.39   0.698     .8230302    1.337814
        >=9  |   .8620616   .1571241    -0.81   0.415     .6031059    1.232205
    Unknown  |   .3605767   .3615495    -1.02   0.309     .0505242    2.573331
             |
gp_consult~t |   .9949689   .0143555    -0.35   0.727     .9672268    1.023507
             |
smoke_nomiss |
     Former  |   .7903824   .2068821    -0.90   0.369     .4731902    1.320197
    Current  |   .9867531   .1034354    -0.13   0.899     .8034931    1.211811
             |
1.hyperten~n |   1.181111    .094257     2.09   0.037     1.010093    1.381082
             |
      bp_cat |
High, sta..  |   .6926164    .696765    -0.37   0.715     .0964257    4.974997
    Unknown  |   .7818589   .7901949    -0.24   0.808     .1078578    5.667679
             |
    1.asthma |    1.25814   .1996905     1.45   0.148     .9217797    1.717238
1.~y_disease |   1.003745   .0835852     0.04   0.964     .8525912    1.181696
1.~c_disease |   .9639862   .0809125    -0.44   0.662     .8177583    1.136362
             |
     dm_type |
       T1DM  |   1.326907   .2416207     1.55   0.120     .9286296    1.896001
       T2DM  |   1.025576   .0847186     0.31   0.760     .8722759    1.205819
 UNKNOWN_DM  |    1.05477   .2403198     0.23   0.815     .6748682    1.648528
             |
    1.cancer |    .902074   .0772432    -1.20   0.229     .7627024    1.066914
1.~r_disease |   1.005821   .0825318     0.07   0.944      .856399    1.181314
    1.stroke |   1.106819   .0892275     1.26   0.208     .9450522    1.296275
  1.dementia |    .800555   .0702728    -2.53   0.011     .6740198     .950845
1.other_ne~o |   1.156973   .0920175     1.83   0.067     .9899762    1.352141
             |
      egfr60 |
   eGFR <60  |   .6794535   .2625195    -1.00   0.317     .3186268    1.448896
      1.esrf |   1.236033   .0969086     2.70   0.007      1.05997    1.441341
1.immunosu~d |   .9998153   .0691254    -0.00   0.998     .8731106    1.144907
1.ra_sle_p~s |   1.158254   .0926299     1.84   0.066     .9902165    1.354808
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(43)      =       61.42
Log likelihood  =   -5849.8894                  Prob > chi2      =      0.0338

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.154199   .1430961     1.16   0.247     .9052105    1.471673
      Black  |   1.118722   .1384209     0.91   0.365     .8778128    1.425747
      Mixed  |   1.190713   .1451358     1.43   0.152     .9376792    1.512028
      Other  |   1.181675   .1460132     1.35   0.177     .9275124    1.505485
    Unknown  |    .921731   .1062373    -0.71   0.479     .7353533    1.155347
             |
        male |
       Male  |   1.009041   .0671685     0.14   0.892     .8856193    1.149663
        age1 |   1.004588   .0093465     0.49   0.623     .9864355    1.023075
        age2 |   .9802195   .0329534    -0.59   0.552      .917714    1.046982
        age3 |    1.05219   .0937139     0.57   0.568     .8836526    1.252873
             |
         imd |
          4  |   .9522354   .0796165    -0.59   0.558     .8083049    1.121795
5 most de..  |   .9235632   .1092447    -0.67   0.501     .7324555    1.164533
             |
   bmicat_sa |
Normal (..)  |   1.319233   .3213941     1.14   0.255      .818371    2.126635
Overweig..)  |   1.242518   .2942351     0.92   0.359      .781148    1.976386
Obese I ..)  |   1.069447   .2520825     0.28   0.776     .6737826    1.697455
Obese II..)  |   1.527681   .3525285     1.84   0.066     .9718714    2.401355
Obese II..)  |   1.189168   .2734958     0.75   0.451     .7576629    1.866424
    Unknown  |   1.192662   .2806329     0.75   0.454     .7520211    1.891493
             |
    hba1ccat |
  >=6.5-7.4  |   1.049675   .0919644     0.55   0.580     .8840551    1.246323
  >=7.5-7.9  |   1.002971   .1375798     0.02   0.983     .7665263     1.31235
    >=8-8.9  |   1.049315   .1300423     0.39   0.698     .8230302    1.337814
        >=9  |   .8620616   .1571241    -0.81   0.415     .6031059    1.232205
    Unknown  |   .3605767   .3615495    -1.02   0.309     .0505242    2.573331
             |
gp_consult~t |   .9949689   .0143555    -0.35   0.727     .9672268    1.023507
             |
smoke_nomiss |
     Former  |   .7903824   .2068821    -0.90   0.369     .4731902    1.320197
    Current  |   .9867531   .1034354    -0.13   0.899     .8034931    1.211811
             |
1.hyperten~n |   1.181111    .094257     2.09   0.037     1.010093    1.381082
             |
      bp_cat |
High, sta..  |   .6926164    .696765    -0.37   0.715     .0964257    4.974997
    Unknown  |   .7818589   .7901949    -0.24   0.808     .1078578    5.667679
             |
    1.asthma |    1.25814   .1996905     1.45   0.148     .9217797    1.717238
1.~y_disease |   1.003745   .0835852     0.04   0.964     .8525912    1.181696
1.~c_disease |   .9639862   .0809125    -0.44   0.662     .8177583    1.136362
             |
     dm_type |
       T1DM  |   1.326907   .2416207     1.55   0.120     .9286296    1.896001
       T2DM  |   1.025576   .0847186     0.31   0.760     .8722759    1.205819
 UNKNOWN_DM  |    1.05477   .2403198     0.23   0.815     .6748682    1.648528
             |
    1.cancer |    .902074   .0772432    -1.20   0.229     .7627024    1.066914
1.~r_disease |   1.005821   .0825318     0.07   0.944      .856399    1.181314
    1.stroke |   1.106819   .0892275     1.26   0.208     .9450522    1.296275
  1.dementia |    .800555   .0702728    -2.53   0.011     .6740198     .950845
1.other_ne~o |   1.156973   .0920175     1.83   0.067     .9899762    1.352141
             |
      egfr60 |
   eGFR <60  |   .6794535   .2625195    -1.00   0.317     .3186268    1.448896
      1.esrf |   1.236033   .0969086     2.70   0.007      1.05997    1.441341
1.immunosu~d |   .9998153   .0691254    -0.00   0.998     .8731106    1.144907
1.ra_sle_p~s |   1.158254   .0926299     1.84   0.066     .9902165    1.354808
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_hes_eth5.ster not found)
file ./output/model/model2_hes_eth5.ster saved
(note: file ./output/model/model2_hes_eth5.dta not found)
file ./output/model/model2_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =          916
Time at risk    =      1828003
                                                LR chi2(45)      =       62.11
Log likelihood  =   -5849.5427                  Prob > chi2      =      0.0461

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.154836   .1431847     1.16   0.246     .9056961     1.47251
      Black  |   1.118462   .1383908     0.90   0.366      .877606    1.425421
      Mixed  |   1.189304   .1450059     1.42   0.155     .9365054    1.510344
      Other  |   1.179163   .1457328     1.33   0.182     .9254943    1.502359
    Unknown  |   .9204028   .1061227    -0.72   0.472     .7342334    1.153777
             |
        male |
       Male  |   1.009075   .0671921     0.14   0.892     .8856128    1.149749
        age1 |   1.004577    .009349     0.49   0.624     .9864192    1.023069
        age2 |   .9799618   .0329561    -0.60   0.547     .9174518    1.046731
        age3 |   1.053202     .09384     0.58   0.561     .8844427    1.254161
             |
         imd |
          4  |   .9533331   .0797379    -0.57   0.568     .8091876    1.123156
5 most de..  |   .9258275   .1095707    -0.65   0.515     .7341609    1.167532
             |
   bmicat_sa |
Normal (..)  |    1.31505   .3204287     1.12   0.261     .8157107    2.120061
Overweig..)  |   1.239753    .293612     0.91   0.364     .7793712    1.972087
Obese I ..)  |   1.066697   .2514616     0.27   0.784     .6720163    1.693176
Obese II..)  |   1.524138   .3517567     1.83   0.068     .9695603    2.395927
Obese II..)  |   1.184942   .2725885     0.74   0.461     .7548894     1.85999
    Unknown  |   1.188879     .27978     0.74   0.462       .74959     1.88561
             |
    hba1ccat |
  >=6.5-7.4  |   1.050655   .0920613     0.56   0.573     .8848623    1.247512
  >=7.5-7.9  |   .9993292   .1371992    -0.00   0.996      .763565     1.30789
    >=8-8.9  |   1.046935   .1298963     0.37   0.712     .8209346    1.335152
        >=9  |   .8605491    .156892    -0.82   0.410     .6019879    1.230165
    Unknown  |    .361766   .3627473    -1.01   0.311     .0506894    2.581893
             |
gp_consult~t |   .9952557   .0143665    -0.33   0.742     .9674926    1.023816
             |
smoke_nomiss |
     Former  |   .7908765   .2071013    -0.90   0.370     .4733806    1.321317
    Current  |   .9883118   .1036172    -0.11   0.911     .8047328    1.213769
             |
1.hyperten~n |   1.182438   .0943894     2.10   0.036     1.011185    1.382696
             |
      bp_cat |
High, sta..  |   .6899384   .6940791    -0.37   0.712     .0960506    4.955876
    Unknown  |   .7791685   .7874827    -0.25   0.805     .1074848    5.648274
             |
    1.asthma |   1.256335   .1994604     1.44   0.151     .9203764    1.714926
1.~y_disease |   1.004111   .0836341     0.05   0.961     .8528719     1.18217
1.~c_disease |   .9645456   .0809725    -0.43   0.667     .8182112    1.137052
             |
     dm_type |
       T1DM  |   1.325086   .2414401     1.54   0.122     .9271483    1.893822
       T2DM  |   1.024209   .0846292     0.29   0.772     .8710736    1.204266
 UNKNOWN_DM  |   1.056994   .2408579     0.24   0.808     .6762526      1.6521
             |
    1.cancer |   .9036798   .0774076    -1.18   0.237     .7640154    1.068875
1.~r_disease |   1.005167   .0825027     0.06   0.950     .8558013    1.180603
    1.stroke |   1.106979    .089259     1.26   0.208     .9451581    1.296505
  1.dementia |    .800316   .0702582    -2.54   0.011     .6738079     .950576
1.other_ne~o |   1.156285   .0919897     1.83   0.068     .9893422    1.351398
             |
      egfr60 |
   eGFR <60  |   .6800272   .2627585    -1.00   0.318     .3188798    1.450192
      1.esrf |   1.237503    .097042     2.72   0.007     1.061199    1.443096
1.immunosu~d |   1.000301   .0691757     0.00   0.997      .873506    1.145501
1.ra_sle_p~s |   1.156708   .0925338     1.82   0.069     .9888486    1.353063
             |
hh_total_cat |
       6-10  |   .8697015   .1887881    -0.64   0.520     .5683266    1.330891
        11+  |   1.320728   .9838356     0.37   0.709     .3067162    5.687086
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_hes_eth5.ster not found)
file ./output/model/model3_hes_eth5.ster saved
(note: file ./output/model/model3_hes_eth5.dta not found)
file ./output/model/model3_hes_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
onscoviddeath
(1,191 observations deleted)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(5)       =        3.14
Log likelihood  =   -24.501944                  Prob > chi2      =      0.6788

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9174236   1.300791    -0.06   0.952     .0569735    14.77294
      Black  |   2.38e-19   4.75e-10    -0.00   1.000            0           .
      Mixed  |   .9600554   1.363039    -0.03   0.977     .0594022    15.51636
      Other  |   2.38e-19   4.69e-10    -0.00   1.000            0           .
    Unknown  |   .5139706    .728168    -0.47   0.638     .0319888    8.258066
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_onscoviddeath_eth5.ster not found)
file ./output/model/crude_onscoviddeath_eth5.ster saved
(note: file ./output/model/crude_onscoviddeath_eth5.dta not found)
file ./output/model/crude_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(9)       =        3.93
Log likelihood  =   -24.103858                  Prob > chi2      =      0.9157

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9442801   1.341184    -0.04   0.968     .0583605    15.27858
      Black  |   3.66e-17   5.98e-09    -0.00   1.000            0           .
      Mixed  |   1.007028   1.432071     0.00   0.996     .0620251     16.3499
      Other  |   3.67e-17   5.91e-09    -0.00   1.000            0           .
    Unknown  |   .5273331   .7475731    -0.45   0.652     .0327627    8.487696
             |
        male |
       Male  |   1.078394   1.080734     0.08   0.940     .1512614    7.688233
        age1 |   1.148649   .2339999     0.68   0.496     .7705175    1.712347
        age2 |   .7042486   .4366443    -0.57   0.572     .2089146    2.374014
        age3 |   2.192663   3.407087     0.51   0.613     .1043099    46.09122
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_onscoviddeath_eth5.ster not found)
file ./output/model/model0_onscoviddeath_eth5.ster saved
(note: file ./output/model/model0_onscoviddeath_eth5.dta not found)
file ./output/model/model0_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(11)      =        6.30
Log likelihood  =   -22.920606                  Prob > chi2      =      0.8526

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9547227    1.35701    -0.03   0.974     .0588855    15.47912
      Black  |   2.70e-16   1.63e-08    -0.00   1.000            0           .
      Mixed  |   1.105155   1.574792     0.07   0.944     .0676864    18.04448
      Other  |   2.89e-16   1.67e-08    -0.00   1.000            0           .
    Unknown  |   .5426613   .7702066    -0.43   0.667     .0336052     8.76296
             |
        male |
       Male  |   1.091301   1.095701     0.09   0.931     .1525144    7.808693
        age1 |   1.147582   .2365642     0.67   0.504     .7661537    1.718904
        age2 |   .7078579   .4442819    -0.55   0.582     .2068691    2.422125
        age3 |   2.169955   3.411973     0.49   0.622     .0995513    47.29928
             |
         imd |
          4  |   4.22e-16   2.18e-08    -0.00   1.000            0           .
5 most de..  |   2.460341   2.866893     0.77   0.440     .2506913    24.14634
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(11)      =        6.30
Log likelihood  =   -22.920606                  Prob > chi2      =      0.8526

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9547227    1.35701    -0.03   0.974     .0588855    15.47912
      Black  |   2.70e-16   1.63e-08    -0.00   1.000            0           .
      Mixed  |   1.105155   1.574792     0.07   0.944     .0676864    18.04448
      Other  |   2.89e-16   1.67e-08    -0.00   1.000            0           .
    Unknown  |   .5426613   .7702066    -0.43   0.667     .0336052     8.76296
             |
        male |
       Male  |   1.091301   1.095701     0.09   0.931     .1525144    7.808693
        age1 |   1.147582   .2365642     0.67   0.504     .7661537    1.718904
        age2 |   .7078579   .4442819    -0.55   0.582     .2068691    2.422125
        age3 |   2.169955   3.411973     0.49   0.622     .0995513    47.29928
             |
         imd |
          4  |   4.22e-16   2.18e-08    -0.00   1.000            0           .
5 most de..  |   2.460341   2.866893     0.77   0.440     .2506913    24.14634
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_onscoviddeath_eth5.ster not found)
file ./output/model/model1_onscoviddeath_eth5.ster saved
(note: file ./output/model/model1_onscoviddeath_eth5.dta not found)
file ./output/model/model1_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(31)      =       52.14
Log likelihood  =   -1.510e-14                  Prob > chi2      =      0.0101

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .0000349   1650.736    -0.00   1.000            0           .
      Black  |   1.67e-15   1.64e-07    -0.00   1.000            0           .
      Mixed  |   .0008375   66747.68    -0.00   1.000            0           .
      Other  |   4.54e-24          .        .       .            .           .
    Unknown  |   5.86e-07          .        .       .            .           .
             |
        male |
       Male  |   1.22e+20   4.77e+27     0.00   1.000            0           .
        age1 |   45.37349   1.06e+08     0.00   1.000            0           .
        age2 |   .0000324   73.91684    -0.00   1.000            0           .
        age3 |   1.46e+11          .        .       .            .           .
             |
         imd |
          4  |   3112.917          .        .       .            .           .
5 most de..  |   3.19e-06   283.7179    -0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   5.49e-72   1.27e-63    -0.00   1.000            0           .
Overweig..)  |   1.09e-63   1.13e-55    -0.00   1.000            0           .
Obese I ..)  |   1.09e-46   1.24e-38    -0.00   1.000            0           .
Obese II..)  |   3.27e-43   2.19e-35    -0.00   1.000            0           .
Obese II..)  |   6.34e-35   4.86e-27    -0.00   1.000            0           .
    Unknown  |   1.35e-12   .0000908    -0.00   1.000            0           .
             |
    hba1ccat |
  >=6.5-7.4  |   3.34e-09    .396749    -0.00   1.000            0           .
  >=7.5-7.9  |   5.98e+22   4.13e+30     0.00   1.000            0           .
    >=8-8.9  |   3.62e-24   1.11e-14    -0.00   1.000            0           .
        >=9  |   2.31e-22          .        .       .            .           .
    Unknown  |     206182          .        .       .            .           .
             |
gp_consult~t |   .0004323   7038.299    -0.00   1.000            0           .
             |
smoke_nomiss |
     Former  |   8.59e+17   1.08e+26     0.00   1.000            0           .
    Current  |   3.15e+18          .        .       .            .           .
             |
1.hyperten~n |   1.82e-14          .        .       .            .           .
             |
      bp_cat |
High, sta..  |   1.15e-92   1.04e-84    -0.00   1.000            0           .
    Unknown  |   1.45e-72          .        .       .            .           .
             |
    1.asthma |   7.42e+26   3.50e+34     0.00   1.000            0           .
1.~y_disease |     633246   5.09e+13     0.00   1.000            0           .
1.~c_disease |   2.88e-07   20.86178    -0.00   1.000            0           .
             |
     dm_type |
       T1DM  |   3.02e-06          .        .       .            .           .
       T2DM  |   .0002858          .        .       .            .           .
 UNKNOWN_DM  |   2.65e+25          .        .       .            .           .
             |
    1.cancer |   1.46e-24   1.42e-16    -0.00   1.000            0           .
1.~r_disease |   7.77e+17   4.33e+25     0.00   1.000            0           .
    1.stroke |   .0001537   8419.652    -0.00   1.000            0           .
  1.dementia |    448.865   2.69e+10     0.00   1.000            0           .
1.other_ne~o |   2.22e-26   2.70e-18    -0.00   1.000            0           .
             |
      egfr60 |
   eGFR <60  |   1.79e+35   2.77e+44     0.00   1.000            0           .
      1.esrf |   6.17e+30   2.79e+38     0.00   1.000            0           .
1.immunosu~d |   4.21e-33   1.94e-25    -0.00   1.000            0           .
1.ra_sle_p~s |   2.05e-09   .1423027    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(31)      =       52.14
Log likelihood  =   -1.510e-14                  Prob > chi2      =      0.0101

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .0000349   1650.736    -0.00   1.000            0           .
      Black  |   1.67e-15   1.64e-07    -0.00   1.000            0           .
      Mixed  |   .0008375   66747.68    -0.00   1.000            0           .
      Other  |   4.54e-24          .        .       .            .           .
    Unknown  |   5.86e-07          .        .       .            .           .
             |
        male |
       Male  |   1.22e+20   4.77e+27     0.00   1.000            0           .
        age1 |   45.37349   1.06e+08     0.00   1.000            0           .
        age2 |   .0000324   73.91684    -0.00   1.000            0           .
        age3 |   1.46e+11          .        .       .            .           .
             |
         imd |
          4  |   3112.917          .        .       .            .           .
5 most de..  |   3.19e-06   283.7179    -0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   5.49e-72   1.27e-63    -0.00   1.000            0           .
Overweig..)  |   1.09e-63   1.13e-55    -0.00   1.000            0           .
Obese I ..)  |   1.09e-46   1.24e-38    -0.00   1.000            0           .
Obese II..)  |   3.27e-43   2.19e-35    -0.00   1.000            0           .
Obese II..)  |   6.34e-35   4.86e-27    -0.00   1.000            0           .
    Unknown  |   1.35e-12   .0000908    -0.00   1.000            0           .
             |
    hba1ccat |
  >=6.5-7.4  |   3.34e-09    .396749    -0.00   1.000            0           .
  >=7.5-7.9  |   5.98e+22   4.13e+30     0.00   1.000            0           .
    >=8-8.9  |   3.62e-24   1.11e-14    -0.00   1.000            0           .
        >=9  |   2.31e-22          .        .       .            .           .
    Unknown  |     206182          .        .       .            .           .
             |
gp_consult~t |   .0004323   7038.299    -0.00   1.000            0           .
             |
smoke_nomiss |
     Former  |   8.59e+17   1.08e+26     0.00   1.000            0           .
    Current  |   3.15e+18          .        .       .            .           .
             |
1.hyperten~n |   1.82e-14          .        .       .            .           .
             |
      bp_cat |
High, sta..  |   1.15e-92   1.04e-84    -0.00   1.000            0           .
    Unknown  |   1.45e-72          .        .       .            .           .
             |
    1.asthma |   7.42e+26   3.50e+34     0.00   1.000            0           .
1.~y_disease |     633246   5.09e+13     0.00   1.000            0           .
1.~c_disease |   2.88e-07   20.86178    -0.00   1.000            0           .
             |
     dm_type |
       T1DM  |   3.02e-06          .        .       .            .           .
       T2DM  |   .0002858          .        .       .            .           .
 UNKNOWN_DM  |   2.65e+25          .        .       .            .           .
             |
    1.cancer |   1.46e-24   1.42e-16    -0.00   1.000            0           .
1.~r_disease |   7.77e+17   4.33e+25     0.00   1.000            0           .
    1.stroke |   .0001537   8419.652    -0.00   1.000            0           .
  1.dementia |    448.865   2.69e+10     0.00   1.000            0           .
1.other_ne~o |   2.22e-26   2.70e-18    -0.00   1.000            0           .
             |
      egfr60 |
   eGFR <60  |   1.79e+35   2.77e+44     0.00   1.000            0           .
      1.esrf |   6.17e+30   2.79e+38     0.00   1.000            0           .
1.immunosu~d |   4.21e-33   1.94e-25    -0.00   1.000            0           .
1.ra_sle_p~s |   2.05e-09   .1423027    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_onscoviddeath_eth5.ster not found)
file ./output/model/model2_onscoviddeath_eth5.ster saved
(note: file ./output/model/model2_onscoviddeath_eth5.dta not found)
file ./output/model/model2_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =            4
Time at risk    =      1858983
                                                LR chi2(29)      =       52.14
Log likelihood  =            0                  Prob > chi2      =      0.0053

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   8.91e-17          .        .       .            .           .
      Black  |   1.38e-50   4.20e-42    -0.00   1.000            0           .
      Mixed  |   3.90e-15   1.56e-07    -0.00   1.000            0           .
      Other  |   1.48e-45   1.13e-37    -0.00   1.000            0           .
    Unknown  |   1.04e-22   2.69e-15    -0.00   1.000            0           .
             |
        male |
       Male  |   3.57e+13   1.17e+21     0.00   1.000            0           .
        age1 |   3870.859   1.66e+10     0.00   1.000            0           .
        age2 |   2.43e-09   .0079176    -0.00   1.000            0           .
        age3 |   8.77e+18          .        .       .            .           .
             |
         imd |
          4  |   6.58e-15          .        .       .            .           .
5 most de..  |   2.54e+09          .        .       .            .           .
             |
   bmicat_sa |
Normal (..)  |   1.24e-71   1.02e-62    -0.00   1.000            0           .
Overweig..)  |   2.67e-41   1.86e-33    -0.00   1.000            0           .
Obese I ..)  |   1.63e-74   7.41e-66    -0.00   1.000            0           .
Obese II..)  |   3.73e-31   1.95e-23    -0.00   1.000            0           .
Obese II..)  |   9.46e-35   5.50e-27    -0.00   1.000            0           .
    Unknown  |   1.96e-15   7.67e-08    -0.00   1.000            0           .
             |
    hba1ccat |
  >=6.5-7.4  |   3.15e-25          .        .       .            .           .
  >=7.5-7.9  |   3.92e+13   1.31e+21     0.00   1.000            0           .
    >=8-8.9  |   4.65e-49   9.01e-40    -0.00   1.000            0           .
        >=9  |   1.88e-06          .        .       .            .           .
    Unknown  |   3.50e-09          .        .       .            .           .
             |
gp_consult~t |   .0003205    3424.95    -0.00   1.000            0           .
             |
smoke_nomiss |
     Former  |   2.34e+23          .        .       .            .           .
    Current  |   5.49e+12   1.45e+20     0.00   1.000            0           .
             |
1.hyperten~n |   1515.515          .        .       .            .           .
             |
      bp_cat |
High, sta..  |   4.49e+10   1.01e+18     0.00   1.000            0           .
    Unknown  |   2.51e+38          .        .       .            .           .
             |
    1.asthma |   3.15e+22          .        .       .            .           .
1.~y_disease |   4.58e+07   2.19e+15     0.00   1.000            0           .
1.~c_disease |   1.23e-25   7.90e-18    -0.00   1.000            0           .
             |
     dm_type |
       T1DM  |   3.96e-36          .        .       .            .           .
       T2DM  |   662.3128   2.36e+10     0.00   1.000            0           .
 UNKNOWN_DM  |   5.71e+15          .        .       .            .           .
             |
    1.cancer |   1.01e-10   .0050135    -0.00   1.000            0           .
1.~r_disease |   2.95e+18   1.47e+26     0.00   1.000            0           .
    1.stroke |   1.05e-15   3.99e-08    -0.00   1.000            0           .
  1.dementia |   3.67e+09   1.26e+17     0.00   1.000            0           .
1.other_ne~o |   3.53e-31   1.83e-23    -0.00   1.000            0           .
             |
      egfr60 |
   eGFR <60  |   101999.1          .        .       .            .           .
      1.esrf |   6.48e+17   1.70e+25     0.00   1.000            0           .
1.immunosu~d |   4.62e-40   5.56e-32    -0.00   1.000            0           .
1.ra_sle_p~s |   2.14e-09   .0964269    -0.00   1.000            0           .
             |
hh_total_cat |
       6-10  |   .1449044          .        .       .            .           .
        11+  |   1.69e+16          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_onscoviddeath_eth5.ster not found)
file ./output/model/model3_onscoviddeath_eth5.ster saved
(note: file ./output/model/model3_onscoviddeath_eth5.dta not found)
file ./output/model/model3_onscoviddeath_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
ons_noncoviddeath
(1,191 observations deleted)

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(4)       =       11.27
Log likelihood  =   -72.242302                  Prob > chi2      =      0.0237

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   3.11e+09          .        .       .            .           .
      Black  |   3.06e-07   31.07237    -0.00   1.000            0           .
      Mixed  |   6.10e+09   7.48e+09    18.39   0.000     5.53e+08    6.74e+10
      Other  |   6.50e+09   7.96e+09    18.45   0.000     5.89e+08    7.17e+10
    Unknown  |   1.30e+10   1.40e+10    21.78   0.000     1.60e+09    1.06e+11
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_ons_noncoviddeath_eth5.ster not found)
file ./output/model/crude_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/crude_ons_noncoviddeath_eth5.dta not found)
file ./output/model/crude_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(8)       =       11.79
Log likelihood  =   -71.980061                  Prob > chi2      =      0.1606

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   3.17e+09          .        .       .            .           .
      Black  |   8.36e-07   51.42962    -0.00   1.000            0           .
      Mixed  |   6.07e+09   7.44e+09    18.37   0.000     5.49e+08    6.71e+10
      Other  |   6.58e+09   8.06e+09    18.45   0.000     5.96e+08    7.26e+10
    Unknown  |   1.32e+10   1.41e+10    21.78   0.000     1.62e+09    1.07e+11
             |
        male |
       Male  |    .952816   .5511559    -0.08   0.933     .3066423    2.960644
        age1 |   1.017554   .0835294     0.21   0.832     .8663306    1.195174
        age2 |   .9063941   .2618303    -0.34   0.734     .5145532    1.596628
        age3 |   1.364593   1.023522     0.41   0.679     .3137285    5.935431
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_ons_noncoviddeath_eth5.ster not found)
file ./output/model/model0_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/model0_ons_noncoviddeath_eth5.dta not found)
file ./output/model/model0_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(9)       =       12.77
Log likelihood  =   -71.494533                  Prob > chi2      =      0.1735

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   3.13e+09          .        .       .            .           .
      Black  |   2.81e-10          .        .       .            .           .
      Mixed  |   6.08e+09   7.45e+09    18.37   0.000     5.49e+08    6.72e+10
      Other  |   6.49e+09   7.95e+09    18.44   0.000     5.88e+08    7.16e+10
    Unknown  |   1.31e+10   1.40e+10    21.77   0.000     1.61e+09    1.06e+11
             |
        male |
       Male  |   .9576861   .5543879    -0.07   0.940      .307948    2.978304
        age1 |   1.015868   .0832798     0.19   0.848     .8650808    1.192938
        age2 |   .9097534   .2618897    -0.33   0.742     .5174748    1.599404
        age3 |   1.354413   1.011547     0.41   0.685     .3133498    5.854275
             |
         imd |
          4  |   1.863842   1.170716     0.99   0.322     .5441927    6.383598
5 most de..  |   .9527151   1.020048    -0.05   0.964     .1168431     7.76825
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(9)       =       12.77
Log likelihood  =   -71.494533                  Prob > chi2      =      0.1735

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   3.13e+09          .        .       .            .           .
      Black  |   2.81e-10          .        .       .            .           .
      Mixed  |   6.08e+09   7.45e+09    18.37   0.000     5.49e+08    6.72e+10
      Other  |   6.49e+09   7.95e+09    18.44   0.000     5.88e+08    7.16e+10
    Unknown  |   1.31e+10   1.40e+10    21.77   0.000     1.61e+09    1.06e+11
             |
        male |
       Male  |   .9576861   .5543879    -0.07   0.940      .307948    2.978304
        age1 |   1.015868   .0832798     0.19   0.848     .8650808    1.192938
        age2 |   .9097534   .2618897    -0.33   0.742     .5174748    1.599404
        age3 |   1.354413   1.011547     0.41   0.685     .3133498    5.854275
             |
         imd |
          4  |   1.863842   1.170716     0.99   0.322     .5441927    6.383598
5 most de..  |   .9527151   1.020048    -0.05   0.964     .1168431     7.76825
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_ons_noncoviddeath_eth5.ster not found)
file ./output/model/model1_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/model1_ons_noncoviddeath_eth5.dta not found)
file ./output/model/model1_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(31)      =       48.30
Log likelihood  =   -53.728723                  Prob > chi2      =      0.0246

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   2.90e+09          .        .       .            .           .
      Black  |   2.06e-10          .        .       .            .           .
      Mixed  |   5.45e+09   6.78e+09    18.02   0.000     4.75e+08    6.24e+10
      Other  |   4.98e+09   6.25e+09    17.80   0.000     4.26e+08    5.82e+10
    Unknown  |   1.00e+10   1.09e+10    21.10   0.000     1.18e+09    8.49e+10
             |
        male |
       Male  |   1.088756   .6501171     0.14   0.887     .3378017    3.509129
        age1 |   .9965097   .0880402    -0.04   0.968     .8380676    1.184906
        age2 |   .9378244   .2872773    -0.21   0.834     .5144922    1.709481
        age3 |   1.289728   1.018889     0.32   0.747     .2741871    6.066659
             |
         imd |
          4  |   2.041579   1.378079     1.06   0.290     .5437504    7.665364
5 most de..  |   1.285963   1.427673     0.23   0.821     .1459577    11.33001
             |
   bmicat_sa |
Normal (..)  |   5.65e+08          .        .       .            .           .
Overweig..)  |   2.71e+09   3.08e+09    19.11   0.000     2.92e+08    2.51e+10
Obese I ..)  |   3.62e+08   5.19e+08    13.75   0.000     2.18e+07    6.01e+09
Obese II..)  |   8.45e+08   1.06e+09    16.37   0.000     7.21e+07    9.91e+09
Obese II..)  |   6.08e+08   7.61e+08    16.16   0.000     5.24e+07    7.07e+09
    Unknown  |   4.10e+08   6.16e+08    13.20   0.000     2.16e+07    7.79e+09
             |
    hba1ccat |
  >=6.5-7.4  |   1.265859   1.055647     0.28   0.777     .2469088    6.489844
  >=7.5-7.9  |   7.91e-20          .        .       .            .           .
    >=8-8.9  |   2.722319   2.312362     1.18   0.238     .5151347    14.38657
        >=9  |   2.041411   2.275195     0.64   0.522     .2297466    18.13895
    Unknown  |   1.36e-18          .        .       .            .           .
             |
gp_consult~t |   1.220524   .1474032     1.65   0.099     .9632665    1.546487
             |
smoke_nomiss |
     Former  |   2.73e-19          .        .       .            .           .
    Current  |   .6518936   .7022918    -0.40   0.691     .0789166    5.384991
             |
1.hyperten~n |   1.73e-20          .        .       .            .           .
             |
      bp_cat |
High, sta..  |   2.46e+07   2.65e+07    15.81   0.000      2987245    2.03e+08
    Unknown  |   2.63e+07          .        .       .            .           .
             |
    1.asthma |   1.91e-19          .        .       .            .           .
1.~y_disease |   1.531532    1.07542     0.61   0.544     .3867447    6.064955
1.~c_disease |   .3464314   .3711002    -0.99   0.322     .0424427    2.827688
             |
     dm_type |
       T1DM  |   1.42e-19          .        .       .            .           .
       T2DM  |   .4004196   .4318074    -0.85   0.396     .0483716     3.31467
 UNKNOWN_DM  |   9.345659   10.84285     1.93   0.054     .9617107    90.81872
             |
    1.cancer |   2.09e-20          .        .       .            .           .
1.~r_disease |   .6415719   .5408828    -0.53   0.599     .1229228    3.348561
    1.stroke |   .3545182    .384763    -0.96   0.339     .0422493    2.974802
  1.dementia |   .7975906    .652488    -0.28   0.782     .1604849    3.963928
1.other_ne~o |    .450894   .4808215    -0.75   0.455     .0557668    3.645636
             |
      egfr60 |
   eGFR <60  |   2.48e-19          .        .       .            .           .
      1.esrf |   .3445873     .36803    -1.00   0.319     .0424805    2.795176
1.immunosu~d |   .3313356   .2712399    -1.35   0.177     .0665967     1.64848
1.ra_sle_p~s |   .7463297   .6066549    -0.36   0.719     .1517157    3.671393
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(31)      =       48.30
Log likelihood  =   -53.728723                  Prob > chi2      =      0.0246

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   2.90e+09          .        .       .            .           .
      Black  |   2.06e-10          .        .       .            .           .
      Mixed  |   5.45e+09   6.78e+09    18.02   0.000     4.75e+08    6.24e+10
      Other  |   4.98e+09   6.25e+09    17.80   0.000     4.26e+08    5.82e+10
    Unknown  |   1.00e+10   1.09e+10    21.10   0.000     1.18e+09    8.49e+10
             |
        male |
       Male  |   1.088756   .6501171     0.14   0.887     .3378017    3.509129
        age1 |   .9965097   .0880402    -0.04   0.968     .8380676    1.184906
        age2 |   .9378244   .2872773    -0.21   0.834     .5144922    1.709481
        age3 |   1.289728   1.018889     0.32   0.747     .2741871    6.066659
             |
         imd |
          4  |   2.041579   1.378079     1.06   0.290     .5437504    7.665364
5 most de..  |   1.285963   1.427673     0.23   0.821     .1459577    11.33001
             |
   bmicat_sa |
Normal (..)  |   5.65e+08          .        .       .            .           .
Overweig..)  |   2.71e+09   3.08e+09    19.11   0.000     2.92e+08    2.51e+10
Obese I ..)  |   3.62e+08   5.19e+08    13.75   0.000     2.18e+07    6.01e+09
Obese II..)  |   8.45e+08   1.06e+09    16.37   0.000     7.21e+07    9.91e+09
Obese II..)  |   6.08e+08   7.61e+08    16.16   0.000     5.24e+07    7.07e+09
    Unknown  |   4.10e+08   6.16e+08    13.20   0.000     2.16e+07    7.79e+09
             |
    hba1ccat |
  >=6.5-7.4  |   1.265859   1.055647     0.28   0.777     .2469088    6.489844
  >=7.5-7.9  |   7.91e-20          .        .       .            .           .
    >=8-8.9  |   2.722319   2.312362     1.18   0.238     .5151347    14.38657
        >=9  |   2.041411   2.275195     0.64   0.522     .2297466    18.13895
    Unknown  |   1.36e-18          .        .       .            .           .
             |
gp_consult~t |   1.220524   .1474032     1.65   0.099     .9632665    1.546487
             |
smoke_nomiss |
     Former  |   2.73e-19          .        .       .            .           .
    Current  |   .6518936   .7022918    -0.40   0.691     .0789166    5.384991
             |
1.hyperten~n |   1.73e-20          .        .       .            .           .
             |
      bp_cat |
High, sta..  |   2.46e+07   2.65e+07    15.81   0.000      2987245    2.03e+08
    Unknown  |   2.63e+07          .        .       .            .           .
             |
    1.asthma |   1.91e-19          .        .       .            .           .
1.~y_disease |   1.531532    1.07542     0.61   0.544     .3867447    6.064955
1.~c_disease |   .3464314   .3711002    -0.99   0.322     .0424427    2.827688
             |
     dm_type |
       T1DM  |   1.42e-19          .        .       .            .           .
       T2DM  |   .4004196   .4318074    -0.85   0.396     .0483716     3.31467
 UNKNOWN_DM  |   9.345659   10.84285     1.93   0.054     .9617107    90.81872
             |
    1.cancer |   2.09e-20          .        .       .            .           .
1.~r_disease |   .6415719   .5408828    -0.53   0.599     .1229228    3.348561
    1.stroke |   .3545182    .384763    -0.96   0.339     .0422493    2.974802
  1.dementia |   .7975906    .652488    -0.28   0.782     .1604849    3.963928
1.other_ne~o |    .450894   .4808215    -0.75   0.455     .0557668    3.645636
             |
      egfr60 |
   eGFR <60  |   2.48e-19          .        .       .            .           .
      1.esrf |   .3445873     .36803    -1.00   0.319     .0424805    2.795176
1.immunosu~d |   .3313356   .2712399    -1.35   0.177     .0665967     1.64848
1.ra_sle_p~s |   .7463297   .6066549    -0.36   0.719     .1517157    3.671393
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_ons_noncoviddeath_eth5.ster not found)
file ./output/model/model2_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/model2_ons_noncoviddeath_eth5.dta not found)
file ./output/model/model2_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           12
Time at risk    =      1858983
                                                LR chi2(42)      =       49.24
Log likelihood  =   -53.258032                  Prob > chi2      =      0.2060

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   2.92e+09          .        .       .            .           .
      Black  |   6.18e-07   39.30575    -0.00   1.000            0           .
      Mixed  |   5.43e+09   6.77e+09    18.00   0.000     4.73e+08    6.24e+10
      Other  |   5.01e+09   6.30e+09    17.76   0.000     4.26e+08    5.90e+10
    Unknown  |   1.05e+10   1.14e+10    21.15   0.000     1.24e+09    8.90e+10
             |
        male |
       Male  |   1.021247    .611004     0.04   0.972     .3161286    3.299119
        age1 |   .9907265   .0862649    -0.11   0.915     .8352907    1.175087
        age2 |   .9442395   .2852257    -0.19   0.849     .5223485    1.706884
        age3 |     1.2768    .995973     0.31   0.754     .2767834    5.889874
             |
         imd |
          4  |   1.957422   1.323274     0.99   0.320     .5202925    7.364132
5 most de..  |   1.241666   1.377138     0.20   0.845     .1412319    10.91633
             |
   bmicat_sa |
Normal (..)  |   5.73e+08          .        .       .            .           .
Overweig..)  |   2.91e+09   3.31e+09    19.15   0.000     3.13e+08    2.71e+10
Obese I ..)  |   3.76e+08   5.39e+08    13.76   0.000     2.26e+07    6.26e+09
Obese II..)  |   8.63e+08   1.08e+09    16.39   0.000     7.37e+07    1.01e+10
Obese II..)  |   6.11e+08   7.65e+08    16.14   0.000     5.23e+07    7.12e+09
    Unknown  |   3.95e+08   5.97e+08    13.08   0.000     2.03e+07    7.66e+09
             |
    hba1ccat |
  >=6.5-7.4  |   1.226219   1.021801     0.24   0.807     .2394786    6.278696
  >=7.5-7.9  |   2.36e-16   1.69e-08    -0.00   1.000            0           .
    >=8-8.9  |   2.639536   2.248222     1.14   0.254     .4971846    14.01321
        >=9  |    1.96021   2.195344     0.60   0.548     .2182711     17.6039
    Unknown  |   6.97e-17   3.46e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.240248   .1545275     1.73   0.084     .9715249      1.5833
             |
smoke_nomiss |
     Former  |   2.89e-16   3.35e-08    -0.00   1.000            0           .
    Current  |   .6218961   .6715477    -0.44   0.660      .074913     5.16272
             |
1.hyperten~n |   1.38e-16   6.51e-09    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   2.38e+07   2.57e+07    15.74   0.000      2871109    1.97e+08
    Unknown  |   2.43e+07          .        .       .            .           .
             |
    1.asthma |   2.16e-16   2.26e-08    -0.00   1.000            0           .
1.~y_disease |   1.489985   1.045924     0.57   0.570     .3764126     5.89793
1.~c_disease |   .3364988   .3622335    -1.01   0.312     .0408022    2.775129
             |
     dm_type |
       T1DM  |   1.84e-16   2.89e-08    -0.00   1.000            0           .
       T2DM  |   .3969368   .4283126    -0.86   0.392     .0478891    3.290076
 UNKNOWN_DM  |   9.495919   11.02019     1.94   0.052     .9765661    92.33628
             |
    1.cancer |   1.61e-16   6.54e-09    -0.00   1.000            0           .
1.~r_disease |   .6231415   .5292939    -0.56   0.578     .1179179    3.293016
    1.stroke |   .3486106    .379302    -0.97   0.333     .0413238    2.940906
  1.dementia |   .7869615   .6443365    -0.29   0.770     .1581319    3.916404
1.other_ne~o |   .4481903   .4781602    -0.75   0.452     .0553786    3.627295
             |
      egfr60 |
   eGFR <60  |   1.02e-16   2.58e-08    -0.00   1.000            0           .
      1.esrf |   .3499972    .374173    -0.98   0.326     .0430593    2.844869
1.immunosu~d |   .3192668   .2623889    -1.39   0.165     .0637669    1.598499
1.ra_sle_p~s |   .7265813   .5923999    -0.39   0.695     .1469868    3.591618
             |
hh_total_cat |
       6-10  |   6.62e+15   6.34e+23     0.00   1.000            0           .
        11+  |   .7586866   5.61e+08    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_ons_noncoviddeath_eth5.ster not found)
file ./output/model/model3_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/model3_ons_noncoviddeath_eth5.dta not found)
file ./output/model/model3_ons_noncoviddeath_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
onsdeath
(1,191 observations deleted)

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(4)       =        8.78
Log likelihood  =   -99.556698                  Prob > chi2      =      0.0668

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.876224   2.298984     0.51   0.608     .1699364    20.71492
      Black  |   5.07e-20          .        .       .            .           .
      Mixed  |   2.805415   3.243166     0.89   0.372     .2910554    27.04073
      Other  |   1.940707   2.378291     0.54   0.588     .1757247    21.43321
    Unknown  |   4.417592   4.688167     1.40   0.162      .551885    35.36085
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_onsdeath_eth5.ster not found)
file ./output/model/crude_onsdeath_eth5.ster saved
(note: file ./output/model/crude_onsdeath_eth5.dta not found)
file ./output/model/crude_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(9)       =        9.40
Log likelihood  =   -99.248394                  Prob > chi2      =      0.4012

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.911294   2.342672     0.53   0.597     .1729856    21.11762
      Black  |   1.53e-16   1.21e-08    -0.00   1.000            0           .
      Mixed  |   2.814358   3.253718     0.90   0.371     .2919401    27.13096
      Other  |   1.974187   2.420082     0.55   0.579     .1786207    21.81949
    Unknown  |   4.454049   4.727104     1.41   0.159     .5563789    35.65655
             |
        male |
       Male  |   .9851014   .4935463    -0.03   0.976     .3689945    2.629916
        age1 |   1.040977   .0780422     0.54   0.592     .8987243    1.205746
        age2 |    .865934   .2225109    -0.56   0.575     .5233106    1.432881
        age3 |   1.479741   .9826187     0.59   0.555     .4026681    5.437812
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_onsdeath_eth5.ster not found)
file ./output/model/model0_onsdeath_eth5.ster saved
(note: file ./output/model/model0_onsdeath_eth5.dta not found)
file ./output/model/model0_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(11)      =        9.70
Log likelihood  =   -99.100288                  Prob > chi2      =      0.5579

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.891574   2.318806     0.52   0.603      .171147    20.90632
      Black  |   1.13e-15   3.31e-08    -0.00   1.000            0           .
      Mixed  |   2.822952   3.263981     0.90   0.369      .292765    27.21999
      Other  |   1.942398   2.381972     0.54   0.588     .1755923    21.48676
    Unknown  |   4.410169   4.681189     1.40   0.162     .5507371    35.31556
             |
        male |
       Male  |    .989732   .4960125    -0.02   0.984     .3706217    2.643044
        age1 |   1.040459   .0780636     0.53   0.597     .8981747    1.205282
        age2 |   .8668295   .2228242    -0.56   0.578     .5237533    1.434632
        age3 |   1.476429   .9803908     0.59   0.557     .4017823    5.425435
             |
         imd |
          4  |   1.308447   .7752468     0.45   0.650     .4096606    4.179149
5 most de..  |   1.370862   1.064531     0.41   0.685     .2992266    6.280394
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(11)      =        9.70
Log likelihood  =   -99.100288                  Prob > chi2      =      0.5579

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.891574   2.318806     0.52   0.603      .171147    20.90632
      Black  |   1.13e-15   3.31e-08    -0.00   1.000            0           .
      Mixed  |   2.822952   3.263981     0.90   0.369      .292765    27.21999
      Other  |   1.942398   2.381972     0.54   0.588     .1755923    21.48676
    Unknown  |   4.410169   4.681189     1.40   0.162     .5507371    35.31556
             |
        male |
       Male  |    .989732   .4960125    -0.02   0.984     .3706217    2.643044
        age1 |   1.040459   .0780636     0.53   0.597     .8981747    1.205282
        age2 |   .8668295   .2228242    -0.56   0.578     .5237533    1.434632
        age3 |   1.476429   .9803908     0.59   0.557     .4017823    5.425435
             |
         imd |
          4  |   1.308447   .7752468     0.45   0.650     .4096606    4.179149
5 most de..  |   1.370862   1.064531     0.41   0.685     .2992266    6.280394
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_onsdeath_eth5.ster not found)
file ./output/model/model1_onsdeath_eth5.ster saved
(note: file ./output/model/model1_onsdeath_eth5.dta not found)
file ./output/model/model1_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(42)      =       45.42
Log likelihood  =   -81.239183                  Prob > chi2      =      0.3316

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.665583   2.054234     0.41   0.679     .1485057    18.68054
      Black  |   3.94e-17   5.27e-09    -0.00   1.000            0           .
      Mixed  |   2.534118   2.950157     0.80   0.424     .2587494    24.81843
      Other  |   1.327443   1.679091     0.22   0.823     .1112564    15.83822
    Unknown  |   3.797303   4.066843     1.25   0.213     .4654294    30.98109
             |
        male |
       Male  |   1.001925   .5184581     0.00   0.997     .3633885    2.762483
        age1 |   1.031038   .0802585     0.39   0.695     .8851467    1.200976
        age2 |   .8992852    .238858    -0.40   0.689     .5343315    1.513506
        age3 |   1.339795   .9155579     0.43   0.669     .3510461    5.113434
             |
         imd |
          4  |     1.3229   .8054591     0.46   0.646     .4011118    4.363033
5 most de..  |   1.658571   1.343768     0.62   0.532     .3389172    8.116608
             |
   bmicat_sa |
Normal (..)  |   .2032594   .2963387    -1.09   0.274     .0116696    3.540349
Overweig..)  |   .8811941   .9988828    -0.11   0.911     .0955404    8.127484
Obese I ..)  |   .1287199   .1859592    -1.42   0.156     .0075846    2.184542
Obese II..)  |   .4177647   .4973075    -0.73   0.463     .0405192    4.307277
Obese II..)  |   .3525987   .4163642    -0.88   0.377     .0348453    3.567937
    Unknown  |   .2886301   .3641198    -0.98   0.325     .0243508    3.421137
             |
    hba1ccat |
  >=6.5-7.4  |   .8038157   .6395823    -0.27   0.784     .1689935    3.823339
  >=7.5-7.9  |   2.489034   2.061849     1.10   0.271     .4908156    12.62244
    >=8-8.9  |    2.46485   1.996661     1.11   0.265     .5038155    12.05895
        >=9  |   2.124863   2.309181     0.69   0.488     .2525185    17.88005
    Unknown  |   3.28e-17   2.05e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.127396   .1201461     1.13   0.261     .9148803    1.389276
             |
smoke_nomiss |
     Former  |   3.188675   3.470201     1.07   0.287     .3777955     26.9131
    Current  |   .9958469   .7855221    -0.01   0.996     .2122103    4.673247
             |
1.hyperten~n |   2.10e-17   2.23e-09    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |    9841043    7676440    20.64   0.000      2133374    4.54e+07
    Unknown  |   1.43e+07          .        .       .            .           .
             |
    1.asthma |   2.327701   2.476181     0.79   0.427     .2893537    18.72515
1.~y_disease |   1.321863   .7910068     0.47   0.641     .4090959    4.271181
1.~c_disease |   .5539413   .4267587    -0.77   0.443     .1223755    2.507454
             |
     dm_type |
       T1DM  |   2.06e-17   6.50e-09    -0.00   1.000            0           .
       T2DM  |   .5761144   .4469494    -0.71   0.477     .1259351    2.635546
 UNKNOWN_DM  |   4.693496   5.255874     1.38   0.167     .5227614    42.13951
             |
    1.cancer |   2.54e-17   2.33e-09    -0.00   1.000            0           .
1.~r_disease |   1.440408   .8604888     0.61   0.541     .4466675    4.645012
    1.stroke |   .5567156   .4356112    -0.75   0.454     .1201149    2.580298
  1.dementia |   .8835537   .5837344    -0.19   0.851     .2420319    3.225472
1.other_ne~o |   .2765055   .2878213    -1.23   0.217     .0359474    2.126867
             |
      egfr60 |
   eGFR <60  |   1.99e-17   9.16e-09    -0.00   1.000            0           .
      1.esrf |   1.408623   .8404397     0.57   0.566     .4374562    4.535811
1.immunosu~d |   .2604263   .2005243    -1.75   0.081     .0575802    1.177869
1.ra_sle_p~s |   .9379325   .6165447    -0.10   0.922     .2586063    3.401764
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(42)      =       45.42
Log likelihood  =   -81.239183                  Prob > chi2      =      0.3316

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.665583   2.054234     0.41   0.679     .1485057    18.68054
      Black  |   3.94e-17   5.27e-09    -0.00   1.000            0           .
      Mixed  |   2.534118   2.950157     0.80   0.424     .2587494    24.81843
      Other  |   1.327443   1.679091     0.22   0.823     .1112564    15.83822
    Unknown  |   3.797303   4.066843     1.25   0.213     .4654294    30.98109
             |
        male |
       Male  |   1.001925   .5184581     0.00   0.997     .3633885    2.762483
        age1 |   1.031038   .0802585     0.39   0.695     .8851467    1.200976
        age2 |   .8992852    .238858    -0.40   0.689     .5343315    1.513506
        age3 |   1.339795   .9155579     0.43   0.669     .3510461    5.113434
             |
         imd |
          4  |     1.3229   .8054591     0.46   0.646     .4011118    4.363033
5 most de..  |   1.658571   1.343768     0.62   0.532     .3389172    8.116608
             |
   bmicat_sa |
Normal (..)  |   .2032594   .2963387    -1.09   0.274     .0116696    3.540349
Overweig..)  |   .8811941   .9988828    -0.11   0.911     .0955404    8.127484
Obese I ..)  |   .1287199   .1859592    -1.42   0.156     .0075846    2.184542
Obese II..)  |   .4177647   .4973075    -0.73   0.463     .0405192    4.307277
Obese II..)  |   .3525987   .4163642    -0.88   0.377     .0348453    3.567937
    Unknown  |   .2886301   .3641198    -0.98   0.325     .0243508    3.421137
             |
    hba1ccat |
  >=6.5-7.4  |   .8038157   .6395823    -0.27   0.784     .1689935    3.823339
  >=7.5-7.9  |   2.489034   2.061849     1.10   0.271     .4908156    12.62244
    >=8-8.9  |    2.46485   1.996661     1.11   0.265     .5038155    12.05895
        >=9  |   2.124863   2.309181     0.69   0.488     .2525185    17.88005
    Unknown  |   3.28e-17   2.05e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.127396   .1201461     1.13   0.261     .9148803    1.389276
             |
smoke_nomiss |
     Former  |   3.188675   3.470201     1.07   0.287     .3777955     26.9131
    Current  |   .9958469   .7855221    -0.01   0.996     .2122103    4.673247
             |
1.hyperten~n |   2.10e-17   2.23e-09    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |    9841043    7676440    20.64   0.000      2133374    4.54e+07
    Unknown  |   1.43e+07          .        .       .            .           .
             |
    1.asthma |   2.327701   2.476181     0.79   0.427     .2893537    18.72515
1.~y_disease |   1.321863   .7910068     0.47   0.641     .4090959    4.271181
1.~c_disease |   .5539413   .4267587    -0.77   0.443     .1223755    2.507454
             |
     dm_type |
       T1DM  |   2.06e-17   6.50e-09    -0.00   1.000            0           .
       T2DM  |   .5761144   .4469494    -0.71   0.477     .1259351    2.635546
 UNKNOWN_DM  |   4.693496   5.255874     1.38   0.167     .5227614    42.13951
             |
    1.cancer |   2.54e-17   2.33e-09    -0.00   1.000            0           .
1.~r_disease |   1.440408   .8604888     0.61   0.541     .4466675    4.645012
    1.stroke |   .5567156   .4356112    -0.75   0.454     .1201149    2.580298
  1.dementia |   .8835537   .5837344    -0.19   0.851     .2420319    3.225472
1.other_ne~o |   .2765055   .2878213    -1.23   0.217     .0359474    2.126867
             |
      egfr60 |
   eGFR <60  |   1.99e-17   9.16e-09    -0.00   1.000            0           .
      1.esrf |   1.408623   .8404397     0.57   0.566     .4374562    4.535811
1.immunosu~d |   .2604263   .2005243    -1.75   0.081     .0575802    1.177869
1.ra_sle_p~s |   .9379325   .6165447    -0.10   0.922     .2586063    3.401764
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_onsdeath_eth5.ster not found)
file ./output/model/model2_onsdeath_eth5.ster saved
(note: file ./output/model/model2_onsdeath_eth5.dta not found)
file ./output/model/model2_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,593                  Number of obs    =       6,593
No. of failures =           16
Time at risk    =      1858983
                                                LR chi2(37)      =       46.38
Log likelihood  =   -80.760366                  Prob > chi2      =      0.1388

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.665975   2.055081     0.41   0.679     .1484773    18.69292
      Black  |   3.56e-20          .        .       .            .           .
      Mixed  |   2.543434   2.960005     0.80   0.422     .2599001    24.89054
      Other  |   1.336925   1.692262     0.23   0.819     .1118583    15.97888
    Unknown  |   3.862771   4.138816     1.26   0.207     .4730074    31.54496
             |
        male |
       Male  |   .9850213   .5107057    -0.03   0.977      .356551    2.721257
        age1 |    1.03177    .079895     0.40   0.686     .8864826    1.200869
        age2 |   .8967569   .2368079    -0.41   0.680     .5344371     1.50471
        age3 |   1.347598   .9159489     0.44   0.661     .3556373    5.106385
             |
         imd |
          4  |   1.290822   .7869453     0.42   0.675     .3907814    4.263817
5 most de..  |   1.602313   1.297921     0.58   0.561     .3275287    7.838727
             |
   bmicat_sa |
Normal (..)  |   .2134916   .3115502    -1.06   0.290      .012224    3.728611
Overweig..)  |   .9192757   1.041856    -0.07   0.941     .0997105    8.475211
Obese I ..)  |   .1330031   .1922785    -1.40   0.163     .0078218    2.261609
Obese II..)  |   .4293501   .5111841    -0.71   0.478     .0416266    4.428451
Obese II..)  |   .3623275   .4279888    -0.86   0.390     .0357803     3.66909
    Unknown  |   .2950469   .3726591    -0.97   0.334     .0248188    3.507531
             |
    hba1ccat |
  >=6.5-7.4  |   .8147791   .6486586    -0.26   0.797     .1711531    3.878778
  >=7.5-7.9  |   2.571554   2.135369     1.14   0.255     .5050962    13.09233
    >=8-8.9  |   2.423706   1.966395     1.09   0.275     .4941803    11.88706
        >=9  |    2.15762   2.348071     0.71   0.480      .255646    18.21005
    Unknown  |   5.84e-19          .        .       .            .           .
             |
gp_consult~t |   1.129141   .1212228     1.13   0.258     .9148812     1.39358
             |
smoke_nomiss |
     Former  |   3.116362   3.390195     1.04   0.296     .3695316    26.28114
    Current  |   1.001111   .7909006     0.00   0.999     .2128208     4.70924
             |
1.hyperten~n |   1.88e-20          .        .       .            .           .
             |
      bp_cat |
High, sta..  |   1.03e+07    8051698    20.69   0.000      2233965    4.76e+07
    Unknown  |   1.49e+07          .        .       .            .           .
             |
    1.asthma |   2.440011   2.600996     0.84   0.403     .3020164    19.71301
1.~y_disease |   1.297616   .7747906     0.44   0.663     .4026284     4.18204
1.~c_disease |   .5449747   .4205838    -0.79   0.432     .1200777    2.473378
             |
     dm_type |
       T1DM  |   1.40e-19          .        .       .            .           .
       T2DM  |   .5733969   .4453097    -0.72   0.474     .1251405    2.627319
 UNKNOWN_DM  |   4.586182   5.157676     1.35   0.176     .5060341    41.56452
             |
    1.cancer |   2.23e-20   6.81e-11    -0.00   1.000            0           .
1.~r_disease |   1.429789   .8569004     0.60   0.551     .4417029    4.628216
    1.stroke |   .5570592   .4362654    -0.75   0.455     .1200262    2.585394
  1.dementia |   .8913694   .5889244    -0.17   0.862     .2441586    3.254193
1.other_ne~o |   .2755445   .2869796    -1.24   0.216      .035782    2.121868
             |
      egfr60 |
   eGFR <60  |   3.52e-19          .        .       .            .           .
      1.esrf |   1.418011   .8458138     0.59   0.558     .4405101    4.564608
1.immunosu~d |   .2562191   .1973743    -1.77   0.077     .0566111    1.159635
1.ra_sle_p~s |   .9557934   .6281175    -0.07   0.945     .2636216    3.465349
             |
hh_total_cat |
       6-10  |   1.85e+16          .        .       .            .           .
        11+  |   .0108577          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_onsdeath_eth5.ster not found)
file ./output/model/model3_onsdeath_eth5.ster saved
(note: file ./output/model/model3_onsdeath_eth5.dta not found)
file ./output/model/model3_onsdeath_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)

. 
. file close tablecontent

. 
. ************************************************create forestplot dataset
. dsconcat `hr'

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. split idstr, p(_)
variables created as string: 
idstr1  idstr2  idstr3  idstr4

. ren idstr1 model

. ren idstr2 outcome

. drop idstr idstr3

. tab model

      model |      Freq.     Percent        Cum.
------------+-----------------------------------
      crude |         42        3.70        3.70
     model0 |         77        6.79       10.49
     model1 |         98        8.64       19.14
     model2 |        448       39.51       58.64
     model3 |        469       41.36      100.00
------------+-----------------------------------
      Total |      1,134      100.00

. 
. *save dataset for later
. outsheet using ./output/FP_multivariable_eth5.txt, replace
(note: file ./output/FP_multivariable_eth5.txt not found)

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/04b_eth_an_multivariable_eth5.log
  log type:  text
 closed on:   6 Jan 2021, 12:23:46
-------------------------------------------------------------------------------
