-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04b_eth_an_multivariable_eth5.log
  log type:  text
 opened on:   9 Jan 2021, 17:19:13

. cap file close tablecontent

. file open tablecontent using ./output/table2_eth5.txt, write text replace
(note: file ./output/table2_eth5.txt not found)

. 
. file write tablecontent ("Table 2: Association between ethnicity in 5 categor
> ies and COVID-19 outcomes - No care homes") _n

. file write tablecontent _tab ("Denominator") _tab ("Event") _tab ("Total pers
> on-weeks") _tab ("Rate per 1,000") _tab ("Crude") _tab _tab ("Age/Sex Adjuste
> d") _tab _tab ("Age/Sex/IMD Adjusted") _tab _tab      ("plus co-morbidities")
>  _tab _tab       ("plus hh size")  _tab _tab  _n

. file write tablecontent _tab _tab _tab _tab _tab   ("HR") _tab ("95% CI") _ta
> b ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% C
> I") _tab ("HR") _tab ("95% CI") _tab _tab _n

. 
. 
. 
. foreach i of global outcomes {
  2. use ./output/analysis_dataset_STSET_`i'.dta, clear
  3. drop if carehome==1
  4. safetab eth5 `i', missing row
  5. } //end outcomes
(11,899 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |    outcome tested
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     9,898         21 |     9,919 
            |     99.79       0.21 |    100.00 
------------+----------------------+----------
South Asian |    10,030         30 |    10,060 
            |     99.70       0.30 |    100.00 
------------+----------------------+----------
      Black |     9,977         19 |     9,996 
            |     99.81       0.19 |    100.00 
------------+----------------------+----------
      Mixed |    10,103         24 |    10,127 
            |     99.76       0.24 |    100.00 
------------+----------------------+----------
      Other |     9,992         19 |    10,011 
            |     99.81       0.19 |    100.00 
------------+----------------------+----------
    Unknown |    16,752         39 |    16,791 
            |     99.77       0.23 |    100.00 
------------+----------------------+----------
      Total |    66,752        152 |    66,904 
            |     99.77       0.23 |    100.00 
(11,899 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 | outcome positivetest
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     9,899         20 |     9,919 
            |     99.80       0.20 |    100.00 
------------+----------------------+----------
South Asian |    10,033         27 |    10,060 
            |     99.73       0.27 |    100.00 
------------+----------------------+----------
      Black |     9,975         21 |     9,996 
            |     99.79       0.21 |    100.00 
------------+----------------------+----------
      Mixed |    10,103         24 |    10,127 
            |     99.76       0.24 |    100.00 
------------+----------------------+----------
      Other |     9,994         17 |    10,011 
            |     99.83       0.17 |    100.00 
------------+----------------------+----------
    Unknown |    16,751         40 |    16,791 
            |     99.76       0.24 |    100.00 
------------+----------------------+----------
      Total |    66,755        149 |    66,904 
            |     99.78       0.22 |    100.00 
(11,899 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |      outcome hes
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     8,576      1,343 |     9,919 
            |     86.46      13.54 |    100.00 
------------+----------------------+----------
South Asian |     8,656      1,404 |    10,060 
            |     86.04      13.96 |    100.00 
------------+----------------------+----------
      Black |     8,670      1,326 |     9,996 
            |     86.73      13.27 |    100.00 
------------+----------------------+----------
      Mixed |     8,748      1,379 |    10,127 
            |     86.38      13.62 |    100.00 
------------+----------------------+----------
      Other |     8,672      1,339 |    10,011 
            |     86.62      13.38 |    100.00 
------------+----------------------+----------
    Unknown |    14,488      2,303 |    16,791 
            |     86.28      13.72 |    100.00 
------------+----------------------+----------
      Total |    57,810      9,094 |    66,904 
            |     86.41      13.59 |    100.00 
(11,899 observations deleted)

**TABLE OF eth5 onscoviddeath REDACTED DUE TO SMALL N**

(11,899 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

            |        outcome
      Eth 5 |   ons_noncoviddeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     9,907         12 |     9,919 
            |     99.88       0.12 |    100.00 
------------+----------------------+----------
South Asian |    10,045         15 |    10,060 
            |     99.85       0.15 |    100.00 
------------+----------------------+----------
      Black |     9,979         17 |     9,996 
            |     99.83       0.17 |    100.00 
------------+----------------------+----------
      Mixed |    10,110         17 |    10,127 
            |     99.83       0.17 |    100.00 
------------+----------------------+----------
      Other |     9,999         12 |    10,011 
            |     99.88       0.12 |    100.00 
------------+----------------------+----------
    Unknown |    16,763         28 |    16,791 
            |     99.83       0.17 |    100.00 
------------+----------------------+----------
      Total |    66,803        101 |    66,904 
            |     99.85       0.15 |    100.00 
(11,899 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |   outcome onsdeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     9,905         14 |     9,919 
            |     99.86       0.14 |    100.00 
------------+----------------------+----------
South Asian |    10,041         19 |    10,060 
            |     99.81       0.19 |    100.00 
------------+----------------------+----------
      Black |     9,972         24 |     9,996 
            |     99.76       0.24 |    100.00 
------------+----------------------+----------
      Mixed |    10,106         21 |    10,127 
            |     99.79       0.21 |    100.00 
------------+----------------------+----------
      Other |     9,997         14 |    10,011 
            |     99.86       0.14 |    100.00 
------------+----------------------+----------
    Unknown |    16,755         36 |    16,791 
            |     99.79       0.21 |    100.00 
------------+----------------------+----------
      Total |    66,776        128 |    66,904 
            |     99.81       0.19 |    100.00 

. 
. foreach i of global outcomes {
  2.         di "`i'"
  3.         
. * Open Stata dataset
. use ./output/analysis_dataset_STSET_`i'.dta, clear
  4. drop if carehome==1
  5. 
. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.eth5, strata(stp) nolog
  6. estimates save ./output/model/crude_`i'_eth5, replace 
  7. eststo model1
  8. parmest, label eform format(estimate p lb ub) saving(./output/model/crude_
> `i'_eth5, replace) idstr(crude_`i'_eth5) 
  9. local hr "`hr' ./output/model/crude_`i'_eth5 "
 10. 
. 
. /* Multivariable models */ 
. *Age and gender
. stcox i.eth5 i.male age1 age2 age3, strata(stp) nolog
 11. estimates save ./output/model/model0_`i'_eth5, replace 
 12. eststo model2
 13. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model0_`i
> '_eth5, replace) idstr(model0_`i'_eth5)
 14. local hr "`hr' ./output/model/model0_`i'_eth5 "
 15.  
. 
. * Age, Gender, IMD
. 
. stcox i.eth5 i.male age1 age2 age3 i.imd, strata(stp) nolog
 16. if _rc==0{
 17. estimates
 18. estimates save ./output/model/model1_`i'_eth5, replace 
 19. eststo model3
 20. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model1_`i
> '_eth5, replace) idstr(model1_`i'_eth5) 
 21. local hr "`hr' ./output/model/model1_`i'_eth5 "
 22. }
 23. else di "WARNING MODEL1 DID NOT FIT (OUTCOME `i')"
 24. 
. * Age, Gender, IMD and Comorbidities 
. stcox i.eth5 i.male age1 age2 age3      i.imd                                
>            ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis, strata(stp) nolog           
 25. if _rc==0{
 26. estimates
 27. estimates save ./output/model/model2_`i'_eth5, replace 
 28. eststo model4
 29. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model2_`i
> '_eth5, replace) idstr(model2_`i'_eth5) 
 30. local hr "`hr' ./output/model/model2_`i'_eth5 "
 31. }
 32. else di "WARNING MODEL2 DID NOT FIT (OUTCOME `i')"
 33. 
.                                                                              
>    
. * Age, Gender, IMD and Comorbidities  and household size 
. stcox i.eth5 i.male age1 age2 age3      i.imd                                
>            ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis                      ///
>                                                                              
>    i.hh_total_cat, strata(stp) nolog               
 34. estimates save ./output/model/model3_`i'_eth5, replace
 35. eststo model5
 36. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/model3_`i
> '_eth5, replace) idstr(model3_`i'_eth5) 
 37. local hr "`hr' ./output/model/model3_`i'_eth5 "
 38. 
. 
. 
. /* Estout================================================================*/ 
. esttab model1 model2 model3 model4 model5 using ./output/estout_table2_eth5.t
> xt, b(a2) ci(2) label wide compress eform ///
>         title ("`i'") ///
>         varlabels(`e(labels)') ///
>         stats(N_sub) ///
>         append 
 39. eststo clear
 40. 
.                                                                              
>    
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("`i'") _n
 41. 
. * eth5 labelled columns
. 
. local lab1: label eth5 1
 42. local lab2: label eth5 2
 43. local lab3: label eth5 3
 44. local lab4: label eth5 4
 45. local lab5: label eth5 5
 46. local lab6: label eth5 6
 47. 
. /* counts */
.  
. * First row, eth5 = 1 (White British) reference cat
.         qui safecount if eth5==1
 48.         local denominator = r(N)
 49.         qui safecount if eth5 == 1 & `i' == 1
 50.         local event = r(N)
 51.     bysort eth5: egen total_follow_up = total(_t)
 52.         qui su total_follow_up if eth5 == 1
 53.         local person_week = r(mean)/7
 54.         local rate = 1000*(`event'/`person_week')
 55.         
.         file write tablecontent  ("`lab1'") _tab (`denominator') _tab (`event
> ') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab
 56.         file write tablecontent ("1.00") _tab _tab ("1.00") _tab _tab ("1.
> 00")  _tab _tab ("1.00") _tab _tab ("1.00") _n
 57.         
. * Subsequent ethnic groups
. forvalues eth=2/6 {
 58.         qui safecount if eth5==`eth'
 59.         local denominator = r(N)
 60.         qui safecount if eth5 == `eth' & `i' == 1
 61.         local event = r(N)
 62.         qui su total_follow_up if eth5 == `eth'
 63.         local person_week = r(mean)/7
 64.         local rate = 1000*(`event'/`person_week')
 65.         file write tablecontent  ("`lab`eth''") _tab (`denominator') _tab 
> (`event') _tab %10.0f (`person_week') _tab %3.2f (`rate ') _tab  
 66.         cap estimates use ./output/model/crude_`i'_eth5 
 67.          cap lincom `eth'.eth5, eform
 68.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 69.         cap estimates clear
 70.         cap estimates use ./output/model/model0_`i'_eth5 
 71.          cap lincom `eth'.eth5, eform
 72.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 73.         cap estimates clear
 74.         cap estimates use ./output/model/model1_`i'_eth5 
 75.          cap lincom `eth'.eth5, eform
 76.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 77.         cap estimates clear
 78.         cap estimates use ./output/model/model2_`i'_eth5 
 79.          cap lincom `eth'.eth5, eform
 80.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 81.         cap estimates clear
 82.         cap estimates use ./output/model/model3_`i'_eth5 
 83.          cap lincom `eth'.eth5, eform
 84.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _n
 85. }  //end ethnic group
 86. 
. 
. } //end outcomes
tested
(11,899 observations deleted)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(5)       =        3.54
Log likelihood  =   -1336.6425                  Prob > chi2      =      0.6179

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.411753   .4017045     1.21   0.226     .8082679    2.465825
      Black  |   .8979824    .284345    -0.34   0.734     .4827652     1.67032
      Mixed  |   1.122703   .3354915     0.39   0.699     .6250359    2.016625
      Other  |   .8961674   .2837557    -0.35   0.729     .4818049    1.666891
    Unknown  |    1.09862   .2973705     0.35   0.728     .6463196    1.867444
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_tested_eth5.ster not found)
file ./output/model/crude_tested_eth5.ster saved
(note: file ./output/model/crude_tested_eth5.dta not found)
file ./output/model/crude_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(9)       =        9.59
Log likelihood  =   -1333.6161                  Prob > chi2      =      0.3848

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.410314   .4012959     1.21   0.227     .8074433    2.463314
      Black  |   .8950286   .2834132    -0.35   0.726     .4811734    1.664839
      Mixed  |   1.119292   .3344741     0.38   0.706     .6231347    2.010504
      Other  |   .8925119   .2826067    -0.36   0.719     .4798305    1.660122
    Unknown  |   1.096634   .2968383     0.34   0.733     .6451447    1.864086
             |
        male |
       Male  |   1.336806   .2184177     1.78   0.076     .9704929    1.841383
        age1 |   .9681321   .0210944    -1.49   0.137     .9276583    1.010372
        age2 |   1.145328   .0930416     1.67   0.095     .9767466    1.343006
        age3 |   .6931845   .1505783    -1.69   0.092     .4528402    1.061091
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_tested_eth5.ster not found)
file ./output/model/model0_tested_eth5.ster saved
(note: file ./output/model/model0_tested_eth5.dta not found)
file ./output/model/model0_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(11)      =        9.76
Log likelihood  =   -1333.5299                  Prob > chi2      =      0.5520

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.411472   .4016343     1.21   0.226     .8080962    2.465368
      Black  |   .8953261    .283509    -0.35   0.727     .4813317    1.665398
      Mixed  |   1.119374   .3344998     0.38   0.706      .623179    2.010656
      Other  |   .8926181   .2826431    -0.36   0.720     .4798847     1.66033
    Unknown  |   1.096991   .2969378     0.34   0.732     .6453514    1.864703
             |
        male |
       Male  |   1.336738   .2184085     1.78   0.076     .9704407    1.841295
        age1 |   .9681261   .0210956    -1.49   0.137       .92765    1.010368
        age2 |   1.145364    .093051     1.67   0.095     .9767663    1.343063
        age3 |   .6931294   .1505774    -1.69   0.092       .45279     1.06104
             |
         imd |
          4  |   .9592196   .1979942    -0.20   0.840      .640059    1.437527
5 most de..  |   .8962821   .2546115    -0.39   0.700     .5136171    1.564047
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(11)      =        9.76
Log likelihood  =   -1333.5299                  Prob > chi2      =      0.5520

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.411472   .4016343     1.21   0.226     .8080962    2.465368
      Black  |   .8953261    .283509    -0.35   0.727     .4813317    1.665398
      Mixed  |   1.119374   .3344998     0.38   0.706      .623179    2.010656
      Other  |   .8926181   .2826431    -0.36   0.720     .4798847     1.66033
    Unknown  |   1.096991   .2969378     0.34   0.732     .6453514    1.864703
             |
        male |
       Male  |   1.336738   .2184085     1.78   0.076     .9704407    1.841295
        age1 |   .9681261   .0210956    -1.49   0.137       .92765    1.010368
        age2 |   1.145364    .093051     1.67   0.095     .9767663    1.343063
        age3 |   .6931294   .1505774    -1.69   0.092       .45279     1.06104
             |
         imd |
          4  |   .9592196   .1979942    -0.20   0.840      .640059    1.437527
5 most de..  |   .8962821   .2546115    -0.39   0.700     .5136171    1.564047
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_tested_eth5.ster not found)
file ./output/model/model1_tested_eth5.ster saved
(note: file ./output/model/model1_tested_eth5.dta not found)
file ./output/model/model1_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(43)      =       36.61
Log likelihood  =   -1320.1041                  Prob > chi2      =      0.7432

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.438401   .4104871     1.27   0.203      .822179    2.516481
      Black  |   .8941718    .283242    -0.35   0.724     .4806074     1.66361
      Mixed  |   1.122395   .3355166     0.39   0.699     .6247367    2.016484
      Other  |   .8865423   .2808077    -0.38   0.704     .4765251    1.649351
    Unknown  |   1.095823   .2967044     0.34   0.735     .6445689    1.862993
             |
        male |
       Male  |   1.346996   .2218322     1.81   0.070     .9754047    1.860149
        age1 |   .9723066   .0218826    -1.25   0.212     .9303497    1.016156
        age2 |   1.131588   .0935526     1.50   0.135     .9623124    1.330639
        age3 |   .7129917   .1569947    -1.54   0.124     .4630812    1.097771
             |
         imd |
          4  |   .9594766    .198111    -0.20   0.841     .6401472      1.4381
5 most de..  |    .894224   .2541169    -0.39   0.694     .5123366    1.560764
             |
   bmicat_sa |
Normal (..)  |   1.773946   1.341489     0.76   0.448     .4029463     7.80969
Overweig..)  |   1.538574   1.147052     0.58   0.563     .3568803    6.633066
Obese I ..)  |    2.12557   1.548215     1.04   0.301     .5098946     8.86075
Obese II..)  |   1.613177   1.185712     0.65   0.515     .3819747    6.812858
Obese II..)  |   1.379943   1.009285     0.44   0.660     .3290756     5.78664
    Unknown  |    1.90935   1.399431     0.88   0.378     .4539514    8.030854
             |
    hba1ccat |
  >=6.5-7.4  |   .9514556   .2144331    -0.22   0.825     .6117163    1.479882
  >=7.5-7.9  |   .9345969   .3264304    -0.19   0.846     .4713264     1.85322
    >=8-8.9  |   1.563628   .4028351     1.74   0.083      .943712     2.59076
        >=9  |   1.060524   .4158683     0.15   0.881     .4917394    2.287211
    Unknown  |   4.65e-15   8.74e-08    -0.00   1.000            0           .
             |
gp_consult~t |   .9235386    .034341    -2.14   0.032     .8586257    .9933591
             |
smoke_nomiss |
     Former  |   .9941681   .5806635    -0.01   0.992     .3164454    3.123352
    Current  |   .9188757   .2369611    -0.33   0.743     .5543034    1.523232
             |
1.hyperten~n |   .9424412   .1946077    -0.29   0.774     .6287629    1.412608
             |
      bp_cat |
High, sta..  |   1.49e-07   4.889252    -0.00   1.000            0           .
High, sta..  |   3.33e+07    8806873    65.50   0.000     1.98e+07    5.59e+07
    Unknown  |   3.56e+07          .        .       .            .           .
             |
    1.asthma |   1.143337   .4426136     0.35   0.729     .5353697    2.441716
1.~y_disease |   1.157711    .225488     0.75   0.452      .790335    1.695857
1.~c_disease |   .7532064   .1676153    -1.27   0.203     .4869578    1.165029
             |
     dm_type |
       T1DM  |   .6719323    .393143    -0.68   0.497     .2134486    2.115231
       T2DM  |   1.174003   .2272161     0.83   0.407     .8033928    1.715578
 UNKNOWN_DM  |   .3245835   .3260524    -1.12   0.263     .0453182    2.324771
             |
    1.cancer |   1.021795   .2057865     0.11   0.915     .6885483    1.516329
1.~r_disease |   1.215197   .2342652     1.01   0.312     .8328227    1.773132
    1.stroke |   .9052297   .1894693    -0.48   0.634     .6006173    1.364331
  1.dementia |   .9961433    .203086    -0.02   0.985     .6680137    1.485451
1.other_ne~o |   1.256803   .2398614     1.20   0.231     .8645998     1.82692
             |
      egfr60 |
   eGFR <60  |   1.243555   .9047428     0.30   0.764     .2987977    5.175506
      1.esrf |   .7585821   .1687984    -1.24   0.214     .4904499    1.173304
1.immunosu~d |   1.308836   .2151463     1.64   0.102     .9483413    1.806365
1.ra_sle_p~s |   .8978701   .1879437    -0.51   0.607      .595715    1.353282
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(43)      =       36.61
Log likelihood  =   -1320.1041                  Prob > chi2      =      0.7432

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.438401   .4104871     1.27   0.203      .822179    2.516481
      Black  |   .8941718    .283242    -0.35   0.724     .4806074     1.66361
      Mixed  |   1.122395   .3355166     0.39   0.699     .6247367    2.016484
      Other  |   .8865423   .2808077    -0.38   0.704     .4765251    1.649351
    Unknown  |   1.095823   .2967044     0.34   0.735     .6445689    1.862993
             |
        male |
       Male  |   1.346996   .2218322     1.81   0.070     .9754047    1.860149
        age1 |   .9723066   .0218826    -1.25   0.212     .9303497    1.016156
        age2 |   1.131588   .0935526     1.50   0.135     .9623124    1.330639
        age3 |   .7129917   .1569947    -1.54   0.124     .4630812    1.097771
             |
         imd |
          4  |   .9594766    .198111    -0.20   0.841     .6401472      1.4381
5 most de..  |    .894224   .2541169    -0.39   0.694     .5123366    1.560764
             |
   bmicat_sa |
Normal (..)  |   1.773946   1.341489     0.76   0.448     .4029463     7.80969
Overweig..)  |   1.538574   1.147052     0.58   0.563     .3568803    6.633066
Obese I ..)  |    2.12557   1.548215     1.04   0.301     .5098946     8.86075
Obese II..)  |   1.613177   1.185712     0.65   0.515     .3819747    6.812858
Obese II..)  |   1.379943   1.009285     0.44   0.660     .3290756     5.78664
    Unknown  |    1.90935   1.399431     0.88   0.378     .4539514    8.030854
             |
    hba1ccat |
  >=6.5-7.4  |   .9514556   .2144331    -0.22   0.825     .6117163    1.479882
  >=7.5-7.9  |   .9345969   .3264304    -0.19   0.846     .4713264     1.85322
    >=8-8.9  |   1.563628   .4028351     1.74   0.083      .943712     2.59076
        >=9  |   1.060524   .4158683     0.15   0.881     .4917394    2.287211
    Unknown  |   4.65e-15   8.74e-08    -0.00   1.000            0           .
             |
gp_consult~t |   .9235386    .034341    -2.14   0.032     .8586257    .9933591
             |
smoke_nomiss |
     Former  |   .9941681   .5806635    -0.01   0.992     .3164454    3.123352
    Current  |   .9188757   .2369611    -0.33   0.743     .5543034    1.523232
             |
1.hyperten~n |   .9424412   .1946077    -0.29   0.774     .6287629    1.412608
             |
      bp_cat |
High, sta..  |   1.49e-07   4.889252    -0.00   1.000            0           .
High, sta..  |   3.33e+07    8806873    65.50   0.000     1.98e+07    5.59e+07
    Unknown  |   3.56e+07          .        .       .            .           .
             |
    1.asthma |   1.143337   .4426136     0.35   0.729     .5353697    2.441716
1.~y_disease |   1.157711    .225488     0.75   0.452      .790335    1.695857
1.~c_disease |   .7532064   .1676153    -1.27   0.203     .4869578    1.165029
             |
     dm_type |
       T1DM  |   .6719323    .393143    -0.68   0.497     .2134486    2.115231
       T2DM  |   1.174003   .2272161     0.83   0.407     .8033928    1.715578
 UNKNOWN_DM  |   .3245835   .3260524    -1.12   0.263     .0453182    2.324771
             |
    1.cancer |   1.021795   .2057865     0.11   0.915     .6885483    1.516329
1.~r_disease |   1.215197   .2342652     1.01   0.312     .8328227    1.773132
    1.stroke |   .9052297   .1894693    -0.48   0.634     .6006173    1.364331
  1.dementia |   .9961433    .203086    -0.02   0.985     .6680137    1.485451
1.other_ne~o |   1.256803   .2398614     1.20   0.231     .8645998     1.82692
             |
      egfr60 |
   eGFR <60  |   1.243555   .9047428     0.30   0.764     .2987977    5.175506
      1.esrf |   .7585821   .1687984    -1.24   0.214     .4904499    1.173304
1.immunosu~d |   1.308836   .2151463     1.64   0.102     .9483413    1.806365
1.ra_sle_p~s |   .8978701   .1879437    -0.51   0.607      .595715    1.353282
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_tested_eth5.ster not found)
file ./output/model/model2_tested_eth5.ster saved
(note: file ./output/model/model2_tested_eth5.dta not found)
file ./output/model/model2_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          152
Time at risk    =     18864129
                                                LR chi2(45)      =       38.62
Log likelihood  =    -1319.101                  Prob > chi2      =      0.7376

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.440086   .4109937     1.28   0.201     .8231133    2.519517
      Black  |   .8937978   .2831282    -0.35   0.723     .4804014    1.662931
      Mixed  |   1.124357   .3361186     0.39   0.695     .6258112    2.020063
      Other  |   .8888935   .2815703    -0.37   0.710       .47777    1.653791
    Unknown  |   1.096419   .2968752     0.34   0.734     .6449087    1.864038
             |
        male |
       Male  |   1.346759   .2217938     1.81   0.071     .9752319    1.859823
        age1 |   .9723098   .0218841    -1.25   0.212       .93035    1.016162
        age2 |    1.13138   .0935533     1.49   0.135     .9621065    1.330436
        age3 |   .7133221   .1571103    -1.53   0.125     .4632413    1.098409
             |
         imd |
          4  |   .9596259   .1981474    -0.20   0.842     .6402395     1.43834
5 most de..  |   .8952336   .2544056    -0.39   0.697     .5129129    1.562533
             |
   bmicat_sa |
Normal (..)  |   1.768122   1.337107     0.75   0.451     .4016135    7.784241
Overweig..)  |   1.532453   1.142486     0.57   0.567     .3554616    6.606652
Obese I ..)  |   2.121582   1.545296     1.03   0.302     .5089447    8.844008
Obese II..)  |   1.610537   1.183759     0.65   0.517     .3813557    6.801602
Obese II..)  |   1.377651   1.007598     0.44   0.661     .3285341    5.776944
    Unknown  |    1.90576   1.396726     0.88   0.379     .4531325    8.015143
             |
    hba1ccat |
  >=6.5-7.4  |   .9531451   .2148256    -0.21   0.831     .6127877    1.482545
  >=7.5-7.9  |   .9378833   .3275923    -0.18   0.854     .4729699    1.859791
    >=8-8.9  |   1.563012   .4026772     1.73   0.083     .9433401    2.589742
        >=9  |    1.05955   .4154979     0.15   0.883     .4912772    2.285159
    Unknown  |   4.72e-15   8.87e-08    -0.00   1.000            0           .
             |
gp_consult~t |   .9236988    .034347    -2.13   0.033     .8587745    .9935313
             |
smoke_nomiss |
     Former  |   .9869999    .576548    -0.02   0.982     .3141193     3.10127
    Current  |   .9170874    .236516    -0.34   0.737     .5532057    1.520319
             |
1.hyperten~n |   .9423403   .1945873    -0.29   0.774      .628695    1.412458
             |
      bp_cat |
High, sta..  |   1.46e-07   4.801652    -0.00   1.000            0           .
High, sta..  |   3.31e+07    8753325    65.48   0.000     1.97e+07    5.56e+07
    Unknown  |   3.54e+07          .        .       .            .           .
             |
    1.asthma |   1.141168   .4417792     0.34   0.733      .534349    2.437106
1.~y_disease |   1.159684    .225883     0.76   0.447     .7916679    1.698778
1.~c_disease |   .7520322   .1673578    -1.28   0.200     .4861938    1.163224
             |
     dm_type |
       T1DM  |   .6741173   .3944239    -0.67   0.500     .2141412    2.122124
       T2DM  |   1.174005   .2272208     0.83   0.407     .8033883    1.715593
 UNKNOWN_DM  |   .3244814   .3259484    -1.12   0.263     .0453043    2.324019
             |
    1.cancer |   1.021173   .2056583     0.10   0.917     .6881328    1.515397
1.~r_disease |   1.215815   .2343963     1.01   0.311     .8332298    1.774068
    1.stroke |   .9056857   .1895669    -0.47   0.636      .600917    1.365025
  1.dementia |   .9977218   .2034112    -0.01   0.991     .6690678    1.487814
1.other_ne~o |   1.258594   .2402106     1.21   0.228     .8658215    1.829544
             |
      egfr60 |
   eGFR <60  |   1.252303   .9111814     0.31   0.757     .3008645    5.212518
      1.esrf |   .7595862   .1690234    -1.24   0.217     .4910971    1.174862
1.immunosu~d |   1.308927   .2151607     1.64   0.101     .9484081    1.806489
1.ra_sle_p~s |   .8995177   .1882949    -0.51   0.613        .5968    1.355784
             |
hh_total_cat |
       6-10  |   .5717888   .2383394    -1.34   0.180     .2525971    1.294324
        11+  |   2.84e-15   8.28e-08    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_tested_eth5.ster not found)
file ./output/model/model3_tested_eth5.ster saved
(note: file ./output/model/model3_tested_eth5.dta not found)
file ./output/model/model3_tested_eth5.dta saved
(note: file ./output/estout_table2_eth5.txt not found)
(output written to ./output/estout_table2_eth5.txt)
positivetest
(11,899 observations deleted)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(5)       =        2.81
Log likelihood  =   -1310.6575                  Prob > chi2      =      0.7296

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.329576   .3922754     0.97   0.334     .7457214    2.370555
      Black  |   1.038582   .3245223     0.12   0.904     .5629483    1.916077
      Mixed  |   1.174852   .3557292     0.53   0.595     .6490096    2.126745
      Other  |   .8405916   .2773057    -0.53   0.599     .4403309    1.604689
    Unknown  |   1.179357   .3229924     0.60   0.547     .6894855    2.017275
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_positivetest_eth5.ster not found)
file ./output/model/crude_positivetest_eth5.ster saved
(note: file ./output/model/crude_positivetest_eth5.dta not found)
file ./output/model/crude_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(9)       =        5.00
Log likelihood  =   -1309.5606                  Prob > chi2      =      0.8342

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.329435    .392238     0.97   0.334      .745637    2.370318
      Black  |   1.040437   .3251042     0.13   0.899     .5639516    1.919508
      Mixed  |   1.175341   .3558845     0.53   0.594     .6492717    2.127656
      Other  |   .8419597   .2777589    -0.52   0.602     .4410457    1.607308
    Unknown  |   1.180251   .3232411     0.61   0.545     .6900043    2.018818
             |
        male |
       Male  |   .8609605   .1417981    -0.91   0.363     .6234368    1.188979
        age1 |   1.014128   .0224111     0.63   0.526     .9711412    1.059018
        age2 |   .9338032   .0755282    -0.85   0.397     .7969079    1.094215
        age3 |   1.197089   .2583656     0.83   0.405     .7841755    1.827426
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_positivetest_eth5.ster not found)
file ./output/model/model0_positivetest_eth5.ster saved
(note: file ./output/model/model0_positivetest_eth5.dta not found)
file ./output/model/model0_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(11)      =        5.74
Log likelihood  =   -1309.1917                  Prob > chi2      =      0.8902

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.329747   .3923454     0.97   0.334     .7457954    2.370928
      Black  |   1.040807   .3252208     0.13   0.898     .5641508    1.920194
      Mixed  |   1.174037   .3554957     0.53   0.596     .6485444    2.125316
      Other  |   .8404203   .2772588    -0.53   0.598     .4402313    1.604398
    Unknown  |   1.178891   .3228758     0.60   0.548     .6892012    2.016516
             |
        male |
       Male  |   .8605631   .1417332    -0.91   0.362     .6231482    1.188431
        age1 |   1.014118   .0224084     0.63   0.526     .9711363    1.059003
        age2 |   .9337484   .0755128    -0.85   0.397     .7968796    1.094125
        age3 |   1.197307   .2583804     0.83   0.404      .784359    1.827662
             |
         imd |
          4  |   .8393146   .1835463    -0.80   0.423     .5467377    1.288459
5 most de..  |   1.036295   .2777985     0.13   0.894      .612777    1.752524
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(11)      =        5.74
Log likelihood  =   -1309.1917                  Prob > chi2      =      0.8902

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.329747   .3923454     0.97   0.334     .7457954    2.370928
      Black  |   1.040807   .3252208     0.13   0.898     .5641508    1.920194
      Mixed  |   1.174037   .3554957     0.53   0.596     .6485444    2.125316
      Other  |   .8404203   .2772588    -0.53   0.598     .4402313    1.604398
    Unknown  |   1.178891   .3228758     0.60   0.548     .6892012    2.016516
             |
        male |
       Male  |   .8605631   .1417332    -0.91   0.362     .6231482    1.188431
        age1 |   1.014118   .0224084     0.63   0.526     .9711363    1.059003
        age2 |   .9337484   .0755128    -0.85   0.397     .7968796    1.094125
        age3 |   1.197307   .2583804     0.83   0.404      .784359    1.827662
             |
         imd |
          4  |   .8393146   .1835463    -0.80   0.423     .5467377    1.288459
5 most de..  |   1.036295   .2777985     0.13   0.894      .612777    1.752524
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_positivetest_eth5.ster not found)
file ./output/model/model1_positivetest_eth5.ster saved
(note: file ./output/model/model1_positivetest_eth5.dta not found)
file ./output/model/model1_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(43)      =       49.03
Log likelihood  =   -1287.5444                  Prob > chi2      =      0.2439

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.310746   .3876346     0.91   0.360     .7341547     2.34018
      Black  |   1.030158   .3220383     0.10   0.924     .5582251    1.901072
      Mixed  |   1.158343   .3508916     0.49   0.628     .6397149    2.097431
      Other  |   .8322062   .2746314    -0.56   0.578     .4358439    1.589026
    Unknown  |     1.1715   .3209591     0.58   0.563     .6847568    2.004234
             |
        male |
       Male  |   .8740793   .1451422    -0.81   0.418     .6312589    1.210303
        age1 |   1.029568   .0229537     1.31   0.191     .9855487    1.075554
        age2 |   .8946641   .0726091    -1.37   0.170     .7630945    1.048919
        age3 |   1.321513   .2859041     1.29   0.198     .8648029    2.019414
             |
         imd |
          4  |   .8374028   .1831957    -0.81   0.417     .5454062    1.285727
5 most de..  |   1.040371   .2790227     0.15   0.883     .6150347    1.759853
             |
   bmicat_sa |
Normal (..)  |   .2946507   .1355969    -2.66   0.008     .1195607    .7261503
Overweig..)  |   .2201975   .0990834    -3.36   0.001     .0911576    .5319026
Obese I ..)  |   .4524932   .1722282    -2.08   0.037     .2145988    .9541064
Obese II..)  |   .3138767   .1252249    -2.90   0.004     .1436024    .6860508
Obese II..)  |   .3264017   .1247618    -2.93   0.003       .15431    .6904156
    Unknown  |   .6188444   .2316106    -1.28   0.200     .2971722    1.288709
             |
    hba1ccat |
  >=6.5-7.4  |   .7591874   .1784008    -1.17   0.241     .4789894    1.203295
  >=7.5-7.9  |   .5606721   .2355637    -1.38   0.168     .2460825     1.27743
    >=8-8.9  |    .855044   .2712915    -0.49   0.622     .4591093    1.592432
        >=9  |   .9734666   .3804704    -0.07   0.945     .4525189    2.094138
    Unknown  |   6.82e-16   3.33e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.010781   .0357347     0.30   0.762     .9431134    1.083303
             |
smoke_nomiss |
     Former  |   .3410425   .3424107    -1.07   0.284     .0476642    2.440196
    Current  |   .9799793   .2466431    -0.08   0.936     .5983907    1.604904
             |
1.hyperten~n |   .8829359   .1878686    -0.59   0.558     .5818525    1.339817
             |
      bp_cat |
High, sta..  |   8.93e+07          .        .       .            .           .
High, sta..  |   1.44e+07   1.44e+07    16.38   0.000      1996887    1.03e+08
    Unknown  |   1.46e+07   1.51e+07    15.93   0.000      1912381    1.11e+08
             |
    1.asthma |   1.361492   .4951328     0.85   0.396     .6675125    2.776969
1.~y_disease |   1.144625   .2260168     0.68   0.494      .777295    1.685547
1.~c_disease |   .8811426   .1875333    -0.59   0.552      .580611    1.337233
             |
     dm_type |
       T1DM  |    1.84807   .6775336     1.68   0.094     .9008525    3.791257
       T2DM  |   .9907837   .2071097    -0.04   0.965     .6577288    1.492488
 UNKNOWN_DM  |   1.024432   .6001004     0.04   0.967     .3249816    3.229291
             |
    1.cancer |   1.142736   .2255766     0.68   0.499     .7761009    1.682571
1.~r_disease |   .9475207   .1988076    -0.26   0.797     .6280449    1.429509
    1.stroke |   1.009849    .206455     0.05   0.962       .67645     1.50757
  1.dementia |   .8525713   .1841279    -0.74   0.460     .5583398    1.301856
1.other_ne~o |   .5916684   .1453673    -2.14   0.033     .3655496     .957658
             |
      egfr60 |
   eGFR <60  |   1.715934   1.037944     0.89   0.372     .5243499    5.615393
      1.esrf |   1.060493   .2141696     0.29   0.771     .7138472    1.575471
1.immunosu~d |   .7345344   .1329091    -1.71   0.088     .5152202    1.047204
1.ra_sle_p~s |   1.038984   .2098324     0.19   0.850     .6993598    1.543536
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(43)      =       49.03
Log likelihood  =   -1287.5444                  Prob > chi2      =      0.2439

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.310746   .3876346     0.91   0.360     .7341547     2.34018
      Black  |   1.030158   .3220383     0.10   0.924     .5582251    1.901072
      Mixed  |   1.158343   .3508916     0.49   0.628     .6397149    2.097431
      Other  |   .8322062   .2746314    -0.56   0.578     .4358439    1.589026
    Unknown  |     1.1715   .3209591     0.58   0.563     .6847568    2.004234
             |
        male |
       Male  |   .8740793   .1451422    -0.81   0.418     .6312589    1.210303
        age1 |   1.029568   .0229537     1.31   0.191     .9855487    1.075554
        age2 |   .8946641   .0726091    -1.37   0.170     .7630945    1.048919
        age3 |   1.321513   .2859041     1.29   0.198     .8648029    2.019414
             |
         imd |
          4  |   .8374028   .1831957    -0.81   0.417     .5454062    1.285727
5 most de..  |   1.040371   .2790227     0.15   0.883     .6150347    1.759853
             |
   bmicat_sa |
Normal (..)  |   .2946507   .1355969    -2.66   0.008     .1195607    .7261503
Overweig..)  |   .2201975   .0990834    -3.36   0.001     .0911576    .5319026
Obese I ..)  |   .4524932   .1722282    -2.08   0.037     .2145988    .9541064
Obese II..)  |   .3138767   .1252249    -2.90   0.004     .1436024    .6860508
Obese II..)  |   .3264017   .1247618    -2.93   0.003       .15431    .6904156
    Unknown  |   .6188444   .2316106    -1.28   0.200     .2971722    1.288709
             |
    hba1ccat |
  >=6.5-7.4  |   .7591874   .1784008    -1.17   0.241     .4789894    1.203295
  >=7.5-7.9  |   .5606721   .2355637    -1.38   0.168     .2460825     1.27743
    >=8-8.9  |    .855044   .2712915    -0.49   0.622     .4591093    1.592432
        >=9  |   .9734666   .3804704    -0.07   0.945     .4525189    2.094138
    Unknown  |   6.82e-16   3.33e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.010781   .0357347     0.30   0.762     .9431134    1.083303
             |
smoke_nomiss |
     Former  |   .3410425   .3424107    -1.07   0.284     .0476642    2.440196
    Current  |   .9799793   .2466431    -0.08   0.936     .5983907    1.604904
             |
1.hyperten~n |   .8829359   .1878686    -0.59   0.558     .5818525    1.339817
             |
      bp_cat |
High, sta..  |   8.93e+07          .        .       .            .           .
High, sta..  |   1.44e+07   1.44e+07    16.38   0.000      1996887    1.03e+08
    Unknown  |   1.46e+07   1.51e+07    15.93   0.000      1912381    1.11e+08
             |
    1.asthma |   1.361492   .4951328     0.85   0.396     .6675125    2.776969
1.~y_disease |   1.144625   .2260168     0.68   0.494      .777295    1.685547
1.~c_disease |   .8811426   .1875333    -0.59   0.552      .580611    1.337233
             |
     dm_type |
       T1DM  |    1.84807   .6775336     1.68   0.094     .9008525    3.791257
       T2DM  |   .9907837   .2071097    -0.04   0.965     .6577288    1.492488
 UNKNOWN_DM  |   1.024432   .6001004     0.04   0.967     .3249816    3.229291
             |
    1.cancer |   1.142736   .2255766     0.68   0.499     .7761009    1.682571
1.~r_disease |   .9475207   .1988076    -0.26   0.797     .6280449    1.429509
    1.stroke |   1.009849    .206455     0.05   0.962       .67645     1.50757
  1.dementia |   .8525713   .1841279    -0.74   0.460     .5583398    1.301856
1.other_ne~o |   .5916684   .1453673    -2.14   0.033     .3655496     .957658
             |
      egfr60 |
   eGFR <60  |   1.715934   1.037944     0.89   0.372     .5243499    5.615393
      1.esrf |   1.060493   .2141696     0.29   0.771     .7138472    1.575471
1.immunosu~d |   .7345344   .1329091    -1.71   0.088     .5152202    1.047204
1.ra_sle_p~s |   1.038984   .2098324     0.19   0.850     .6993598    1.543536
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_positivetest_eth5.ster not found)
file ./output/model/model2_positivetest_eth5.ster saved
(note: file ./output/model/model2_positivetest_eth5.dta not found)
file ./output/model/model2_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          149
Time at risk    =     18864126
                                                LR chi2(45)      =       49.59
Log likelihood  =    -1287.265                  Prob > chi2      =      0.2952

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.310313    .387509     0.91   0.361     .7339098    2.339416
      Black  |   1.029516   .3218408     0.09   0.926     .5578739    1.899899
      Mixed  |   1.156982   .3504828     0.48   0.630     .6389595     2.09498
      Other  |   .8314983   .2744022    -0.56   0.576     .4354687     1.58769
    Unknown  |   1.171402   .3209363     0.58   0.564     .6846949     2.00408
             |
        male |
       Male  |   .8742921    .145179    -0.81   0.419     .6314106    1.210602
        age1 |   1.029613    .022952     1.31   0.190      .985596    1.075595
        age2 |   .8946158   .0725995    -1.37   0.170     .7630627    1.048849
        age3 |   1.321657   .2859162     1.29   0.197     .8649224    2.019578
             |
         imd |
          4  |   .8378403   .1832911    -0.81   0.419     .5456915    1.286398
5 most de..  |   1.041793   .2794094     0.15   0.879     .6158692    1.762276
             |
   bmicat_sa |
Normal (..)  |   .2937169   .1351699    -2.66   0.008     .1191796    .7238621
Overweig..)  |   .2193881   .0987202    -3.37   0.001     .0908217    .5299519
Obese I ..)  |   .4509379   .1716413    -2.09   0.036     .2138565    .9508479
Obese II..)  |   .3133158   .1250019    -2.91   0.004     .1433452    .6848279
Obese II..)  |   .3252697   .1243311    -2.94   0.003     .1537731    .6880293
    Unknown  |   .6175905   .2311406    -1.29   0.198     .2965707    1.286095
             |
    hba1ccat |
  >=6.5-7.4  |   .7592837   .1784237    -1.17   0.241     .4790498    1.203449
  >=7.5-7.9  |   .5600201   .2352962    -1.38   0.168     .2457908    1.275974
    >=8-8.9  |   .8543156   .2710612    -0.50   0.620     .4587174    1.591078
        >=9  |   .9734002   .3804441    -0.07   0.945     .4524884    2.093994
    Unknown  |   1.39e-14   1.51e-07    -0.00   1.000            0           .
             |
gp_consult~t |   1.010788   .0357313     0.30   0.761     .9431268    1.083303
             |
smoke_nomiss |
     Former  |   .3417867   .3431629    -1.07   0.285     .0477668    2.445593
    Current  |   .9810946   .2469309    -0.08   0.940     .5990632    1.606753
             |
1.hyperten~n |   .8818732   .1876459    -0.59   0.555     .5811477    1.338214
             |
      bp_cat |
High, sta..  |   8.94e+07          .        .       .            .           .
High, sta..  |   1.44e+07   1.45e+07    16.38   0.000      2000833    1.03e+08
    Unknown  |   1.46e+07   1.51e+07    15.93   0.000      1915463    1.11e+08
             |
    1.asthma |   1.360717   .4948547     0.85   0.397      .667129    2.775403
1.~y_disease |   1.144147   .2259218     0.68   0.495     .7769711    1.684842
1.~c_disease |   .8814449   .1876028    -0.59   0.553     .5808036    1.337707
             |
     dm_type |
       T1DM  |   1.849497   .6780652     1.68   0.093     .9015399    3.794219
       T2DM  |   .9903973   .2070318    -0.05   0.963     .6574686    1.491914
 UNKNOWN_DM  |   1.022863   .5991864     0.04   0.969     .3244808    3.224376
             |
    1.cancer |   1.142394   .2255144     0.67   0.500     .7758622    1.682083
1.~r_disease |    .947052   .1987108    -0.26   0.795     .6277322    1.428806
    1.stroke |   1.009534   .2063935     0.05   0.963     .6762349    1.507108
  1.dementia |   .8528492   .1841927    -0.74   0.461     .5585157    1.302294
1.other_ne~o |   .5915041   .1453282    -2.14   0.033     .3654466    .9573962
             |
      egfr60 |
   eGFR <60  |   1.709103   1.033908     0.89   0.376     .5222051    5.593653
      1.esrf |    1.05977   .2140332     0.29   0.774     .7133474    1.574425
1.immunosu~d |   .7348457   .1329637    -1.70   0.089      .515441    1.047643
1.ra_sle_p~s |   1.038603    .209757     0.19   0.851      .699102    1.542975
             |
hh_total_cat |
       6-10  |    1.14112   .6658504     0.23   0.821     .3636219    3.581068
        11+  |   1.34e-14   2.46e-07    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_positivetest_eth5.ster not found)
file ./output/model/model3_positivetest_eth5.ster saved
(note: file ./output/model/model3_positivetest_eth5.dta not found)
file ./output/model/model3_positivetest_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
hes
(11,899 observations deleted)

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(5)       =        2.77
Log likelihood  =   -79463.836                  Prob > chi2      =      0.7358

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.034423   .0394862     0.89   0.375     .9598555    1.114783
      Black  |    .978541   .0378865    -0.56   0.575     .9070324    1.055687
      Mixed  |   1.005611   .0385551     0.15   0.884     .9328139    1.084089
      Other  |    .987518   .0381383    -0.33   0.745     .9155273     1.06517
    Unknown  |   1.014659   .0348391     0.42   0.672      .948623    1.085293
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_hes_eth5.ster not found)
file ./output/model/crude_hes_eth5.ster saved
(note: file ./output/model/crude_hes_eth5.dta not found)
file ./output/model/crude_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(9)       =       11.49
Log likelihood  =   -79459.473                  Prob > chi2      =      0.2435

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.034548   .0394911     0.89   0.374     .9599714    1.114918
      Black  |   .9790174   .0379056    -0.55   0.584     .9074727    1.056203
      Mixed  |   1.005811   .0385636     0.15   0.880     .9329974    1.084306
      Other  |   .9884203   .0381745    -0.30   0.763     .9163613    1.066146
    Unknown  |   1.014843   .0348458     0.43   0.668     .9487936     1.08549
             |
        male |
       Male  |   1.010793   .0212059     0.51   0.609      .970073    1.053222
        age1 |   1.005496   .0028715     1.92   0.055     .9998834    1.011139
        age2 |   .9747039   .0101458    -2.46   0.014       .95502    .9947934
        age3 |   1.070887   .0296206     2.48   0.013     1.014377    1.130544
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_hes_eth5.ster not found)
file ./output/model/model0_hes_eth5.ster saved
(note: file ./output/model/model0_hes_eth5.dta not found)
file ./output/model/model0_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(11)      =       13.33
Log likelihood  =   -79458.555                  Prob > chi2      =      0.2723

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.034259   .0394822     0.88   0.378     .9596994    1.114611
      Black  |   .9789139   .0379021    -0.55   0.582     .9073758    1.056092
      Mixed  |   1.005925   .0385686     0.15   0.878     .9331028    1.084431
      Other  |   .9886473   .0381842    -0.30   0.768     .9165702    1.066392
    Unknown  |   1.014951   .0348507     0.43   0.666     .9488927    1.085608
             |
        male |
       Male  |   1.010935   .0212091     0.52   0.604     .9702089    1.053371
        age1 |   1.005493   .0028715     1.92   0.055     .9998803    1.011136
        age2 |   .9747441   .0101465    -2.46   0.014     .9550589    .9948351
        age3 |   1.070759   .0296177     2.47   0.013     1.014255    1.130411
             |
         imd |
          4  |   1.036342    .027245     1.36   0.175     .9842949     1.09114
5 most de..  |   1.005596   .0356301     0.16   0.875     .9381317    1.077912
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(11)      =       13.33
Log likelihood  =   -79458.555                  Prob > chi2      =      0.2723

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.034259   .0394822     0.88   0.378     .9596994    1.114611
      Black  |   .9789139   .0379021    -0.55   0.582     .9073758    1.056092
      Mixed  |   1.005925   .0385686     0.15   0.878     .9331028    1.084431
      Other  |   .9886473   .0381842    -0.30   0.768     .9165702    1.066392
    Unknown  |   1.014951   .0348507     0.43   0.666     .9488927    1.085608
             |
        male |
       Male  |   1.010935   .0212091     0.52   0.604     .9702089    1.053371
        age1 |   1.005493   .0028715     1.92   0.055     .9998803    1.011136
        age2 |   .9747441   .0101465    -2.46   0.014     .9550589    .9948351
        age3 |   1.070759   .0296177     2.47   0.013     1.014255    1.130411
             |
         imd |
          4  |   1.036342    .027245     1.36   0.175     .9842949     1.09114
5 most de..  |   1.005596   .0356301     0.16   0.875     .9381317    1.077912
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_hes_eth5.ster not found)
file ./output/model/model1_hes_eth5.ster saved
(note: file ./output/model/model1_hes_eth5.dta not found)
file ./output/model/model1_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(43)      =       52.35
Log likelihood  =   -79439.044                  Prob > chi2      =      0.1553

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    1.03987   .0398102     1.02   0.307     .9646991    1.120899
      Black  |   .9795086   .0379362    -0.53   0.593     .9079071    1.056757
      Mixed  |   1.007568   .0386417     0.20   0.844     .9346084    1.086224
      Other  |   .9894876   .0382277    -0.27   0.784     .9173292    1.067322
    Unknown  |   1.016194   .0348998     0.47   0.640     .9500426    1.086951
             |
        male |
       Male  |   1.009784   .0213005     0.46   0.644     .9688865    1.052407
        age1 |    1.00574   .0029627     1.94   0.052     .9999498    1.011564
        age2 |   .9740837   .0103286    -2.48   0.013      .954049    .9945391
        age3 |   1.072705   .0301164     2.50   0.012     1.015272    1.133386
             |
         imd |
          4  |   1.036196   .0272455     1.35   0.176     .9841486    1.090996
5 most de..  |   1.005263   .0356256     0.15   0.882     .9378076     1.07757
             |
   bmicat_sa |
Normal (..)  |   1.109579   .0895118     1.29   0.197     .9473059     1.29965
Overweig..)  |   1.120437   .0875758     1.45   0.146     .9612928    1.305928
Obese I ..)  |   1.106875    .085152     1.32   0.187     .9519536    1.287009
Obese II..)  |   1.117225   .0859335     1.44   0.150     .9608797     1.29901
Obese II..)  |   1.058789   .0805436     0.75   0.453     .9121316    1.229028
    Unknown  |   1.106522   .0856697     1.31   0.191     .9507315    1.287841
             |
    hba1ccat |
  >=6.5-7.4  |   1.004296   .0281395     0.15   0.878     .9506312    1.060991
  >=7.5-7.9  |   .9437684   .0417499    -1.31   0.191     .8653872    1.029249
    >=8-8.9  |   .9343892   .0380876    -1.66   0.096     .8626431    1.012102
        >=9  |   .9811888   .0508038    -0.37   0.714     .8865009     1.08599
    Unknown  |   .8052483   .1450487    -1.20   0.229     .5657227    1.146188
             |
gp_consult~t |   .9974997   .0045595    -0.55   0.584     .9886031    1.006476
             |
smoke_nomiss |
     Former  |   .9418714   .0734592    -0.77   0.443     .8083585    1.097436
    Current  |   1.018561   .0325384     0.58   0.565     .9567425    1.084374
             |
1.hyperten~n |   1.041779   .0270336     1.58   0.115      .990119    1.096134
             |
      bp_cat |
High, sta..  |   6.23e+07          .        .       .            .           .
High, sta..  |   6.54e+07   1.97e+07    59.62   0.000     3.62e+07    1.18e+08
    Unknown  |   6.62e+07   2.01e+07    59.34   0.000     3.65e+07    1.20e+08
             |
    1.asthma |   .8944627   .0498794    -2.00   0.045     .8018539    .9977672
1.~y_disease |   1.000513   .0262852     0.02   0.984     .9502984     1.05338
1.~c_disease |   1.042177   .0270204     1.59   0.111     .9905414    1.096505
             |
     dm_type |
       T1DM  |   .8670046    .057419    -2.15   0.031     .7614633    .9871742
       T2DM  |   1.017989   .0267142     0.68   0.497     .9669536    1.071718
 UNKNOWN_DM  |   .9885026   .0740734    -0.15   0.877     .8534795    1.144887
             |
    1.cancer |   .9735667   .0257142    -1.01   0.310       .92445    1.025293
1.~r_disease |    .976074   .0259111    -0.91   0.362     .9265878    1.028203
    1.stroke |   1.008861   .0264362     0.34   0.736     .9583549    1.062028
  1.dementia |   1.058421   .0274408     2.19   0.029     1.005982    1.113594
1.other_ne~o |   .9794104    .025876    -0.79   0.431     .9299852    1.031462
             |
      egfr60 |
   eGFR <60  |   .9495523   .0946184    -0.52   0.603     .7810892    1.154349
      1.esrf |   .9783071    .025889    -0.83   0.407      .928859    1.030388
1.immunosu~d |   1.027952   .0224111     1.26   0.206      .984952    1.072829
1.ra_sle_p~s |   1.018031   .0265352     0.69   0.493     .9673295    1.071391
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(43)      =       52.35
Log likelihood  =   -79439.044                  Prob > chi2      =      0.1553

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    1.03987   .0398102     1.02   0.307     .9646991    1.120899
      Black  |   .9795086   .0379362    -0.53   0.593     .9079071    1.056757
      Mixed  |   1.007568   .0386417     0.20   0.844     .9346084    1.086224
      Other  |   .9894876   .0382277    -0.27   0.784     .9173292    1.067322
    Unknown  |   1.016194   .0348998     0.47   0.640     .9500426    1.086951
             |
        male |
       Male  |   1.009784   .0213005     0.46   0.644     .9688865    1.052407
        age1 |    1.00574   .0029627     1.94   0.052     .9999498    1.011564
        age2 |   .9740837   .0103286    -2.48   0.013      .954049    .9945391
        age3 |   1.072705   .0301164     2.50   0.012     1.015272    1.133386
             |
         imd |
          4  |   1.036196   .0272455     1.35   0.176     .9841486    1.090996
5 most de..  |   1.005263   .0356256     0.15   0.882     .9378076     1.07757
             |
   bmicat_sa |
Normal (..)  |   1.109579   .0895118     1.29   0.197     .9473059     1.29965
Overweig..)  |   1.120437   .0875758     1.45   0.146     .9612928    1.305928
Obese I ..)  |   1.106875    .085152     1.32   0.187     .9519536    1.287009
Obese II..)  |   1.117225   .0859335     1.44   0.150     .9608797     1.29901
Obese II..)  |   1.058789   .0805436     0.75   0.453     .9121316    1.229028
    Unknown  |   1.106522   .0856697     1.31   0.191     .9507315    1.287841
             |
    hba1ccat |
  >=6.5-7.4  |   1.004296   .0281395     0.15   0.878     .9506312    1.060991
  >=7.5-7.9  |   .9437684   .0417499    -1.31   0.191     .8653872    1.029249
    >=8-8.9  |   .9343892   .0380876    -1.66   0.096     .8626431    1.012102
        >=9  |   .9811888   .0508038    -0.37   0.714     .8865009     1.08599
    Unknown  |   .8052483   .1450487    -1.20   0.229     .5657227    1.146188
             |
gp_consult~t |   .9974997   .0045595    -0.55   0.584     .9886031    1.006476
             |
smoke_nomiss |
     Former  |   .9418714   .0734592    -0.77   0.443     .8083585    1.097436
    Current  |   1.018561   .0325384     0.58   0.565     .9567425    1.084374
             |
1.hyperten~n |   1.041779   .0270336     1.58   0.115      .990119    1.096134
             |
      bp_cat |
High, sta..  |   6.23e+07          .        .       .            .           .
High, sta..  |   6.54e+07   1.97e+07    59.62   0.000     3.62e+07    1.18e+08
    Unknown  |   6.62e+07   2.01e+07    59.34   0.000     3.65e+07    1.20e+08
             |
    1.asthma |   .8944627   .0498794    -2.00   0.045     .8018539    .9977672
1.~y_disease |   1.000513   .0262852     0.02   0.984     .9502984     1.05338
1.~c_disease |   1.042177   .0270204     1.59   0.111     .9905414    1.096505
             |
     dm_type |
       T1DM  |   .8670046    .057419    -2.15   0.031     .7614633    .9871742
       T2DM  |   1.017989   .0267142     0.68   0.497     .9669536    1.071718
 UNKNOWN_DM  |   .9885026   .0740734    -0.15   0.877     .8534795    1.144887
             |
    1.cancer |   .9735667   .0257142    -1.01   0.310       .92445    1.025293
1.~r_disease |    .976074   .0259111    -0.91   0.362     .9265878    1.028203
    1.stroke |   1.008861   .0264362     0.34   0.736     .9583549    1.062028
  1.dementia |   1.058421   .0274408     2.19   0.029     1.005982    1.113594
1.other_ne~o |   .9794104    .025876    -0.79   0.431     .9299852    1.031462
             |
      egfr60 |
   eGFR <60  |   .9495523   .0946184    -0.52   0.603     .7810892    1.154349
      1.esrf |   .9783071    .025889    -0.83   0.407      .928859    1.030388
1.immunosu~d |   1.027952   .0224111     1.26   0.206      .984952    1.072829
1.ra_sle_p~s |   1.018031   .0265352     0.69   0.493     .9673295    1.071391
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_hes_eth5.ster not found)
file ./output/model/model2_hes_eth5.ster saved
(note: file ./output/model/model2_hes_eth5.dta not found)
file ./output/model/model2_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =        9,094
Time at risk    =     18558971
                                                LR chi2(45)      =       53.15
Log likelihood  =   -79438.645                  Prob > chi2      =      0.1891

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.040026   .0398166     1.03   0.305     .9648425    1.121067
      Black  |   .9796804   .0379434    -0.53   0.596     .9080651    1.056944
      Mixed  |   1.007763   .0386502     0.20   0.840     .9347869    1.086436
      Other  |   .9895239   .0382293    -0.27   0.785     .9173624    1.067362
    Unknown  |   1.016179   .0348994     0.47   0.640     .9500293    1.086936
             |
        male |
       Male  |   1.009831   .0213016     0.46   0.643     .9689321    1.052457
        age1 |   1.005727   .0029628     1.94   0.053     .9999368    1.011551
        age2 |   .9741257   .0103292    -2.47   0.013     .9540897    .9945824
        age3 |   1.072581   .0301136     2.50   0.013     1.015154    1.133256
             |
         imd |
          4  |   1.036151   .0272443     1.35   0.177      .984106    1.090949
5 most de..  |    1.00506   .0356198     0.14   0.887     .9376158    1.077355
             |
   bmicat_sa |
Normal (..)  |   1.109991   .0895467     1.29   0.196     .9476543    1.300135
Overweig..)  |   1.120953   .0876187     1.46   0.144     .9617312    1.306535
Obese I ..)  |   1.107331   .0851889     1.33   0.185     .9523421    1.287543
Obese II..)  |   1.117339   .0859428     1.44   0.149      .960976    1.299143
Obese II..)  |   1.059185   .0805753     0.76   0.450     .9124701    1.229491
    Unknown  |   1.106773   .0856898     1.31   0.190     .9509464    1.288135
             |
    hba1ccat |
  >=6.5-7.4  |   1.004404   .0281429     0.16   0.875     .9507324    1.061106
  >=7.5-7.9  |   .9439477   .0417595    -1.30   0.192     .8655486    1.029448
    >=8-8.9  |   .9345205   .0380933    -1.66   0.097     .8627636    1.012246
        >=9  |   .9811993   .0508044    -0.37   0.714     .8865104    1.086002
    Unknown  |   .8049064   .1449896    -1.20   0.228     .5654791    1.145709
             |
gp_consult~t |   .9974838   .0045596    -0.55   0.582     .9885871    1.006461
             |
smoke_nomiss |
     Former  |   .9410687   .0734038    -0.78   0.436     .8076574    1.096517
    Current  |   1.018455   .0325355     0.57   0.567     .9566419    1.084262
             |
1.hyperten~n |   1.041871   .0270363     1.58   0.114     .9902058    1.096232
             |
      bp_cat |
High, sta..  |   6.23e+07          .        .       .            .           .
High, sta..  |   6.54e+07   1.97e+07    59.62   0.000     3.62e+07    1.18e+08
    Unknown  |   6.62e+07   2.01e+07    59.34   0.000     3.65e+07    1.20e+08
             |
    1.asthma |   .8947387   .0498959    -1.99   0.046     .8020994    .9980774
1.~y_disease |   1.000573   .0262873     0.02   0.983     .9503545    1.053444
1.~c_disease |   1.042199    .027021     1.59   0.111     .9905617    1.096528
             |
     dm_type |
       T1DM  |   .8669183   .0574134    -2.16   0.031     .7613873    .9870763
       T2DM  |   1.018011   .0267148     0.68   0.496     .9669746    1.071741
 UNKNOWN_DM  |   .9887595   .0740934    -0.15   0.880        .8537    1.145186
             |
    1.cancer |   .9735521   .0257139    -1.01   0.310      .924436    1.025278
1.~r_disease |   .9761331   .0259127    -0.91   0.363     .9266438    1.028266
    1.stroke |   1.008873   .0264364     0.34   0.736     .9583665    1.062041
  1.dementia |    1.05832   .0274387     2.19   0.029     1.005884    1.113489
1.other_ne~o |   .9794243   .0258768    -0.79   0.431     .9299974    1.031478
             |
      egfr60 |
   eGFR <60  |   .9500891   .0946761    -0.51   0.607     .7815241    1.155011
      1.esrf |   .9783235   .0258899    -0.83   0.408     .9288737    1.030406
1.immunosu~d |   1.027776   .0224083     1.26   0.209     .9847816    1.072647
1.ra_sle_p~s |   1.018074   .0265364     0.69   0.492     .9673699    1.071436
             |
hh_total_cat |
       6-10  |   .9896347    .069278    -0.15   0.882     .8627555    1.135173
        11+  |   1.220271   .2925108     0.83   0.406      .762808     1.95208
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_hes_eth5.ster not found)
file ./output/model/model3_hes_eth5.ster saved
(note: file ./output/model/model3_hes_eth5.dta not found)
file ./output/model/model3_hes_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
onscoviddeath
(11,899 observations deleted)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(5)       =        4.48
Log likelihood  =   -235.44266                  Prob > chi2      =      0.4825

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.975556   1.710948     0.79   0.432     .3618252    10.78648
      Black  |   3.460975   2.775147     1.55   0.122     .7189045    16.66194
      Mixed  |   1.973539   1.709216     0.78   0.432     .3614503    10.77564
      Other  |   .9874786   .9874946    -0.01   0.990     .1390952    7.010405
    Unknown  |   2.358726   1.864772     1.09   0.278     .5008766     11.1077
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_onscoviddeath_eth5.ster not found)
file ./output/model/crude_onscoviddeath_eth5.ster saved
(note: file ./output/model/crude_onscoviddeath_eth5.dta not found)
file ./output/model/crude_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(9)       =       14.59
Log likelihood  =   -230.38867                  Prob > chi2      =      0.1029

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.979005   1.714005     0.79   0.431     .3624316    10.80607
      Black  |   3.458665   2.773382     1.55   0.122     .7183894    16.65164
      Mixed  |    1.97145   1.707474     0.78   0.433     .3610435    10.76495
      Other  |   .9833171   .9833583    -0.02   0.987     .1385021    6.981212
    Unknown  |   2.358638   1.864768     1.09   0.278     .5008308    11.10789
             |
        male |
       Male  |   1.525293   .5974862     1.08   0.281      .707818    3.286889
        age1 |   .9513639   .0429283    -1.10   0.269     .8708392    1.039335
        age2 |   .9842002   .1796671    -0.09   0.930     .6881695    1.407575
        age3 |   1.267291    .624375     0.48   0.631     .4825057    3.328514
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_onscoviddeath_eth5.ster not found)
file ./output/model/model0_onscoviddeath_eth5.ster saved
(note: file ./output/model/model0_onscoviddeath_eth5.dta not found)
file ./output/model/model0_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(11)      =       17.03
Log likelihood  =   -229.16917                  Prob > chi2      =      0.1071

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.969788     1.7061     0.78   0.434     .3607155    10.75658
      Black  |   3.448145   2.765023     1.54   0.123     .7161732    16.60172
      Mixed  |   1.964358   1.701344     0.78   0.436     .3597401    10.72636
      Other  |   .9891628   .9892453    -0.01   0.991     .1393142    7.023285
    Unknown  |   2.362124   1.867547     1.09   0.277     .5015613    11.12452
             |
        male |
       Male  |   1.528432   .5987308     1.08   0.279     .7092607    3.293717
        age1 |   .9515615   .0429397    -1.10   0.271     .8710156    1.039556
        age2 |   .9842274   .1797738    -0.09   0.931     .6880491    1.407899
        age3 |   1.266535   .6245041     0.48   0.632     .4818433    3.329112
             |
         imd |
          4  |   1.905999   .7944164     1.55   0.122     .8420616    4.314214
5 most de..  |   .8719157   .6540037    -0.18   0.855     .2004509    3.792635
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(11)      =       17.03
Log likelihood  =   -229.16917                  Prob > chi2      =      0.1071

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.969788     1.7061     0.78   0.434     .3607155    10.75658
      Black  |   3.448145   2.765023     1.54   0.123     .7161732    16.60172
      Mixed  |   1.964358   1.701344     0.78   0.436     .3597401    10.72636
      Other  |   .9891628   .9892453    -0.01   0.991     .1393142    7.023285
    Unknown  |   2.362124   1.867547     1.09   0.277     .5015613    11.12452
             |
        male |
       Male  |   1.528432   .5987308     1.08   0.279     .7092607    3.293717
        age1 |   .9515615   .0429397    -1.10   0.271     .8710156    1.039556
        age2 |   .9842274   .1797738    -0.09   0.931     .6880491    1.407899
        age3 |   1.266535   .6245041     0.48   0.632     .4818433    3.329112
             |
         imd |
          4  |   1.905999   .7944164     1.55   0.122     .8420616    4.314214
5 most de..  |   .8719157   .6540037    -0.18   0.855     .2004509    3.792635
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_onscoviddeath_eth5.ster not found)
file ./output/model/model1_onscoviddeath_eth5.ster saved
(note: file ./output/model/model1_onscoviddeath_eth5.dta not found)
file ./output/model/model1_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(43)      =       39.35
Log likelihood  =   -218.00597                  Prob > chi2      =      0.6302

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.970746   1.710981     0.78   0.435     .3594401    10.80525
      Black  |   3.398706   2.729194     1.52   0.128     .7043533    16.39973
      Mixed  |    1.93011   1.673427     0.76   0.448     .3528422    10.55804
      Other  |   .9779153   .9786759    -0.02   0.982     .1375427    6.952882
    Unknown  |   2.339812    1.85167     1.07   0.283     .4960906    11.03573
             |
        male |
       Male  |   1.478968   .5805112     1.00   0.319     .6852563    3.192014
        age1 |   .9430467    .045987    -1.20   0.229     .8570871    1.037627
        age2 |   1.011441   .1932819     0.06   0.953     .6954725    1.470962
        age3 |   1.191126   .6092113     0.34   0.732     .4371229    3.245726
             |
         imd |
          4  |   1.912645   .7981804     1.55   0.120     .8441373    4.333669
5 most de..  |   .8775032   .6589091    -0.17   0.862     .2014138    3.823034
             |
   bmicat_sa |
Normal (..)  |   .5817118   .7149378    -0.44   0.659     .0523071    6.469266
Overweig..)  |   .5741564   .6651915    -0.48   0.632     .0592744    5.561521
Obese I ..)  |   .7190443   .7906115    -0.30   0.764     .0833361     6.20409
Obese II..)  |   1.002573   1.076279     0.00   0.998     .1222747    8.220443
Obese II..)  |   .4289572   .4815559    -0.75   0.451     .0475158    3.872485
    Unknown  |   .4879983   .5454803    -0.64   0.521     .0545698    4.363992
             |
    hba1ccat |
  >=6.5-7.4  |   .5925301   .3698692    -0.84   0.402     .1743305    2.013945
  >=7.5-7.9  |   1.651783   1.033609     0.80   0.423     .4845191    5.631126
    >=8-8.9  |   .9104905   .6795535    -0.13   0.900     .2108496    3.931678
        >=9  |   .8069852   .8303363    -0.21   0.835     .1074072    6.063141
    Unknown  |   1.07e-14   3.41e-07    -0.00   1.000            0           .
             |
gp_consult~t |   .9879575   .0832699    -0.14   0.886     .8375193    1.165418
             |
smoke_nomiss |
     Former  |   1.785005   1.825862     0.57   0.571     .2404111     13.2533
    Current  |   .5803725   .4278359    -0.74   0.460      .136843     2.46145
             |
1.hyperten~n |   .8998729   .4469835    -0.21   0.832     .3399176    2.382257
             |
      bp_cat |
High, sta..  |   1.19e-06   40.05028    -0.00   1.000            0           .
High, sta..  |   7.77e+07   4.22e+07    33.47   0.000     2.68e+07    2.25e+08
    Unknown  |   1.24e+08          .        .       .            .           .
             |
    1.asthma |   1.905186   1.403104     0.88   0.381     .4498386    8.068966
1.~y_disease |   .9094906   .4516016    -0.19   0.848     .3436685    2.406893
1.~c_disease |   .6967322    .378115    -0.67   0.506     .2405031    2.018417
             |
     dm_type |
       T1DM  |   3.139431   2.362065     1.52   0.128     .7184863    13.71776
       T2DM  |   1.644865   .7466322     1.10   0.273     .6757021    4.004102
 UNKNOWN_DM  |   4.570261   3.439263     2.02   0.043     1.045648    19.97545
             |
    1.cancer |   .5014178   .3074562    -1.13   0.260     .1507528    1.667762
1.~r_disease |   .5089764   .3120137    -1.10   0.271     .1530708      1.6924
    1.stroke |   1.112416   .5159823     0.23   0.818     .4481737    2.761137
  1.dementia |    .331877   .2440902    -1.50   0.134     .0785112    1.402886
1.other_ne~o |   1.699754    .717863     1.26   0.209     .7428399     3.88935
             |
      egfr60 |
   eGFR <60  |   1.21e-14   1.98e-07    -0.00   1.000            0           .
      1.esrf |   1.395733   .6144178     0.76   0.449     .5889703    3.307586
1.immunosu~d |   .9303577    .380663    -0.18   0.860     .4172288    2.074558
1.ra_sle_p~s |   1.634156   .6906814     1.16   0.245     .7137242    3.741594
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(43)      =       39.35
Log likelihood  =   -218.00597                  Prob > chi2      =      0.6302

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.970746   1.710981     0.78   0.435     .3594401    10.80525
      Black  |   3.398706   2.729194     1.52   0.128     .7043533    16.39973
      Mixed  |    1.93011   1.673427     0.76   0.448     .3528422    10.55804
      Other  |   .9779153   .9786759    -0.02   0.982     .1375427    6.952882
    Unknown  |   2.339812    1.85167     1.07   0.283     .4960906    11.03573
             |
        male |
       Male  |   1.478968   .5805112     1.00   0.319     .6852563    3.192014
        age1 |   .9430467    .045987    -1.20   0.229     .8570871    1.037627
        age2 |   1.011441   .1932819     0.06   0.953     .6954725    1.470962
        age3 |   1.191126   .6092113     0.34   0.732     .4371229    3.245726
             |
         imd |
          4  |   1.912645   .7981804     1.55   0.120     .8441373    4.333669
5 most de..  |   .8775032   .6589091    -0.17   0.862     .2014138    3.823034
             |
   bmicat_sa |
Normal (..)  |   .5817118   .7149378    -0.44   0.659     .0523071    6.469266
Overweig..)  |   .5741564   .6651915    -0.48   0.632     .0592744    5.561521
Obese I ..)  |   .7190443   .7906115    -0.30   0.764     .0833361     6.20409
Obese II..)  |   1.002573   1.076279     0.00   0.998     .1222747    8.220443
Obese II..)  |   .4289572   .4815559    -0.75   0.451     .0475158    3.872485
    Unknown  |   .4879983   .5454803    -0.64   0.521     .0545698    4.363992
             |
    hba1ccat |
  >=6.5-7.4  |   .5925301   .3698692    -0.84   0.402     .1743305    2.013945
  >=7.5-7.9  |   1.651783   1.033609     0.80   0.423     .4845191    5.631126
    >=8-8.9  |   .9104905   .6795535    -0.13   0.900     .2108496    3.931678
        >=9  |   .8069852   .8303363    -0.21   0.835     .1074072    6.063141
    Unknown  |   1.07e-14   3.41e-07    -0.00   1.000            0           .
             |
gp_consult~t |   .9879575   .0832699    -0.14   0.886     .8375193    1.165418
             |
smoke_nomiss |
     Former  |   1.785005   1.825862     0.57   0.571     .2404111     13.2533
    Current  |   .5803725   .4278359    -0.74   0.460      .136843     2.46145
             |
1.hyperten~n |   .8998729   .4469835    -0.21   0.832     .3399176    2.382257
             |
      bp_cat |
High, sta..  |   1.19e-06   40.05028    -0.00   1.000            0           .
High, sta..  |   7.77e+07   4.22e+07    33.47   0.000     2.68e+07    2.25e+08
    Unknown  |   1.24e+08          .        .       .            .           .
             |
    1.asthma |   1.905186   1.403104     0.88   0.381     .4498386    8.068966
1.~y_disease |   .9094906   .4516016    -0.19   0.848     .3436685    2.406893
1.~c_disease |   .6967322    .378115    -0.67   0.506     .2405031    2.018417
             |
     dm_type |
       T1DM  |   3.139431   2.362065     1.52   0.128     .7184863    13.71776
       T2DM  |   1.644865   .7466322     1.10   0.273     .6757021    4.004102
 UNKNOWN_DM  |   4.570261   3.439263     2.02   0.043     1.045648    19.97545
             |
    1.cancer |   .5014178   .3074562    -1.13   0.260     .1507528    1.667762
1.~r_disease |   .5089764   .3120137    -1.10   0.271     .1530708      1.6924
    1.stroke |   1.112416   .5159823     0.23   0.818     .4481737    2.761137
  1.dementia |    .331877   .2440902    -1.50   0.134     .0785112    1.402886
1.other_ne~o |   1.699754    .717863     1.26   0.209     .7428399     3.88935
             |
      egfr60 |
   eGFR <60  |   1.21e-14   1.98e-07    -0.00   1.000            0           .
      1.esrf |   1.395733   .6144178     0.76   0.449     .5889703    3.307586
1.immunosu~d |   .9303577    .380663    -0.18   0.860     .4172288    2.074558
1.ra_sle_p~s |   1.634156   .6906814     1.16   0.245     .7137242    3.741594
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_onscoviddeath_eth5.ster not found)
file ./output/model/model2_onscoviddeath_eth5.ster saved
(note: file ./output/model/model2_onscoviddeath_eth5.dta not found)
file ./output/model/model2_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =           27
Time at risk    =     18865740
                                                LR chi2(45)      =       41.43
Log likelihood  =   -216.96713                  Prob > chi2      =      0.6239

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.965541   1.706536     0.78   0.436     .3584643    10.77751
      Black  |   3.401159   2.730967     1.52   0.127     .7049416     16.4097
      Mixed  |   1.934902   1.677418     0.76   0.446     .3537774    10.58249
      Other  |   .9650542   .9657541    -0.04   0.972     .1357478    6.860734
    Unknown  |   2.299692   1.820375     1.05   0.293      .487395    10.85071
             |
        male |
       Male  |   1.479104     .58072     1.00   0.319      .685178    3.192965
        age1 |   .9429471   .0459831    -1.20   0.228     .8569949     1.03752
        age2 |   1.011715   .1931116     0.06   0.951     .6959611    1.470726
        age3 |   1.189456    .607527     0.34   0.734     .4371073    3.236744
             |
         imd |
          4  |   1.891236   .7897677     1.53   0.127     .8342372    4.287478
5 most de..  |    .877497   .6589803    -0.17   0.862     .2013783    3.823655
             |
   bmicat_sa |
Normal (..)  |   .5886851   .7236412    -0.43   0.666     .0529107    6.549717
Overweig..)  |   .5772918   .6688603    -0.47   0.635     .0595907    5.592581
Obese I ..)  |   .7226697   .7945319    -0.30   0.768     .0837713    6.234257
Obese II..)  |    1.00889   1.082904     0.01   0.993     .1230827     8.26972
Obese II..)  |   .4339405   .4870807    -0.74   0.457     .0480829    3.916242
    Unknown  |   .4901849   .5477254    -0.64   0.523      .054858    4.380059
             |
    hba1ccat |
  >=6.5-7.4  |   .6020983   .3759318    -0.81   0.416     .1770937    2.047065
  >=7.5-7.9  |    1.61933   1.014699     0.77   0.442     .4741965    5.529835
    >=8-8.9  |   .8875573   .6628665    -0.16   0.873      .205344    3.836285
        >=9  |   .8059698   .8294388    -0.21   0.834     .1072337    6.057681
    Unknown  |   1.76e-16   4.48e-08    -0.00   1.000            0           .
             |
gp_consult~t |   .9872586   .0830958    -0.15   0.879     .8371183    1.164327
             |
smoke_nomiss |
     Former  |   1.714221   1.754695     0.53   0.599     .2305516    12.74576
    Current  |   .5804673   .4278924    -0.74   0.461     .1368715    2.461741
             |
1.hyperten~n |   .9053769   .4499039    -0.20   0.841     .3418586    2.397796
             |
      bp_cat |
High, sta..  |   1.99e-08   5.662545    -0.00   1.000            0           .
High, sta..  |   8.97e+07   4.87e+07    33.73   0.000     3.10e+07    2.60e+08
    Unknown  |   1.44e+08          .        .       .            .           .
             |
    1.asthma |   1.923958   1.416892     0.89   0.374     .4542882    8.148163
1.~y_disease |    .905675   .4498613    -0.20   0.842     .3421124    2.397596
1.~c_disease |   .6956592   .3776215    -0.67   0.504     .2400726    2.015814
             |
     dm_type |
       T1DM  |   3.115241   2.345132     1.51   0.131     .7123817    13.62293
       T2DM  |   1.663674   .7556339     1.12   0.262     .6830554    4.052103
 UNKNOWN_DM  |   4.640792   3.493553     2.04   0.041     1.061241    20.29412
             |
    1.cancer |    .498566   .3056992    -1.14   0.256     .1499003    1.658222
1.~r_disease |   .5154231   .3160737    -1.08   0.280     .1549459     1.71454
    1.stroke |    1.11261    .516103     0.23   0.818      .448228    2.761768
  1.dementia |   .3362402   .2473422    -1.48   0.138     .0795236    1.421685
1.other_ne~o |   1.694211   .7162122     1.25   0.212     .7398268    3.879763
             |
      egfr60 |
   eGFR <60  |   2.06e-16   2.65e-08    -0.00   1.000            0           .
      1.esrf |   1.411362   .6215961     0.78   0.434      .595319    3.346009
1.immunosu~d |   .9263143   .3790567    -0.19   0.852     .4153732    2.065752
1.ra_sle_p~s |   1.659891   .7018631     1.20   0.231     .7247032    3.801885
             |
hh_total_cat |
       6-10  |   .2940305   .2175372    -1.65   0.098     .0689659    1.253574
        11+  |   4.80e-17   1.76e-08    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_onscoviddeath_eth5.ster not found)
file ./output/model/model3_onscoviddeath_eth5.ster saved
(note: file ./output/model/model3_onscoviddeath_eth5.dta not found)
file ./output/model/model3_onscoviddeath_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
ons_noncoviddeath
(11,899 observations deleted)

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(5)       =        2.03
Log likelihood  =   -888.39876                  Prob > chi2      =      0.8444

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.228887    .475975     0.53   0.595     .5752055    2.625434
      Black  |   1.406831   .5304737     0.91   0.365     .6718606    2.945808
      Mixed  |   1.393889   .5255717     0.88   0.378     .6657004    2.918618
      Other  |   .9930519   .4054215    -0.02   0.986     .4461306    2.210456
    Unknown  |    1.38263   .4770673     0.94   0.348     .7030796    2.718989
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_ons_noncoviddeath_eth5.ster not found)
file ./output/model/crude_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/crude_ons_noncoviddeath_eth5.dta not found)
file ./output/model/crude_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(9)       =        3.83
Log likelihood  =   -887.50109                  Prob > chi2      =      0.9223

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.228383   .4757816     0.53   0.595     .5749678    2.624364
      Black  |   1.406747    .530459     0.91   0.365     .6718046    2.945701
      Mixed  |   1.393469   .5254173     0.88   0.379     .6654964    2.917755
      Other  |    .992883    .405362    -0.02   0.986     .4460464    2.210121
    Unknown  |   1.380895   .4764776     0.94   0.350     .7021886    2.715611
             |
        male |
       Male  |   1.162961   .2317455     0.76   0.449     .7869453    1.718643
        age1 |   1.021003   .0294934     0.72   0.472     .9648033    1.080477
        age2 |   .9606705   .0979396    -0.39   0.694     .7866746    1.173151
        age3 |   1.073208   .2883628     0.26   0.793     .6338295    1.817169
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_ons_noncoviddeath_eth5.ster not found)
file ./output/model/model0_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/model0_ons_noncoviddeath_eth5.dta not found)
file ./output/model/model0_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(11)      =        5.42
Log likelihood  =   -886.70524                  Prob > chi2      =      0.9091

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.224016   .4741133     0.52   0.602     .5729027    2.615132
      Black  |   1.405174   .5298635     0.90   0.367     .6710557    2.942398
      Mixed  |   1.391971   .5248564     0.88   0.380     .6647772    2.914635
      Other  |   .9916709   .4048719    -0.02   0.984     .4454976    2.207444
    Unknown  |   1.378904   .4757976     0.93   0.352     .7011689    2.711723
             |
        male |
       Male  |   1.163246    .231805     0.76   0.448     .7871347    1.719072
        age1 |   1.020989   .0294852     0.72   0.472     .9648041    1.080446
        age2 |    .960607   .0979084    -0.39   0.693     .7866623    1.173014
        age3 |   1.073467   .2883651     0.26   0.792     .6340604    1.817384
             |
         imd |
          4  |   1.097433   .2749962     0.37   0.711     .6715572    1.793384
5 most de..  |   1.469333   .4323859     1.31   0.191     .8253419    2.615811
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(11)      =        5.42
Log likelihood  =   -886.70524                  Prob > chi2      =      0.9091

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.224016   .4741133     0.52   0.602     .5729027    2.615132
      Black  |   1.405174   .5298635     0.90   0.367     .6710557    2.942398
      Mixed  |   1.391971   .5248564     0.88   0.380     .6647772    2.914635
      Other  |   .9916709   .4048719    -0.02   0.984     .4454976    2.207444
    Unknown  |   1.378904   .4757976     0.93   0.352     .7011689    2.711723
             |
        male |
       Male  |   1.163246    .231805     0.76   0.448     .7871347    1.719072
        age1 |   1.020989   .0294852     0.72   0.472     .9648041    1.080446
        age2 |    .960607   .0979084    -0.39   0.693     .7866623    1.173014
        age3 |   1.073467   .2883651     0.26   0.792     .6340604    1.817384
             |
         imd |
          4  |   1.097433   .2749962     0.37   0.711     .6715572    1.793384
5 most de..  |   1.469333   .4323859     1.31   0.191     .8253419    2.615811
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_ons_noncoviddeath_eth5.ster not found)
file ./output/model/model1_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/model1_ons_noncoviddeath_eth5.dta not found)
file ./output/model/model1_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(43)      =       28.91
Log likelihood  =   -874.95925                  Prob > chi2      =      0.9507

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.252125   .4862959     0.58   0.563     .5848725    2.680614
      Black  |   1.414413   .5336205     0.92   0.358     .6752129    2.962866
      Mixed  |   1.402956    .529186     0.90   0.369     .6698478    2.938406
      Other  |   .9951817   .4064296    -0.01   0.991     .4469654    2.215801
    Unknown  |   1.376444   .4751476     0.93   0.355     .6997199    2.707651
             |
        male |
       Male  |   1.182234   .2380996     0.83   0.406     .7966605    1.754421
        age1 |   1.024035   .0301829     0.81   0.420     .9665543    1.084935
        age2 |   .9521869   .0980995    -0.48   0.634     .7780845    1.165246
        age3 |   1.093692   .2960455     0.33   0.741     .6434103    1.859097
             |
         imd |
          4  |   1.092941   .2739402     0.35   0.723     .6687245    1.786266
5 most de..  |   1.476346   .4346179     1.32   0.186     .8290966    2.628884
             |
   bmicat_sa |
Normal (..)  |   .7545031   .5034788    -0.42   0.673     .2040119    2.790401
Overweig..)  |   .8720081   .5519457    -0.22   0.829     .2521997    3.015064
Obese I ..)  |   .7451714   .4669556    -0.47   0.639     .2182015    2.544806
Obese II..)  |   .8865303   .5493405    -0.19   0.846      .263175    2.986362
Obese II..)  |   .6332809   .3938591    -0.73   0.463     .1871565     2.14283
    Unknown  |   .8560629    .537497    -0.25   0.805     .2500696    2.930559
             |
    hba1ccat |
  >=6.5-7.4  |    .837557   .2328257    -0.64   0.524     .4857309    1.444219
  >=7.5-7.9  |   .8599716   .3664778    -0.35   0.723     .3730299    1.982552
    >=8-8.9  |    .712346   .3034569    -0.80   0.426      .309088    1.641723
        >=9  |   1.039806   .4821758     0.08   0.933     .4190205    2.580293
    Unknown  |   1.43e-18   1.77e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9799204   .0428213    -0.46   0.643     .8994859    1.067548
             |
smoke_nomiss |
     Former  |   1.50e-18   8.54e-10    -0.00   1.000            0           .
    Current  |   .9553214   .2939997    -0.15   0.882     .5226279     1.74625
             |
1.hyperten~n |   1.388557   .3161728     1.44   0.149     .8886819    2.169609
             |
      bp_cat |
High, sta..  |   1.28e-10   .2819444    -0.00   1.000            0           .
High, sta..  |   9.66e+07   4.43e+07    40.07   0.000     3.93e+07    2.37e+08
    Unknown  |   4.49e+07          .        .       .            .           .
             |
    1.asthma |   .7239098   .4244162    -0.55   0.582     .2294242    2.284177
1.~y_disease |   1.184812   .2813095     0.71   0.475     .7439592    1.886905
1.~c_disease |   .9843019   .2458889    -0.06   0.949     .6032388    1.606081
             |
     dm_type |
       T1DM  |    .984826   .5800406    -0.03   0.979     .3104708    3.123908
       T2DM  |    1.01002   .2542885     0.04   0.968     .6166327    1.654373
 UNKNOWN_DM  |   1.495576   .8811802     0.68   0.495     .4712895    4.746013
             |
    1.cancer |   1.237631   .2895207     0.91   0.362     .7824709    1.957554
1.~r_disease |   1.072665   .2632037     0.29   0.775     .6631347    1.735108
    1.stroke |    .645996   .1860861    -1.52   0.129     .3673095    1.136129
  1.dementia |   .9428775    .240204    -0.23   0.817      .572277    1.553475
1.other_ne~o |   1.476634   .3322035     1.73   0.083     .9501122    2.294936
             |
      egfr60 |
   eGFR <60  |   1.738691   1.281529     0.75   0.453     .4100444    7.372484
      1.esrf |   .8188515   .2178771    -0.75   0.453     .4860942    1.379399
1.immunosu~d |   .8660513   .1838708    -0.68   0.498     .5712491    1.312991
1.ra_sle_p~s |   1.238327   .2897464     0.91   0.361     .7828333    1.958851
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(43)      =       28.91
Log likelihood  =   -874.95925                  Prob > chi2      =      0.9507

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.252125   .4862959     0.58   0.563     .5848725    2.680614
      Black  |   1.414413   .5336205     0.92   0.358     .6752129    2.962866
      Mixed  |   1.402956    .529186     0.90   0.369     .6698478    2.938406
      Other  |   .9951817   .4064296    -0.01   0.991     .4469654    2.215801
    Unknown  |   1.376444   .4751476     0.93   0.355     .6997199    2.707651
             |
        male |
       Male  |   1.182234   .2380996     0.83   0.406     .7966605    1.754421
        age1 |   1.024035   .0301829     0.81   0.420     .9665543    1.084935
        age2 |   .9521869   .0980995    -0.48   0.634     .7780845    1.165246
        age3 |   1.093692   .2960455     0.33   0.741     .6434103    1.859097
             |
         imd |
          4  |   1.092941   .2739402     0.35   0.723     .6687245    1.786266
5 most de..  |   1.476346   .4346179     1.32   0.186     .8290966    2.628884
             |
   bmicat_sa |
Normal (..)  |   .7545031   .5034788    -0.42   0.673     .2040119    2.790401
Overweig..)  |   .8720081   .5519457    -0.22   0.829     .2521997    3.015064
Obese I ..)  |   .7451714   .4669556    -0.47   0.639     .2182015    2.544806
Obese II..)  |   .8865303   .5493405    -0.19   0.846      .263175    2.986362
Obese II..)  |   .6332809   .3938591    -0.73   0.463     .1871565     2.14283
    Unknown  |   .8560629    .537497    -0.25   0.805     .2500696    2.930559
             |
    hba1ccat |
  >=6.5-7.4  |    .837557   .2328257    -0.64   0.524     .4857309    1.444219
  >=7.5-7.9  |   .8599716   .3664778    -0.35   0.723     .3730299    1.982552
    >=8-8.9  |    .712346   .3034569    -0.80   0.426      .309088    1.641723
        >=9  |   1.039806   .4821758     0.08   0.933     .4190205    2.580293
    Unknown  |   1.43e-18   1.77e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9799204   .0428213    -0.46   0.643     .8994859    1.067548
             |
smoke_nomiss |
     Former  |   1.50e-18   8.54e-10    -0.00   1.000            0           .
    Current  |   .9553214   .2939997    -0.15   0.882     .5226279     1.74625
             |
1.hyperten~n |   1.388557   .3161728     1.44   0.149     .8886819    2.169609
             |
      bp_cat |
High, sta..  |   1.28e-10   .2819444    -0.00   1.000            0           .
High, sta..  |   9.66e+07   4.43e+07    40.07   0.000     3.93e+07    2.37e+08
    Unknown  |   4.49e+07          .        .       .            .           .
             |
    1.asthma |   .7239098   .4244162    -0.55   0.582     .2294242    2.284177
1.~y_disease |   1.184812   .2813095     0.71   0.475     .7439592    1.886905
1.~c_disease |   .9843019   .2458889    -0.06   0.949     .6032388    1.606081
             |
     dm_type |
       T1DM  |    .984826   .5800406    -0.03   0.979     .3104708    3.123908
       T2DM  |    1.01002   .2542885     0.04   0.968     .6166327    1.654373
 UNKNOWN_DM  |   1.495576   .8811802     0.68   0.495     .4712895    4.746013
             |
    1.cancer |   1.237631   .2895207     0.91   0.362     .7824709    1.957554
1.~r_disease |   1.072665   .2632037     0.29   0.775     .6631347    1.735108
    1.stroke |    .645996   .1860861    -1.52   0.129     .3673095    1.136129
  1.dementia |   .9428775    .240204    -0.23   0.817      .572277    1.553475
1.other_ne~o |   1.476634   .3322035     1.73   0.083     .9501122    2.294936
             |
      egfr60 |
   eGFR <60  |   1.738691   1.281529     0.75   0.453     .4100444    7.372484
      1.esrf |   .8188515   .2178771    -0.75   0.453     .4860942    1.379399
1.immunosu~d |   .8660513   .1838708    -0.68   0.498     .5712491    1.312991
1.ra_sle_p~s |   1.238327   .2897464     0.91   0.361     .7828333    1.958851
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_ons_noncoviddeath_eth5.ster not found)
file ./output/model/model2_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/model2_ons_noncoviddeath_eth5.dta not found)
file ./output/model/model2_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          101
Time at risk    =     18865740
                                                LR chi2(45)      =       30.16
Log likelihood  =   -874.33429                  Prob > chi2      =      0.9560

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.248362   .4848379     0.57   0.568     .5831113    2.672573
      Black  |   1.411552   .5325542     0.91   0.361     .6738348    2.956927
      Mixed  |   1.398509   .5275243     0.89   0.374     .6677104    2.929157
      Other  |   .9931048    .405592    -0.02   0.986     .4460233    2.211223
    Unknown  |    1.37509   .4746908     0.92   0.356     .6990212    2.705029
             |
        male |
       Male  |   1.180969    .237849     0.83   0.409      .795802    1.752555
        age1 |   1.024062   .0301773     0.81   0.420     .9665912     1.08495
        age2 |   .9521118   .0980818    -0.48   0.634     .7780391     1.16513
        age3 |   1.094099   .2961346     0.33   0.740     .6436742    1.859719
             |
         imd |
          4  |   1.094122   .2742384     0.36   0.720     .6694444    1.788203
5 most de..  |   1.476764   .4347395     1.32   0.185     .8293326    2.629622
             |
   bmicat_sa |
Normal (..)  |   .7526222   .5022203    -0.43   0.670     .2035051     2.78342
Overweig..)  |   .8705921   .5510572    -0.22   0.827     .2517858     3.01022
Obese I ..)  |    .744267    .466396    -0.47   0.637     .2179325    2.541765
Obese II..)  |   .8867145    .549462    -0.19   0.846     .2632254    2.987032
Obese II..)  |      .6314   .3926841    -0.74   0.460     .1866037    2.136432
    Unknown  |   .8555809   .5372009    -0.25   0.804     .2499251    2.928952
             |
    hba1ccat |
  >=6.5-7.4  |   .8345855   .2320072    -0.65   0.515      .483999    1.439121
  >=7.5-7.9  |   .8567196   .3651023    -0.36   0.717     .3716105    1.975102
    >=8-8.9  |   .7126255   .3035761    -0.80   0.426     .3092091    1.642368
        >=9  |    1.03988   .4821978     0.08   0.933     .4190606    2.580417
    Unknown  |   2.87e-17   7.92e-09    -0.00   1.000            0           .
             |
gp_consult~t |   .9799864   .0428226    -0.46   0.644     .8995494    1.067616
             |
smoke_nomiss |
     Former  |   3.05e-17   3.87e-09    -0.00   1.000            0           .
    Current  |   .9569826   .2945051    -0.14   0.886      .523543    1.749265
             |
1.hyperten~n |   1.386355   .3156727     1.43   0.151     .8872704    2.166171
             |
      bp_cat |
High, sta..  |   2.63e-09   1.287178    -0.00   1.000            0           .
High, sta..  |   9.82e+07   4.50e+07    40.11   0.000     3.99e+07    2.41e+08
    Unknown  |   4.55e+07          .        .       .            .           .
             |
    1.asthma |   .7229082   .4238279    -0.55   0.580     .2291075    2.281009
1.~y_disease |   1.182735   .2808235     0.71   0.480     .7426463     1.88362
1.~c_disease |    .984767   .2460094    -0.06   0.951     .6035187    1.606854
             |
     dm_type |
       T1DM  |   .9846378   .5799366    -0.03   0.979     .3104072    3.123354
       T2DM  |   1.009425   .2541396     0.04   0.970     .6162688    1.653401
 UNKNOWN_DM  |   1.491759   .8789513     0.68   0.497     .4700748    4.734025
             |
    1.cancer |    1.23785   .2895766     0.91   0.362     .7826044    1.957916
1.~r_disease |   1.072126   .2630747     0.28   0.777     .6627973    1.734246
    1.stroke |   .6454694   .1859348    -1.52   0.129     .3670096    1.135204
  1.dementia |   .9430185   .2402475    -0.23   0.818     .5723536    1.553732
1.other_ne~o |    1.47338   .3314799     1.72   0.085     .9480086    2.289905
             |
      egfr60 |
   eGFR <60  |   1.722254    1.26952     0.74   0.461     .4061194    7.303662
      1.esrf |   .8179763   .2176465    -0.76   0.450      .485572    1.377932
1.immunosu~d |   .8673659   .1841498    -0.67   0.503     .5721163    1.314984
1.ra_sle_p~s |   1.237869   .2896384     0.91   0.362     .7825447    1.958123
             |
hh_total_cat |
       6-10  |   2.305807    2.31787     0.83   0.406     .3214907     16.5378
        11+  |   7.44e-17   3.22e-08    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_ons_noncoviddeath_eth5.ster not found)
file ./output/model/model3_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model/model3_ons_noncoviddeath_eth5.dta not found)
file ./output/model/model3_ons_noncoviddeath_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
onsdeath
(11,899 observations deleted)

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(5)       =        4.72
Log likelihood  =   -1124.7368                  Prob > chi2      =      0.4505

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.335549   .4704358     0.82   0.411     .6696242    2.663718
      Black  |   1.700867   .5720448     1.58   0.114     .8798115    3.288146
      Mixed  |    1.47677   .5095584     1.13   0.259     .7509422    2.904152
      Other  |   .9918708   .3749005    -0.02   0.983     .4728505    2.080589
    Unknown  |   1.522155   .4794475     1.33   0.182     .8210093    2.822084
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/crude_onsdeath_eth5.ster not found)
file ./output/model/crude_onsdeath_eth5.ster saved
(note: file ./output/model/crude_onsdeath_eth5.dta not found)
file ./output/model/crude_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(9)       =        6.38
Log likelihood  =   -1123.9076                  Prob > chi2      =      0.7011

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.335172    .470305     0.82   0.412     .6694331    2.662974
      Black  |   1.699041   .5714412     1.58   0.115     .8788564    3.284656
      Mixed  |   1.475349   .5090732     1.13   0.260     .7502144    2.901377
      Other  |   .9918535   .3749019    -0.02   0.983     .4728347    2.080586
    Unknown  |   1.519552   .4786354     1.33   0.184     .8195966    2.817286
             |
        male |
       Male  |   1.230014   .2181261     1.17   0.243     .8688829    1.741242
        age1 |   .9993195   .0238105    -0.03   0.977     .9537247    1.047094
        age2 |   .9866102   .0860133    -0.15   0.877     .8316437    1.170453
        age3 |   1.054007   .2438082     0.23   0.820     .6698031    1.658592
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model0_onsdeath_eth5.ster not found)
file ./output/model/model0_onsdeath_eth5.ster saved
(note: file ./output/model/model0_onsdeath_eth5.dta not found)
file ./output/model/model0_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(11)      =        8.30
Log likelihood  =    -1122.951                  Prob > chi2      =      0.6866

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.329795   .4684333     0.81   0.418     .6667156    2.652337
      Black  |    1.69664   .5706357     1.57   0.116     .8776122    3.280022
      Mixed  |   1.475285   .5090523     1.13   0.260     .7501807    2.901256
      Other  |   .9919495   .3749435    -0.02   0.983     .4728756    2.080809
    Unknown  |   1.518935   .4784472     1.33   0.184     .8192576    2.816164
             |
        male |
       Male  |   1.230933   .2182921     1.17   0.241     .8695277     1.74255
        age1 |   .9993306   .0238094    -0.03   0.978     .9537378    1.047103
        age2 |   .9865866   .0860071    -0.15   0.877     .8316308    1.170415
        age3 |   1.054112    .243821     0.23   0.820     .6698843    1.658722
             |
         imd |
          4  |   1.258444    .268566     1.08   0.281      .828282    1.912009
5 most de..  |   1.353011   .3698186     1.11   0.269     .7918486    2.311853
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(11)      =        8.30
Log likelihood  =    -1122.951                  Prob > chi2      =      0.6866

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.329795   .4684333     0.81   0.418     .6667156    2.652337
      Black  |    1.69664   .5706357     1.57   0.116     .8776122    3.280022
      Mixed  |   1.475285   .5090523     1.13   0.260     .7501807    2.901256
      Other  |   .9919495   .3749435    -0.02   0.983     .4728756    2.080809
    Unknown  |   1.518935   .4784472     1.33   0.184     .8192576    2.816164
             |
        male |
       Male  |   1.230933   .2182921     1.17   0.241     .8695277     1.74255
        age1 |   .9993306   .0238094    -0.03   0.978     .9537378    1.047103
        age2 |   .9865866   .0860071    -0.15   0.877     .8316308    1.170415
        age3 |   1.054112    .243821     0.23   0.820     .6698843    1.658722
             |
         imd |
          4  |   1.258444    .268566     1.08   0.281      .828282    1.912009
5 most de..  |   1.353011   .3698186     1.11   0.269     .7918486    2.311853
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model1_onsdeath_eth5.ster not found)
file ./output/model/model1_onsdeath_eth5.ster saved
(note: file ./output/model/model1_onsdeath_eth5.dta not found)
file ./output/model/model1_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(43)      =       30.77
Log likelihood  =   -1111.7139                  Prob > chi2      =      0.9186

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.351229   .4771324     0.85   0.394     .6763337    2.699583
      Black  |   1.698244   .5714345     1.57   0.116     .8781795    3.284106
      Mixed  |   1.479308   .5106209     1.13   0.257     .7520468    2.909863
      Other  |   .9891159   .3739743    -0.03   0.977     .4714295    2.075284
    Unknown  |   1.512944   .4767159     1.31   0.189      .815861    2.805623
             |
        male |
       Male  |   1.237671   .2214167     1.19   0.233     .8716201    1.757452
        age1 |   1.000499   .0246315     0.02   0.984     .9533685     1.04996
        age2 |   .9831372   .0872895    -0.19   0.848     .8261117     1.17001
        age3 |   1.061625   .2490154     0.25   0.799     .6703677    1.681239
             |
         imd |
          4  |    1.25176   .2672172     1.05   0.293     .8237818    1.902084
5 most de..  |   1.358876   .3715448     1.12   0.262     .7951405    2.322288
             |
   bmicat_sa |
Normal (..)  |   .6927462   .4048605    -0.63   0.530     .2203474    2.177913
Overweig..)  |   .7812869   .4322219    -0.45   0.655     .2641864    2.310524
Obese I ..)  |   .7218255   .3926192    -0.60   0.549     .2485662     2.09615
Obese II..)  |   .8954809   .4801844    -0.21   0.837     .3130515    2.561514
Obese II..)  |   .5721721   .3103184    -1.03   0.303     .1976406    1.656446
    Unknown  |   .7458589   .4077675    -0.54   0.592      .255445     2.17779
             |
    hba1ccat |
  >=6.5-7.4  |   .7869862    .199569    -0.94   0.345     .4787557     1.29366
  >=7.5-7.9  |   1.028352   .3605593     0.08   0.936     .5172428    2.044508
    >=8-8.9  |    .755742   .2794313    -0.76   0.449     .3661395    1.559913
        >=9  |   1.003268   .4239156     0.01   0.994      .438283    2.296567
    Unknown  |   1.61e-15   5.38e-08    -0.00   1.000            0           .
             |
gp_consult~t |   .9814174   .0381061    -0.48   0.629      .909502    1.059019
             |
smoke_nomiss |
     Former  |   .3839664   .3857004    -0.95   0.341     .0536102    2.750039
    Current  |   .8754473   .2482217    -0.47   0.639     .5022072    1.526079
             |
1.hyperten~n |   1.280541   .2643414     1.20   0.231     .8544375     1.91914
             |
      bp_cat |
High, sta..  |   6.33e-08   3.699505    -0.00   1.000            0           .
High, sta..  |   4.04e+07   1.40e+07    50.65   0.000     2.05e+07    7.96e+07
    Unknown  |   2.74e+07          .        .       .            .           .
             |
    1.asthma |    .971115   .4431743    -0.06   0.949     .3970266    2.375318
1.~y_disease |   1.121355   .2399089     0.54   0.592     .7372798    1.705509
1.~c_disease |   .9229706   .2091131    -0.35   0.723     .5920184    1.438933
             |
     dm_type |
       T1DM  |   1.361259   .6255352     0.67   0.502     .5530833    3.350355
       T2DM  |   1.121667   .2459058     0.52   0.600     .7298828    1.723753
 UNKNOWN_DM  |   2.033439   .9347882     1.54   0.123     .8258988    5.006513
             |
    1.cancer |   1.063962   .2306505     0.29   0.775      .695663    1.627247
1.~r_disease |   .9416805   .2133928    -0.27   0.791     .6039682    1.468227
    1.stroke |   .7414561    .180553    -1.23   0.219     .4600534    1.194986
  1.dementia |   .8024332   .1916069    -0.92   0.357     .5025242     1.28133
1.other_ne~o |   1.523247   .3022379     2.12   0.034      1.03247    2.247311
             |
      egfr60 |
   eGFR <60  |   1.388018   1.016955     0.45   0.655     .3301781    5.835019
      1.esrf |   .9326709   .2113282    -0.31   0.758     .5982186    1.454109
1.immunosu~d |    .876547   .1651236    -0.70   0.484     .6059352    1.268015
1.ra_sle_p~s |   1.318006   .2692627     1.35   0.177     .8831216    1.967043
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(43)      =       30.77
Log likelihood  =   -1111.7139                  Prob > chi2      =      0.9186

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.351229   .4771324     0.85   0.394     .6763337    2.699583
      Black  |   1.698244   .5714345     1.57   0.116     .8781795    3.284106
      Mixed  |   1.479308   .5106209     1.13   0.257     .7520468    2.909863
      Other  |   .9891159   .3739743    -0.03   0.977     .4714295    2.075284
    Unknown  |   1.512944   .4767159     1.31   0.189      .815861    2.805623
             |
        male |
       Male  |   1.237671   .2214167     1.19   0.233     .8716201    1.757452
        age1 |   1.000499   .0246315     0.02   0.984     .9533685     1.04996
        age2 |   .9831372   .0872895    -0.19   0.848     .8261117     1.17001
        age3 |   1.061625   .2490154     0.25   0.799     .6703677    1.681239
             |
         imd |
          4  |    1.25176   .2672172     1.05   0.293     .8237818    1.902084
5 most de..  |   1.358876   .3715448     1.12   0.262     .7951405    2.322288
             |
   bmicat_sa |
Normal (..)  |   .6927462   .4048605    -0.63   0.530     .2203474    2.177913
Overweig..)  |   .7812869   .4322219    -0.45   0.655     .2641864    2.310524
Obese I ..)  |   .7218255   .3926192    -0.60   0.549     .2485662     2.09615
Obese II..)  |   .8954809   .4801844    -0.21   0.837     .3130515    2.561514
Obese II..)  |   .5721721   .3103184    -1.03   0.303     .1976406    1.656446
    Unknown  |   .7458589   .4077675    -0.54   0.592      .255445     2.17779
             |
    hba1ccat |
  >=6.5-7.4  |   .7869862    .199569    -0.94   0.345     .4787557     1.29366
  >=7.5-7.9  |   1.028352   .3605593     0.08   0.936     .5172428    2.044508
    >=8-8.9  |    .755742   .2794313    -0.76   0.449     .3661395    1.559913
        >=9  |   1.003268   .4239156     0.01   0.994      .438283    2.296567
    Unknown  |   1.61e-15   5.38e-08    -0.00   1.000            0           .
             |
gp_consult~t |   .9814174   .0381061    -0.48   0.629      .909502    1.059019
             |
smoke_nomiss |
     Former  |   .3839664   .3857004    -0.95   0.341     .0536102    2.750039
    Current  |   .8754473   .2482217    -0.47   0.639     .5022072    1.526079
             |
1.hyperten~n |   1.280541   .2643414     1.20   0.231     .8544375     1.91914
             |
      bp_cat |
High, sta..  |   6.33e-08   3.699505    -0.00   1.000            0           .
High, sta..  |   4.04e+07   1.40e+07    50.65   0.000     2.05e+07    7.96e+07
    Unknown  |   2.74e+07          .        .       .            .           .
             |
    1.asthma |    .971115   .4431743    -0.06   0.949     .3970266    2.375318
1.~y_disease |   1.121355   .2399089     0.54   0.592     .7372798    1.705509
1.~c_disease |   .9229706   .2091131    -0.35   0.723     .5920184    1.438933
             |
     dm_type |
       T1DM  |   1.361259   .6255352     0.67   0.502     .5530833    3.350355
       T2DM  |   1.121667   .2459058     0.52   0.600     .7298828    1.723753
 UNKNOWN_DM  |   2.033439   .9347882     1.54   0.123     .8258988    5.006513
             |
    1.cancer |   1.063962   .2306505     0.29   0.775      .695663    1.627247
1.~r_disease |   .9416805   .2133928    -0.27   0.791     .6039682    1.468227
    1.stroke |   .7414561    .180553    -1.23   0.219     .4600534    1.194986
  1.dementia |   .8024332   .1916069    -0.92   0.357     .5025242     1.28133
1.other_ne~o |   1.523247   .3022379     2.12   0.034      1.03247    2.247311
             |
      egfr60 |
   eGFR <60  |   1.388018   1.016955     0.45   0.655     .3301781    5.835019
      1.esrf |   .9326709   .2113282    -0.31   0.758     .5982186    1.454109
1.immunosu~d |    .876547   .1651236    -0.70   0.484     .6059352    1.268015
1.ra_sle_p~s |   1.318006   .2692627     1.35   0.177     .8831216    1.967043
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model2_onsdeath_eth5.ster not found)
file ./output/model/model2_onsdeath_eth5.ster saved
(note: file ./output/model/model2_onsdeath_eth5.dta not found)
file ./output/model/model2_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,904                  Number of obs    =      66,904
No. of failures =          128
Time at risk    =     18865740
                                                LR chi2(45)      =       31.20
Log likelihood  =   -1111.4995                  Prob > chi2      =      0.9412

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.350026   .4767187     0.85   0.395      .675721    2.697223
      Black  |   1.697907   .5713264     1.57   0.116     .8779996    3.283474
      Mixed  |   1.478489   .5103484     1.13   0.257       .75162    2.908291
      Other  |   .9885986   .3737818    -0.03   0.976     .4711802    2.074211
    Unknown  |    1.51278   .4766674     1.31   0.189     .8157694     2.80533
             |
        male |
       Male  |   1.237173   .2213312     1.19   0.234     .8712642    1.756754
        age1 |   1.000568   .0246307     0.02   0.982     .9534385    1.050026
        age2 |   .9828443   .0872598    -0.19   0.845     .8258716    1.169653
        age3 |   1.062537   .2492266     0.26   0.796     .6709469    1.682675
             |
         imd |
          4  |   1.251967   .2672641     1.05   0.292     .8239148    1.902407
5 most de..  |   1.360074   .3718725     1.12   0.261     .7958413    2.324335
             |
   bmicat_sa |
Normal (..)  |   .6908327   .4037406    -0.63   0.527     .2197397    2.171887
Overweig..)  |   .7785919   .4307265    -0.45   0.651     .2632782    2.302528
Obese I ..)  |   .7195618   .3913837    -0.61   0.545     .2477895    2.089552
Obese II..)  |   .8939818    .479374    -0.21   0.834      .312532    2.557189
Obese II..)  |   .5707237   .3095283    -1.03   0.301     .1971434    1.652226
    Unknown  |   .7445167   .4070221    -0.54   0.589     .2549931    2.173804
             |
    hba1ccat |
  >=6.5-7.4  |   .7868582   .1995528    -0.95   0.345     .4786585    1.293502
  >=7.5-7.9  |   1.028258    .360539     0.08   0.937     .5171834    2.044371
    >=8-8.9  |    .755137   .2792093    -0.76   0.447     .3658449    1.558671
        >=9  |   1.002758    .423701     0.01   0.995     .4380596    2.295404
    Unknown  |   4.43e-15   8.94e-08    -0.00   1.000            0           .
             |
gp_consult~t |   .9814308   .0381076    -0.48   0.629     .9095126    1.059036
             |
smoke_nomiss |
     Former  |   .3847482   .3864993    -0.95   0.342     .0537157    2.755828
    Current  |   .8757583    .248313    -0.47   0.640      .502382    1.526632
             |
1.hyperten~n |   1.279698   .2641734     1.19   0.232     .8538675    1.917894
             |
      bp_cat |
High, sta..  |   1.72e-07   6.086569    -0.00   1.000            0           .
High, sta..  |   4.04e+07   1.40e+07    50.65   0.000     2.05e+07    7.96e+07
    Unknown  |   2.74e+07          .        .       .            .           .
             |
    1.asthma |   .9705828   .4429333    -0.07   0.948     .3968075    2.374025
1.~y_disease |   1.121142   .2398676     0.53   0.593     .7371347    1.705198
1.~c_disease |   .9228162   .2090816    -0.35   0.723     .5919149    1.438703
             |
     dm_type |
       T1DM  |   1.362111   .6259291     0.67   0.501     .5534281    3.352463
       T2DM  |   1.121834   .2459463     0.52   0.600     .7299864    1.724021
 UNKNOWN_DM  |   2.030648   .9335113     1.54   0.123     .8247607    4.999671
             |
    1.cancer |   1.063457   .2305451     0.28   0.777     .6953273    1.626487
1.~r_disease |    .941563   .2133697    -0.27   0.790     .6038885    1.468054
    1.stroke |   .7411998   .1804914    -1.23   0.219     .4598934    1.194575
  1.dementia |   .8029912   .1917428    -0.92   0.358     .5028704    1.282229
1.other_ne~o |   1.523483   .3022981     2.12   0.034     1.032613    2.247698
             |
      egfr60 |
   eGFR <60  |   1.385644   1.015299     0.45   0.656     .3295741    5.825729
      1.esrf |   .9329523      .2114    -0.31   0.759      .598389    1.454572
1.immunosu~d |   .8768704   .1651854    -0.70   0.485     .6061576    1.268485
1.ra_sle_p~s |   1.317665    .269194     1.35   0.177     .8828925    1.966538
             |
hh_total_cat |
       6-10  |   .9626074    .562727    -0.07   0.948     .3060896    3.027261
        11+  |   4.56e-15   1.44e-07    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/model3_onsdeath_eth5.ster not found)
file ./output/model/model3_onsdeath_eth5.ster saved
(note: file ./output/model/model3_onsdeath_eth5.dta not found)
file ./output/model/model3_onsdeath_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)

. 
. file close tablecontent

. 
. ************************************************create forestplot dataset
. dsconcat `hr'

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. split idstr, p(_)
variables created as string: 
idstr1  idstr2  idstr3  idstr4

. ren idstr1 model

. ren idstr2 outcome

. drop idstr idstr3

. tab model

      model |      Freq.     Percent        Cum.
------------+-----------------------------------
      crude |         36        3.66        3.66
     model0 |         66        6.71       10.37
     model1 |         84        8.54       18.90
     model2 |        390       39.63       58.54
     model3 |        408       41.46      100.00
------------+-----------------------------------
      Total |        984      100.00

. 
. *save dataset for later
. outsheet using ./output/FP_multivariable_eth5.txt, replace
(note: file ./output/FP_multivariable_eth5.txt not found)

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/04b_eth_an_multivariable_eth5.log
  log type:  text
 closed on:   9 Jan 2021, 17:26:22
-------------------------------------------------------------------------------
