-------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/Ethnicity-2nd-wave/logs/05_stp_check.log
  log type:  text
 opened on:   6 Jan 2021, 12:32:02

. 
. use ./output/analysis_dataset.dta, clear

. keep if carehome==0
(1,191 observations deleted)

. tab stp eth5, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Sustainabi |
  lity and |
Transforma |
      tion |
Partnershi |                         Eth 5 categories
         p |     White  South Asi      Black      Mixed      Other    Unknown |     Total
-----------+------------------------------------------------------------------+----------
         1 |        95        112        106        127         94        162 |       696 
           |     13.65      16.09      15.23      18.25      13.51      23.28 |    100.00 
-----------+------------------------------------------------------------------+----------
         2 |        84         91         98         87         99        154 |       613 
           |     13.70      14.85      15.99      14.19      16.15      25.12 |    100.00 
-----------+------------------------------------------------------------------+----------
         3 |        82         89        100        112         91        137 |       611 
           |     13.42      14.57      16.37      18.33      14.89      22.42 |    100.00 
-----------+------------------------------------------------------------------+----------
         4 |       111         96         93         93        100        180 |       673 
           |     16.49      14.26      13.82      13.82      14.86      26.75 |    100.00 
-----------+------------------------------------------------------------------+----------
         5 |        99        100        100        104         94        189 |       686 
           |     14.43      14.58      14.58      15.16      13.70      27.55 |    100.00 
-----------+------------------------------------------------------------------+----------
         6 |        92        107         95         92        100        191 |       677 
           |     13.59      15.81      14.03      13.59      14.77      28.21 |    100.00 
-----------+------------------------------------------------------------------+----------
         7 |       104        108         92         86         97        149 |       636 
           |     16.35      16.98      14.47      13.52      15.25      23.43 |    100.00 
-----------+------------------------------------------------------------------+----------
         8 |        72        109        109        117        115        185 |       707 
           |     10.18      15.42      15.42      16.55      16.27      26.17 |    100.00 
-----------+------------------------------------------------------------------+----------
         9 |        96         89         87        115         86        165 |       638 
           |     15.05      13.95      13.64      18.03      13.48      25.86 |    100.00 
-----------+------------------------------------------------------------------+----------
        10 |       100         97        100         90         92        177 |       656 
           |     15.24      14.79      15.24      13.72      14.02      26.98 |    100.00 
-----------+------------------------------------------------------------------+----------
     Total |       935        998        980      1,023        968      1,689 |     6,593 
           |     14.18      15.14      14.86      15.52      14.68      25.62 |    100.00 

. collapse (count) patient_id, by(stp eth5)

. reshape wide patient_id, i(stp) j(eth5)
(note: j = 1 2 3 4 5 6)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       60   ->      10
Number of variables                   3   ->       7
j variable (6 values)              eth5   ->   (dropped)
xij variables:
                             patient_id   ->   patient_id1 patient_id2 ... patient_id6
-----------------------------------------------------------------------------

. ren patient_id* eth*

. 
. 
.  export delimited using ./output/table5_stp_check.txt, replace
(note: file ./output/table5_stp_check.txt not found)
file ./output/table5_stp_check.txt saved

. * Close log file 
. log close
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/Ethnicity-2nd-wave/logs/05_stp_check.log
  log type:  text
 closed on:   6 Jan 2021, 12:32:02
-------------------------------------------------------------------------------------------------------------------------------------------------------
