--------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/Ethnicity-2nd-wave/logs/07b_eth_an_testedpop_eth5.log
  log type:  text
 opened on:  15 Jan 2021, 14:27:06

. 
. cap file close tablecontent

. file open tablecontent using ./output/table3_testedpop_eth5_nocarehomes.txt, write text replace

. file write tablecontent ("Table 3: Odds of testing positive amongst those receiving a test - No care homes") _n

. file write tablecontent _tab ("Denominator") _tab ("Event") _tab ("%") _tab ("Crude") _tab _tab ("Age/Sex Adjusted
> ") _tab _tab ("Age/Sex/IMD Adjusted") _tab _tab       ("plus co-morbidities") _tab _tab       ("plus hh size")  _n

. 
. file write tablecontent _tab _tab _tab _tab   ("OR") _tab ("95% CI") _tab ("OR") _tab ("95% CI") _tab ("OR") _tab 
> ("95% CI") _tab ("OR") _tab ("95% CI") _tab ("95% CI") _tab ("95% CI") _n

. 
. 
. foreach i of global outcomes {
  2. * Open Stata dataset
. use ./output/analysis_dataset.dta, clear
  3. 
. safecount
  4. 
. *define population as anyone who has received a test
. keep if tested==1
  5. safecount
  6. 
. keep if carehome==0
  7. safecount
  8. 
. 
. 
. /* Sense check outcomes=======================================================*/ 
. safetab tested `i'
  9. 
. safetab eth5 `i', missing row
 10. 
. 
. /* Main Model=================================================================*/
. 
. /* Univariable model */ 
. 
. logistic `i' i.eth5 i.stp, nolog 
 11. estimates save ./output/crude_`i'_eth5, replace 
 12. parmest, label eform format(estimate p lb ub) saving(./output/crude_`i'_eth5, replace) idstr("crude_`i'_eth5") 
 13. eststo model1
 14. local hr "`hr' ./output/crude_`i'_eth5 "
 15. 
. 
. /* Multivariable models */ 
. *Age Gender
. logistic `i' i.eth5 i.male age1 age2 age3 i.stp, nolog 
 16. estimates save ./output/model0_`i'_eth5, replace 
 17. parmest, label eform format(estimate p lb ub) saving(./output/model0_`i'_eth5, replace) idstr("model0_`i'_eth5"
> ) 
 18. eststo model2
 19. local hr "`hr' ./output/model0_`i'_eth5 "
 20. 
. * Age, Gender, IMD
. logistic `i' i.eth5 i.male age1 age2 age3 i.imd i.stp , nolog 
 21. estimates save ./output/model1_`i'_eth5, replace 
 22. parmest, label eform format(estimate p lb ub) saving(./output/model1_`i'_eth5, replace) idstr("model1_`i'_eth5"
> ) 
 23. eststo model3
 24. local hr "`hr' ./output/model1_`i'_eth5 "
 25. 
. * Age, Gender, IMD and Comorbidities  
. cap logistic `i' i.eth5 i.male age1 age2 age3   i.imd                                           ///
>                                                                                 i.bmicat_sa     i.hba1ccat        
>               ///
>                                                                                 gp_consult_count                  
>       ///
>                                                                                 i.smoke_nomiss                    
>       ///
>                                                                                 i.hypertension i.bp_cat         //
> /     
>                                                                                 i.asthma                          
>               ///
>                                                                                 i.chronic_respiratory_disease ///
>                                                                                 i.chronic_cardiac_disease       //
> /
>                                                                                 i.dm_type                         
>               ///     
>                                                                                 i.cancer                    ///
>                                                                                 i.chronic_liver_disease         //
> /
>                                                                                 i.stroke                          
>               ///
>                                                                                 i.dementia                        
>               ///
>                                                                                 i.other_neuro                     
>       ///
>                                                                                 i.egfr60                          
>               ///
>                                                                                 i.esrf                            
>               ///
>                                                                                 i.immunosuppressed                
>       ///
>                                                                                 i.ra_sle_psoriasis      i. stp, no
> log           
 26.                                                                                 
. cap estimates save ./output/model2_`i'_eth5, replace 
 27. parmest, label eform format(estimate p lb ub) saving(./output/model2_`i'_eth5, replace) idstr("model2_`i'_eth5"
> ) 
 28. eststo model4
 29. local hr "`hr' ./output/model2_`i'_eth5 "
 30. 
. * Age, Gender, IMD and Comorbidities  and household size 
. cap logistic `i' i.eth5 i.male age1 age2 age3   i.imd                                           ///
>                                                                                 i.bmicat_sa     i.hba1ccat        
>               ///
>                                                                                 gp_consult_count                  
>       ///
>                                                                                 i.smoke_nomiss                    
>       ///
>                                                                                 i.hypertension i.bp_cat         //
> /     
>                                                                                 i.asthma                          
>               ///
>                                                                                 i.chronic_respiratory_disease ///
>                                                                                 i.chronic_cardiac_disease       //
> /
>                                                                                 i.dm_type                         
>               ///     
>                                                                                 i.cancer                    ///
>                                                                                 i.chronic_liver_disease         //
> /
>                                                                                 i.stroke                          
>               ///
>                                                                                 i.dementia                        
>               ///
>                                                                                 i.other_neuro                     
>       ///
>                                                                                 i.egfr60                          
>               ///
>                                                                                 i.esrf                            
>               ///
>                                                                                 i.immunosuppressed                
>       ///
>                                                                                 i.ra_sle_psoriasis                
>       ///
>                                                                                 i.hh_total_cat i.stp, nolog       
>       
 31.                                                                                 
. cap estimates save ./output/model3_`i'_eth5, replace 
 32. parmest, label eform format(estimate p lb ub) saving(./output/model3_`i'_eth5, replace) idstr("model3_`i'_eth5"
> ) 
 33. eststo model5
 34. local hr "`hr' ./output/model3_`i'_eth5 "
 35. 
. /* Estout================================================================*/ 
. esttab model1 model2 model3 model4 model5   using ./output/estout_table3_testedpop_eth5_nocarehomes.txt, b(a2) ci(
> 2) label wide compress eform ///
>         title ("`i'") ///
>         varlabels(`e(labels)') ///
>         stats(N_sub) ///
>         append 
 36. eststo clear
 37. 
. 
. 
. /* Print table================================================================*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("`i'") _n
 38. 
. * eth5 labelled columns
. 
. local lab1: label eth5 1
 39. local lab2: label eth5 2
 40. local lab3: label eth5 3
 41. local lab4: label eth5 4
 42. local lab5: label eth5 5
 43. local lab6: label eth5 6
 44. local lab7: label eth5 7
 45. local lab8: label eth5 8
 46. local lab9: label eth5 9
 47. local lab10: label eth5 10
 48. local lab11: label eth5 11
 49. local lab12: label eth5 12
 50. local lab13: label eth5 13
 51. local lab14: label eth5 14
 52. local lab15: label eth5 15
 53. local lab16: label eth5 16
 54. local lab17: label eth5 17
 55. 
. /* Counts */
.  
. * First row, eth5 = 1 (White) reference cat
.         qui safecount if eth5==1
 56.         local denominator = r(N)
 57.         qui safecount if eth5 == 1 & `i' == 1
 58.         local event = r(N)
 59.         local pct =(`event'/`denominator')
 60.         file write tablecontent  ("`lab1'") _tab (`denominator') _tab (`event') _tab %3.2f (`pct') _tab
 61.         file write tablecontent ("1.00") _tab _tab ("1.00") _tab _tab ("1.00")  _tab _tab ("1.00") _tab _tab ("
> 1.00") _n
 62.         
. * Subsequent ethnic groups
. forvalues eth=2/17 {
 63.         qui safecount if eth5==`eth'
 64.         local denominator = r(N)
 65.         qui safecount if eth5 == `eth' & `i' == 1
 66.         local event = r(N)
 67.         local pct =(`event'/`denominator')
 68.         file write tablecontent  ("`lab`eth''") _tab (`denominator') _tab (`event') _tab %3.2f (`pct') _tab
 69.         cap estimates use ./output/crude_`i'_eth5" 
 70.         cap lincom `eth'.eth5, eform
 71.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab 
 72.         cap estimates clear
 73.         cap estimates use ./output/model0_`i'_eth5" 
 74.         cap lincom `eth'.eth5, eform
 75.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab 
 76.         cap estimates clear
 77.         cap estimates use ./output/model1_`i'_eth5" 
 78.         cap lincom `eth'.eth5, eform
 79.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab 
 80.         cap estimates clear
 81.         cap estimates use ./output/model2_`i'_eth5" 
 82.         cap lincom `eth'.eth5, eform
 83.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab 
 84.         cap estimates clear
 85.         cap estimates use ./output/model3_`i'_eth5" 
 86.         cap lincom `eth'.eth5, eform
 87.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _n
 88. }  //end ethnic group
 89. 
. } //end outcomes
  78,759
(69,432 observations deleted)
  9,327
(1,402 observations deleted)
  7,925

   outcome | outcome positivetest
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     6,985        940 |     7,925 
-----------+----------------------+----------
     Total |     6,985        940 |     7,925 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 | outcome positivetest
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,053        164 |     1,217 
            |     86.52      13.48 |    100.00 
------------+----------------------+----------
South Asian |     1,011        132 |     1,143 
            |     88.45      11.55 |    100.00 
------------+----------------------+----------
      Black |     1,018        132 |     1,150 
            |     88.52      11.48 |    100.00 
------------+----------------------+----------
      Mixed |     1,068        142 |     1,210 
            |     88.26      11.74 |    100.00 
------------+----------------------+----------
      Other |     1,083        122 |     1,205 
            |     89.88      10.12 |    100.00 
------------+----------------------+----------
    Unknown |     1,752        248 |     2,000 
            |     87.60      12.40 |    100.00 
------------+----------------------+----------
      Total |     6,985        940 |     7,925 
            |     88.14      11.86 |    100.00 

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(14)       =      18.92
                                                Prob > chi2       =     0.1681
Log likelihood = -2876.4327                     Pseudo R2         =     0.0033

------------------------------------------------------------------------------
positivetest | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8388775   .1049581    -1.40   0.160     .6564452     1.07201
      Black  |   .8291755   .1037236    -1.50   0.134     .6488848    1.059559
      Mixed  |   .8540416   .1048201    -1.29   0.199     .6714404    1.086302
      Other  |   .7189675   .0915148    -2.59   0.010     .5602255    .9226897
    Unknown  |   .9016262    .097445    -0.96   0.338     .7295099     1.11435
             |
         stp |
          2  |   1.317999    .202191     1.80   0.072     .9757406    1.780311
          3  |   1.052168   .1702329     0.31   0.753     .7662436    1.444784
          4  |   1.196968   .1922384     1.12   0.263     .8737274    1.639794
          5  |   1.237623   .1935893     1.36   0.173     .9108421    1.681642
          6  |   1.090319     .17515     0.54   0.590     .7958212    1.493796
          7  |   1.324084   .2066083     1.80   0.072     .9752034    1.797777
          8  |   1.119494   .1809099     0.70   0.485     .8155822    1.536652
          9  |   1.386718   .2130342     2.13   0.033     1.026177    1.873931
         10  |   .9712863    .161363    -0.18   0.861     .7013492    1.345117
             |
       _cons |   .1336863   .0183982   -14.62   0.000     .1020804    .1750779
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_positivetest_eth5.ster saved
file ./output/crude_positivetest_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(18)       =      21.12
                                                Prob > chi2       =     0.2735
Log likelihood = -2875.3325                     Pseudo R2         =     0.0037

------------------------------------------------------------------------------
positivetest | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8400216   .1051605    -1.39   0.164     .6572496     1.07362
      Black  |   .8292134   .1037511    -1.50   0.134     .6488795    1.059665
      Mixed  |   .8538014   .1048475    -1.29   0.198      .671164    1.086138
      Other  |    .717916   .0914207    -2.60   0.009     .5593455      .92144
    Unknown  |   .9024568     .09758    -0.95   0.343     .7301103    1.115486
             |
        male |
       Male  |    1.05518   .0734772     0.77   0.441     .9205631    1.209483
        age1 |    1.01099   .0097792     1.13   0.259     .9920033    1.030339
        age2 |   .9699606   .0339909    -0.87   0.384     .9055761    1.038923
        age3 |   1.071739   .0996263     0.75   0.456     .8932298    1.285922
             |
         stp |
          2  |    1.30959   .2010058     1.76   0.079     .9693628    1.769229
          3  |   1.048348   .1696625     0.29   0.770     .7633941    1.439668
          4  |   1.191263   .1914022     1.09   0.276     .8694482    1.632193
          5  |   1.229383   .1924081     1.32   0.187     .9046231    1.670733
          6  |   1.085012   .1743703     0.51   0.612      .791844    1.486722
          7  |   1.317879   .2057275     1.77   0.077     .9705068    1.789585
          8  |   1.112486   .1798663     0.66   0.510     .8103496    1.527272
          9  |   1.377814   .2117857     2.09   0.037     1.019415    1.862215
         10  |   .9657086   .1604994    -0.21   0.834     .6972326    1.337564
             |
       _cons |   .0936827    .029387    -7.55   0.000     .0506582    .1732485
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_positivetest_eth5.ster saved
file ./output/model0_positivetest_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(20)       =      21.99
                                                Prob > chi2       =     0.3410
Log likelihood = -2874.8958                     Pseudo R2         =     0.0038

----------------------------------------------------------------------------------
    positivetest | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            eth5 |
    South Asian  |   .8399889   .1051616    -1.39   0.164     .6572161    1.073591
          Black  |   .8294723   .1037911    -1.49   0.135     .6490704    1.060015
          Mixed  |   .8529691   .1047523    -1.29   0.195     .6704988    1.085097
          Other  |   .7190386   .0915812    -2.59   0.010     .5601934    .9229251
        Unknown  |   .9019409    .097531    -0.95   0.340     .7296823    1.114865
                 |
            male |
           Male  |   1.055372   .0735008     0.77   0.439     .9207131    1.209726
            age1 |   1.010936   .0097808     1.12   0.261     .9919466    1.030289
            age2 |   .9700785   .0340033    -0.87   0.386     .9056709    1.039066
            age3 |   1.071437   .0996189     0.74   0.458     .8929449    1.285609
                 |
             imd |
              4  |   1.036558    .093186     0.40   0.690     .8691029    1.236278
5 most deprived  |   1.107357   .1243113     0.91   0.364     .8886528    1.379885
                 |
             stp |
              2  |   1.308811   .2009024     1.75   0.080     .9687633     1.76822
              3  |   1.045132   .1691915     0.27   0.785     .7609815    1.435384
              4  |   1.191399   .1914379     1.09   0.276     .8695276    1.632417
              5  |   1.228324   .1922673     1.31   0.189     .9038078     1.66936
              6  |   1.082677   .1740311     0.49   0.621     .7900879    1.483619
              7  |   1.315795   .2054585     1.76   0.079     .9688915    1.786905
              8  |    1.11258   .1798991     0.66   0.509     .8103933    1.527449
              9  |   1.378011   .2118333     2.09   0.037     1.019536    1.862528
             10  |   .9641209   .1602693    -0.22   0.826     .6960385    1.335457
                 |
           _cons |   .0922745   .0289931    -7.58   0.000      .049846    .1708179
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_positivetest_eth5.ster saved
file ./output/model1_positivetest_eth5.dta saved
file ./output/model2_positivetest_eth5.dta saved
file ./output/model3_positivetest_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)
  78,759
(69,432 observations deleted)
  9,327
(1,402 observations deleted)
  7,925

   outcome |      outcome hes
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     6,946        979 |     7,925 
-----------+----------------------+----------
     Total |     6,946        979 |     7,925 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |      outcome hes
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,053        164 |     1,217 
            |     86.52      13.48 |    100.00 
------------+----------------------+----------
South Asian |       991        152 |     1,143 
            |     86.70      13.30 |    100.00 
------------+----------------------+----------
      Black |     1,034        116 |     1,150 
            |     89.91      10.09 |    100.00 
------------+----------------------+----------
      Mixed |     1,060        150 |     1,210 
            |     87.60      12.40 |    100.00 
------------+----------------------+----------
      Other |     1,056        149 |     1,205 
            |     87.63      12.37 |    100.00 
------------+----------------------+----------
    Unknown |     1,752        248 |     2,000 
            |     87.60      12.40 |    100.00 
------------+----------------------+----------
      Total |     6,946        979 |     7,925 
            |     87.65      12.35 |    100.00 

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(14)       =      22.53
                                                Prob > chi2       =     0.0684
Log likelihood = -2951.9415                     Pseudo R2         =     0.0038

------------------------------------------------------------------------------
         hes | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9820592   .1189884    -0.15   0.881     .7744694    1.245292
      Black  |   .7194745   .0929265    -2.55   0.011      .558567     .926735
      Mixed  |   .9008924   .1092178    -0.86   0.389     .7103614    1.142527
      Other  |   .9098082   .1104688    -0.78   0.436     .7171287    1.154257
    Unknown  |   .9105862   .0984203    -0.87   0.386     .7367487    1.125441
             |
         stp |
          2  |   1.036622   .1479754     0.25   0.801     .7836341    1.371284
          3  |   1.007498   .1465154     0.05   0.959     .7576321     1.33977
          4  |   .9545923   .1428991    -0.31   0.756     .7118624    1.280088
          5  |   .7652732   .1172119    -1.75   0.081     .5668178    1.033212
          6  |   .9382766   .1381918    -0.43   0.665     .7030135     1.25227
          7  |   .6802383   .1079974    -2.43   0.015     .4983344    .9285413
          8  |   .9794042   .1447639    -0.14   0.888     .7330734    1.308508
          9  |    .787392   .1199405    -1.57   0.117     .5841584    1.061332
         10  |   .9094993   .1363382    -0.63   0.527     .6779587    1.220117
             |
       _cons |   .1723094   .0219985   -13.77   0.000     .1341644    .2212997
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_hes_eth5.ster saved
file ./output/crude_hes_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(18)       =      23.49
                                                Prob > chi2       =     0.1724
Log likelihood = -2951.4579                     Pseudo R2         =     0.0040

------------------------------------------------------------------------------
         hes | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .984518   .1193336    -0.13   0.898     .7763353    1.248527
      Black  |   .7195245   .0929428    -2.55   0.011     .5585907    .9268244
      Mixed  |   .9024916   .1094535    -0.85   0.398     .7115576    1.144659
      Other  |    .909485   .1104615    -0.78   0.435     .7168246    1.153927
    Unknown  |   .9123096   .0986367    -0.85   0.396     .7380952    1.127644
             |
        male |
       Male  |   1.018662   .0697209     0.27   0.787      .890781    1.164902
        age1 |   1.008137   .0094593     0.86   0.388     .9897669    1.026849
        age2 |   .9683705   .0331523    -0.94   0.348     .9055252    1.035577
        age3 |   1.087748   .0989305     0.92   0.355     .9101471    1.300005
             |
         stp |
          2  |   1.033882   .1476602     0.23   0.816       .78145    1.367856
          3  |   1.005651   .1462824     0.04   0.969     .7561902    1.337406
          4  |   .9532607   .1427593    -0.32   0.749     .7107823    1.278459
          5  |   .7624251   .1168348    -1.77   0.077     .5646225    1.029523
          6  |    .935986   .1379038    -0.45   0.653     .7012249    1.249342
          7  |   .6788329   .1078103    -2.44   0.015     .4972531    .9267196
          8  |   .9763052   .1443774    -0.16   0.871     .7306488    1.304555
          9  |   .7852929   .1196832    -1.59   0.113     .5825103    1.058668
         10  |   .9076655   .1361133    -0.65   0.518     .6765188    1.217788
             |
       _cons |   .1377492   .0414068    -6.59   0.000     .0764226    .2482885
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_hes_eth5.ster saved
file ./output/model0_hes_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(20)       =      25.93
                                                Prob > chi2       =     0.1681
Log likelihood =  -2950.238                     Pseudo R2         =     0.0044

----------------------------------------------------------------------------------
             hes | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            eth5 |
    South Asian  |    .983619   .1192442    -0.14   0.892     .7755962    1.247436
          Black  |   .7191184   .0929058    -2.55   0.011     .5582519    .9263404
          Mixed  |   .9015713   .1093622    -0.85   0.393     .7108007    1.143543
          Other  |   .9085725   .1103885    -0.79   0.430     .7160469    1.152863
        Unknown  |   .9114653   .0985627    -0.86   0.391     .7373847    1.126642
                 |
            male |
           Male  |   1.017941    .069688     0.26   0.795     .8901217    1.164114
            age1 |   1.007893   .0094584     0.84   0.402     .9895242    1.026602
            age2 |   .9692323   .0331826    -0.91   0.361     .9063296    1.036501
            age3 |   1.085133   .0986934     0.90   0.369     .9079577    1.296881
                 |
             imd |
              4  |   1.142527   .0985465     1.54   0.122     .9648235    1.352961
5 most deprived  |   .9944435    .113875    -0.05   0.961     .7945257    1.244664
                 |
             stp |
              2  |   1.034503   .1477737     0.24   0.812     .7818827    1.368742
              3  |    1.00298   .1459628     0.02   0.984     .7540802    1.334034
              4  |   .9528464   .1427222    -0.32   0.747      .710437    1.277969
              5  |   .7600571   .1165036    -1.79   0.073      .562823    1.026409
              6  |   .9332844   .1375524    -0.47   0.639     .6991324    1.245858
              7  |   .6759582   .1073908    -2.47   0.014     .4950941    .9228941
              8  |   .9739443   .1440579    -0.18   0.858     .7288386    1.301478
              9  |   .7838151   .1194824    -1.60   0.110     .5813786     1.05674
             10  |   .9038911   .1355989    -0.67   0.501     .6736302     1.21286
                 |
           _cons |   .1356562   .0408329    -6.64   0.000     .0752014     .244711
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_hes_eth5.ster saved
file ./output/model1_hes_eth5.dta saved
file ./output/model2_hes_eth5.dta saved
file ./output/model3_hes_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)
  78,759
(69,432 observations deleted)
  9,327
(1,402 observations deleted)
  7,925

   outcome | outcome onscoviddeath
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,793        132 |     7,925 
-----------+----------------------+----------
     Total |     7,793        132 |     7,925 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 | outcome onscoviddeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,195         22 |     1,217 
            |     98.19       1.81 |    100.00 
------------+----------------------+----------
South Asian |     1,124         19 |     1,143 
            |     98.34       1.66 |    100.00 
------------+----------------------+----------
      Black |     1,128         22 |     1,150 
            |     98.09       1.91 |    100.00 
------------+----------------------+----------
      Mixed |     1,195         15 |     1,210 
            |     98.76       1.24 |    100.00 
------------+----------------------+----------
      Other |     1,190         15 |     1,205 
            |     98.76       1.24 |    100.00 
------------+----------------------+----------
    Unknown |     1,961         39 |     2,000 
            |     98.05       1.95 |    100.00 
------------+----------------------+----------
      Total |     7,793        132 |     7,925 
            |     98.33       1.67 |    100.00 

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(14)       =      12.03
                                                Prob > chi2       =     0.6038
Log likelihood = -665.41575                     Pseudo R2         =     0.0090

-------------------------------------------------------------------------------
onscoviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         eth5 |
 South Asian  |   .9317223   .2946649    -0.22   0.823     .5012876    1.731753
       Black  |   1.068103   .3254732     0.22   0.829     .5878066     1.94085
       Mixed  |   .6768941   .2285307    -1.16   0.248     .3492536    1.311899
       Other  |   .6936334   .2341556    -1.08   0.279     .3579173    1.344241
     Unknown  |   1.082669   .2916986     0.29   0.768     .6384993    1.835824
              |
          stp |
           2  |   1.331456    .473958     0.80   0.421      .662712     2.67503
           3  |    .805467    .327121    -0.53   0.594     .3633731    1.785429
           4  |    1.43066   .5152934     0.99   0.320     .7062393    2.898152
           5  |   1.007857   .3844932     0.02   0.984     .4771652     2.12877
           6  |   .9537211   .3706587    -0.12   0.903     .4452525     2.04285
           7  |   .6708177   .2887611    -0.93   0.354     .2885328    1.559603
           8  |   .6877647   .2959883    -0.87   0.384     .2958792    1.598694
           9  |   .7915199   .3215046    -0.58   0.565     .3570388    1.754722
          10  |   1.079541   .4119271     0.20   0.841     .5110238    2.280538
              |
        _cons |   .0187935   .0062671   -11.92   0.000     .0097759    .0361295
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_onscoviddeath_eth5.ster saved
file ./output/crude_onscoviddeath_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(18)       =      14.92
                                                Prob > chi2       =     0.6673
Log likelihood = -663.97052                     Pseudo R2         =     0.0111

-------------------------------------------------------------------------------
onscoviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         eth5 |
 South Asian  |   .9374537     .29661    -0.20   0.838     .5042315    1.742889
       Black  |    1.06567   .3248082     0.21   0.835     .5863856    1.936701
       Mixed  |   .6784723   .2291629    -1.15   0.251     .3499675    1.315336
       Other  |   .6919442   .2336557    -1.09   0.275     .3569747    1.341235
     Unknown  |   1.088445   .2934039     0.31   0.753     .6417329    1.846114
              |
         male |
        Male  |   1.054875   .1855055     0.30   0.761       .74733    1.488982
         age1 |   1.042692   .0267602     1.63   0.103     .9915401    1.096483
         age2 |   .8727751   .0787312    -1.51   0.131     .7313366    1.041568
         age3 |   1.397475   .3316128     1.41   0.158     .8777258    2.224996
              |
          stp |
           2  |     1.3107   .4669005     0.76   0.448      .652058    2.634633
           3  |   .7971858    .323868    -0.56   0.577     .3595397    1.767552
           4  |   1.413542   .5094255     0.96   0.337     .6975008    2.864657
           5  |   .9875582   .3770179    -0.03   0.974      .467306    2.087008
           6  |   .9404501   .3657135    -0.16   0.875     .4388624    2.015316
           7  |   .6635783   .2857889    -0.95   0.341     .2852975    1.543428
           8  |   .6758592    .291026    -0.91   0.363     .2906214    1.571755
           9  |   .7776528   .3160618    -0.62   0.536     .3506158    1.724805
          10  |    1.06209   .4055152     0.16   0.875     .5025337    2.244696
              |
        _cons |   .0054174   .0045317    -6.24   0.000     .0010514     .027914
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_onscoviddeath_eth5.ster saved
file ./output/model0_onscoviddeath_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(20)       =      16.63
                                                Prob > chi2       =     0.6772
Log likelihood = -663.11872                     Pseudo R2         =     0.0124

----------------------------------------------------------------------------------
   onscoviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            eth5 |
    South Asian  |   .9404973   .2976151    -0.19   0.846     .5058242    1.748701
          Black  |    1.06867   .3257726     0.22   0.828      .587982    1.942331
          Mixed  |   .6785041   .2292281    -1.15   0.251     .3499289    1.315604
          Other  |   .6964022   .2352295    -1.07   0.284     .3592054    1.350136
        Unknown  |   1.088771    .293545     0.32   0.752     .6418642    1.846844
                 |
            male |
           Male  |   1.057888   .1860738     0.32   0.749     .7494116    1.493341
            age1 |   1.043141   .0267912     1.64   0.100     .9919313    1.096995
            age2 |   .8711312   .0786834    -1.53   0.127     .7297941    1.039841
            age3 |   1.404853   .3337875     1.43   0.153     .8818379    2.238067
                 |
             imd |
              4  |   .7911568   .1963319    -0.94   0.345     .4864409    1.286753
5 most deprived  |   1.211877   .3231674     0.72   0.471      .718574    2.043835
                 |
             stp |
              2  |   1.308741   .4662887     0.76   0.450     .6509994    2.631035
              3  |   .7980588   .3243371    -0.56   0.579     .3598323    1.769985
              4  |   1.415791    .510314     0.96   0.335     .6985353    2.869525
              5  |    .993997   .3795386    -0.02   0.987     .4702947    2.100874
              6  |    .943308    .366925    -0.15   0.881     .4401045    2.021861
              7  |   .6673343   .2874916    -0.94   0.348     .2868407    1.552552
              8  |   .6806251   .2931236    -0.89   0.372     .2926324    1.583046
              9  |   .7811928   .3175351    -0.61   0.544     .3521813    1.732807
             10  |   1.069771   .4085594     0.18   0.860     .5060646    2.261391
                 |
           _cons |   .0054144   .0045391    -6.23   0.000      .001047    .0279994
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_onscoviddeath_eth5.ster saved
file ./output/model1_onscoviddeath_eth5.dta saved
file ./output/model2_onscoviddeath_eth5.dta saved
file ./output/model3_onscoviddeath_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)
  78,759
(69,432 observations deleted)
  9,327
(1,402 observations deleted)
  7,925

           |        outcome
   outcome |   ons_noncoviddeath
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,495        430 |     7,925 
-----------+----------------------+----------
     Total |     7,495        430 |     7,925 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

            |        outcome
      Eth 5 |   ons_noncoviddeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,148         69 |     1,217 
            |     94.33       5.67 |    100.00 
------------+----------------------+----------
South Asian |     1,083         60 |     1,143 
            |     94.75       5.25 |    100.00 
------------+----------------------+----------
      Black |     1,101         49 |     1,150 
            |     95.74       4.26 |    100.00 
------------+----------------------+----------
      Mixed |     1,142         68 |     1,210 
            |     94.38       5.62 |    100.00 
------------+----------------------+----------
      Other |     1,131         74 |     1,205 
            |     93.86       6.14 |    100.00 
------------+----------------------+----------
    Unknown |     1,890        110 |     2,000 
            |     94.50       5.50 |    100.00 
------------+----------------------+----------
      Total |     7,495        430 |     7,925 
            |     94.57       5.43 |    100.00 

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(14)       =       8.08
                                                Prob > chi2       =     0.8850
Log likelihood = -1667.0933                     Pseudo R2         =     0.0024

-----------------------------------------------------------------------------------
ons_noncoviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
             eth5 |
     South Asian  |   .9151642   .1662683    -0.49   0.626     .6409904    1.306612
           Black  |   .7338991    .140664    -1.61   0.106     .5040683    1.068522
           Mixed  |   .9852708   .1734429    -0.08   0.933     .6977723    1.391226
           Other  |   1.082628   .1868795     0.46   0.646      .771876    1.518485
         Unknown  |    .967049    .152958    -0.21   0.832      .709274    1.318508
                  |
              stp |
               2  |   .9088177   .1942018    -0.45   0.655     .5978424    1.381551
               3  |   .9467947   .2035322    -0.25   0.799     .6212598    1.442907
               4  |    .849353   .1910824    -0.73   0.468     .5464997    1.320038
               5  |   .9276248   .1994307    -0.35   0.727      .608656     1.41375
               6  |    .804947   .1796554    -0.97   0.331     .5197427    1.246655
               7  |    .937415   .2028053    -0.30   0.765      .613449    1.432469
               8  |   1.132585   .2363843     0.60   0.551     .7523409     1.70501
               9  |   .8875507   .1930209    -0.55   0.583     .5795319     1.35928
              10  |   .8661941    .192127    -0.65   0.517     .5608073    1.337879
                  |
            _cons |   .0652052   .0121958   -14.60   0.000     .0451935     .094078
-----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_ons_noncoviddeath_eth5.ster saved
file ./output/crude_ons_noncoviddeath_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(18)       =      14.45
                                                Prob > chi2       =     0.6996
Log likelihood =  -1663.911                     Pseudo R2         =     0.0043

-----------------------------------------------------------------------------------
ons_noncoviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
             eth5 |
     South Asian  |   .9149677    .166376    -0.49   0.625      .640656    1.306732
           Black  |   .7357608   .1410759    -1.60   0.110     .5052729    1.071389
           Mixed  |   .9833912   .1732444    -0.10   0.924     .6962574    1.388938
           Other  |   1.088823   .1880647     0.49   0.622     .7761313    1.527493
         Unknown  |   .9658958   .1528729    -0.22   0.826     .7082883    1.317196
                  |
             male |
            Male  |   .9335818    .092872    -0.69   0.490     .7682022    1.134565
             age1 |   .9935385   .0135019    -0.48   0.633     .9674246    1.020357
             age2 |    1.05318   .0528217     1.03   0.302     .9545768    1.161968
             age3 |   .8351036   .1124798    -1.34   0.181     .6413459    1.087398
                  |
              stp |
               2  |   .9088391    .194371    -0.45   0.655     .5976443    1.382074
               3  |   .9432064     .20287    -0.27   0.786     .6187649    1.437765
               4  |   .8527496   .1919835    -0.71   0.479     .5485126    1.325734
               5  |   .9291435   .1999392    -0.34   0.733     .6094185    1.416609
               6  |   .8027674   .1792864    -0.98   0.325     .5181867    1.243636
               7  |   .9427249   .2040948    -0.27   0.785     .6167434    1.441005
               8  |   1.136613   .2374272     0.61   0.540     .7547533    1.711671
               9  |   .8922719    .194221    -0.52   0.601     .5823928    1.367031
              10  |   .8647498   .1919382    -0.65   0.513     .5597054    1.336046
                  |
            _cons |   .0776355   .0336803    -5.89   0.000     .0331732    .1816911
-----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_ons_noncoviddeath_eth5.ster saved
file ./output/model0_ons_noncoviddeath_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(20)       =      16.93
                                                Prob > chi2       =     0.6576
Log likelihood = -1662.6699                     Pseudo R2         =     0.0051

-----------------------------------------------------------------------------------
ons_noncoviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
             eth5 |
     South Asian  |   .9154665   .1665007    -0.49   0.627     .6409585     1.30754
           Black  |   .7359613   .1411333    -1.60   0.110     .5053851    1.071735
           Mixed  |   .9845583    .173496    -0.09   0.930       .69702    1.390714
           Other  |   1.088691   .1880946     0.49   0.623     .7759637    1.527453
         Unknown  |   .9668935   .1530575    -0.21   0.832     .7089816    1.318628
                  |
             male |
            Male  |   .9347375   .0930019    -0.68   0.498     .7691291    1.136005
             age1 |   .9938163   .0135125    -0.46   0.648     .9676821    1.020656
             age2 |   1.052161   .0528042     1.01   0.311     .9535942    1.160917
             age3 |   .8373046   .1128531    -1.32   0.188     .6429205     1.09046
                  |
              imd |
               4  |   .8109281    .110563    -1.54   0.124     .6207666    1.059342
 5 most deprived  |    .936071   .1550444    -0.40   0.690     .6765839    1.295078
                  |
              stp |
               2  |   .9086728   .1943647    -0.45   0.654     .5974972    1.381908
               3  |   .9482174   .2040182    -0.25   0.805     .6219616    1.445614
               4  |   .8527855   .1920156    -0.71   0.479     .5485054    1.325863
               5  |   .9325716   .2007132    -0.32   0.746     .6116203    1.421944
               6  |   .8067244   .1802092    -0.96   0.336     .5206915    1.249885
               7  |   .9480726   .2052985    -0.25   0.805     .6201829    1.449317
               8  |   1.140135   .2382155     0.63   0.530     .7570237     1.71713
               9  |    .893905   .1946054    -0.52   0.606     .5834217     1.36962
              10  |   .8701791   .1931944    -0.63   0.531     .5631545     1.34459
                  |
            _cons |   .0800719   .0348229    -5.81   0.000     .0341426    .1877862
-----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_ons_noncoviddeath_eth5.ster saved
file ./output/model1_ons_noncoviddeath_eth5.dta saved
file ./output/model2_ons_noncoviddeath_eth5.dta saved
file ./output/model3_ons_noncoviddeath_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)
  78,759
(69,432 observations deleted)
  9,327
(1,402 observations deleted)
  7,925

   outcome |   outcome onsdeath
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,363        562 |     7,925 
-----------+----------------------+----------
     Total |     7,363        562 |     7,925 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |   outcome onsdeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,126         91 |     1,217 
            |     92.52       7.48 |    100.00 
------------+----------------------+----------
South Asian |     1,064         79 |     1,143 
            |     93.09       6.91 |    100.00 
------------+----------------------+----------
      Black |     1,079         71 |     1,150 
            |     93.83       6.17 |    100.00 
------------+----------------------+----------
      Mixed |     1,127         83 |     1,210 
            |     93.14       6.86 |    100.00 
------------+----------------------+----------
      Other |     1,116         89 |     1,205 
            |     92.61       7.39 |    100.00 
------------+----------------------+----------
    Unknown |     1,851        149 |     2,000 
            |     92.55       7.45 |    100.00 
------------+----------------------+----------
      Total |     7,363        562 |     7,925 
            |     92.91       7.09 |    100.00 

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(14)       =       4.94
                                                Prob > chi2       =     0.9866
Log likelihood = -2026.3195                     Pseudo R2         =     0.0012

------------------------------------------------------------------------------
    onsdeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9169319   .1464599    -0.54   0.587     .6704651    1.254001
      Black  |   .8102394   .1329584    -1.28   0.200     .5873989    1.117618
      Mixed  |    .905815   .1427724    -0.63   0.530     .6650819    1.233684
      Other  |   .9857979   .1528264    -0.09   0.926     .7274912     1.33582
    Unknown  |   .9955527    .137778    -0.03   0.974     .7590381    1.305765
             |
         stp |
          2  |   1.006786   .1867086     0.04   0.971     .6999737     1.44808
          3  |   .9114325   .1752873    -0.48   0.630     .6252028    1.328704
          4  |   .9834412   .1894366    -0.09   0.931     .6741936    1.434538
          5  |   .9448551   .1794024    -0.30   0.765      .651246    1.370835
          6  |   .8354045   .1637619    -0.92   0.359      .568903    1.226748
          7  |   .8721831   .1702248    -0.70   0.483     .5949464    1.278608
          8  |   1.028152   .1946098     0.15   0.883     .7094815    1.489957
          9  |    .861729   .1672511    -0.77   0.443     .5890646    1.260604
         10  |   .9132273    .177437    -0.47   0.640     .6240124    1.336486
             |
       _cons |   .0865777    .014323   -14.79   0.000     .0626019     .119736
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_onsdeath_eth5.ster saved
file ./output/crude_onsdeath_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(18)       =       9.88
                                                Prob > chi2       =     0.9357
Log likelihood = -2023.8506                     Pseudo R2         =     0.0024

------------------------------------------------------------------------------
    onsdeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9183472   .1467919    -0.53   0.594     .6713482    1.256221
      Black  |    .811656    .133234    -1.27   0.204     .5883647    1.119689
      Mixed  |   .9051392   .1427566    -0.63   0.527     .6644552    1.233006
      Other  |   .9895462   .1534836    -0.07   0.946     .7301472    1.341102
    Unknown  |   .9958423   .1378948    -0.03   0.976     .7591441    1.306342
             |
        male |
       Male  |   .9603413   .0842377    -0.46   0.645     .8086513    1.140486
        age1 |   1.004999   .0121863     0.41   0.681     .9813961     1.02917
        age2 |   1.006664   .0445624     0.15   0.881     .9230049    1.097906
        age3 |   .9458989   .1118785    -0.47   0.638     .7501822    1.192676
             |
         stp |
          2  |   1.003321   .1862115     0.02   0.986     .6973668    1.443507
          3  |   .9070581   .1745238    -0.51   0.612     .6220975    1.322549
          4  |   .9839065   .1896538    -0.08   0.933     .6743412    1.435582
          5  |    .941725   .1789549    -0.32   0.752     .6488902    1.366712
          6  |   .8311688   .1630309    -0.94   0.346      .565886    1.220814
          7  |   .8736341   .1706108    -0.69   0.489     .5957988    1.281031
          8  |   1.026734   .1944851     0.14   0.889     .7083086    1.488311
          9  |   .8620053   .1674366    -0.76   0.445     .5890768    1.261386
         10  |   .9093916   .1768014    -0.49   0.625     .6212447    1.331187
             |
       _cons |    .073955   .0287773    -6.69   0.000     .0344944    .1585575
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_onsdeath_eth5.ster saved
file ./output/model0_onsdeath_eth5.dta saved

Logistic regression                             Number of obs     =      7,925
                                                LR chi2(20)       =      13.46
                                                Prob > chi2       =     0.8568
Log likelihood = -2022.0621                     Pseudo R2         =     0.0033

----------------------------------------------------------------------------------
        onsdeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            eth5 |
    South Asian  |   .9194336   .1470033    -0.53   0.599     .6720882    1.257808
          Black  |   .8122915   .1333664    -1.27   0.205     .5887855    1.120642
          Mixed  |    .906177   .1429673    -0.62   0.532     .6651495    1.234545
          Other  |   .9908512   .1537423    -0.06   0.953     .7310287     1.34302
        Unknown  |   .9969627   .1380842    -0.02   0.982      .759947      1.3079
                 |
            male |
           Male  |   .9617841   .0843844    -0.44   0.657      .809833    1.142246
            age1 |   1.005332   .0121981     0.44   0.661     .9817065    1.029527
            age2 |   1.005444   .0445454     0.12   0.902     .9218196    1.096654
            age3 |   .9490469   .1123471    -0.44   0.659     .7525292    1.196884
                 |
             imd |
              4  |   .8018509   .0968908    -1.83   0.068     .6327609    1.016126
5 most deprived  |   1.001504   .1429635     0.01   0.992     .7570851    1.324832
                 |
             stp |
              2  |   1.002834   .1861649     0.02   0.988     .6969682    1.442929
              3  |   .9109862   .1753535    -0.48   0.628     .6246922    1.328488
              4  |   .9842629   .1897631    -0.08   0.934     .6745309    1.436218
              5  |     .94566   .1797509    -0.29   0.769     .6515366     1.37256
              6  |   .8350545   .1638431    -0.92   0.358     .5684648    1.226665
              7  |   .8789866   .1717105    -0.66   0.509     .5993763    1.289036
              8  |   1.030676   .1952899     0.16   0.873     .7109493     1.49419
              9  |   .8641809   .1678951    -0.75   0.452     .5905153    1.264673
             10  |   .9154064   .1780322    -0.45   0.649     .6252715    1.340168
                 |
           _cons |   .0757318   .0295424    -6.62   0.000     .0352559    .1626768
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_onsdeath_eth5.ster saved
file ./output/model1_onsdeath_eth5.dta saved
file ./output/model2_onsdeath_eth5.dta saved
file ./output/model3_onsdeath_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)

. file close tablecontent

. 
. ************************************************create forestplot dataset
. dsconcat `hr'

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. split idstr, p(_)
variables created as string: 
idstr1  idstr2  idstr3  idstr4

. ren idstr1 model

. ren idstr2 outcome

. drop idstr idstr3

. tab model

      model |      Freq.     Percent        Cum.
------------+-----------------------------------
      crude |         85        7.83        7.83
     model0 |        110       10.14       17.97
     model1 |        125       11.52       29.49
     model2 |        375       34.56       64.06
     model3 |        390       35.94      100.00
------------+-----------------------------------
      Total |      1,085      100.00

. 
. *save dataset for later
. outsheet using ./output/FP_testedpop_eth5.txt, replace

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/Ethnicity-2nd-wave/logs/07b_eth_an_testedpop_eth5.log
  log type:  text
 closed on:  15 Jan 2021, 14:27:31
--------------------------------------------------------------------------------------------------------------------
